MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1779/mcu.h
extern volatile TMR3Lbits_t TMR3Lbits __at(0x01C);
// bitfield macros
#define _TMR3L_TMR_POSN                                     0x0
#define _TMR3L_TMR_POSITION                                 0x0
#define _TMR3L_TMR_SIZE                                     0x8
#define _TMR3L_TMR_LENGTH                                   0x8
#define _TMR3L_TMR_MASK                                     0xFF

// Register: TMR3H
#define TMR3H TMR3H
extern volatile unsigned char           TMR3H               __at(0x01D);
#ifndef _LIB_BUILD
asm("TMR3H equ 01Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
} TMR3Hbits_t;
extern volatile TMR3Hbits_t TMR3Hbits __at(0x01D);
// bitfield macros
#define _TMR3H_TMR_POSN                                     0x0
#define _TMR3H_TMR_POSITION                                 0x0
#define _TMR3H_TMR_SIZE                                     0x8
#define _TMR3H_TMR_LENGTH                                   0x8
#define _TMR3H_TMR_MASK                                     0xFF

// Register: T3CON
#define T3CON T3CON
extern volatile unsigned char           T3CON               __at(0x01E);
#ifndef _LIB_BUILD
asm("T3CON equ 01Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ON                     :1;
        unsigned                        :1;
        unsigned nSYNC                  :1;
        unsigned OSCEN                  :1;
        unsigned CKPS                   :2;
        unsigned CS                     :2;
    };
    struct {
        unsigned TMRON                  :1;
        unsigned                        :1;
        unsigned SYNC                   :1;
        unsigned SOSCEN                 :1;
        unsigned CKPS0                  :1;
        unsigned CKPS1                  :1;
        unsigned CS0                    :1;
        unsigned CS1                    :1;
    };
    struct {
        unsigned TMR3ON                 :1;
        unsigned                        :1;
        unsigned nT3SYNC                :1;
        unsigned T3OSCEN                :1;
        unsigned                        :2;
        unsigned T3CS0                  :1;
        unsigned T3CS1                  :1;
    };
    struct {
        unsigned T3ON                   :1;
        unsigned                        :3;
        unsigned T3CKPS0                :1;
        unsigned T3CKPS1                :1;
        unsigned TMR3CS0                :1;
        unsigned TMR3CS1                :1;
    };
} T3CONbits_t;
extern volatile T3CONbits_t T3CONbits __at(0x01E);
// bitfield macros
#define _T3CON_ON_POSN                                      0x0
#define _T3CON_ON_POSITION                                  0x0
#define _T3CON_ON_SIZE                                      0x1
#define _T3CON_ON_LENGTH                                    0x1
#define _T3CON_ON_MASK                                      0x1
#define _T3CON_nSYNC_POSN                                   0x2
#define _T3CON_nSYNC_POSITION                               0x2
#define _T3CON_nSYNC_SIZE                                   0x1
#define _T3CON_nSYNC_LENGTH                                 0x1
#define _T3CON_nSYNC_MASK                                   0x4
#define _T3CON_OSCEN_POSN                                   0x3
#define _T3CON_OSCEN_POSITION                               0x3
#define _T3CON_OSCEN_SIZE                                   0x1
#define _T3CON_OSCEN_LENGTH                                 0x1
#define _T3CON_OSCEN_MASK                                   0x8
#define _T3CON_CKPS_POSN                                    0x4
#define _T3CON_CKPS_POSITION                                0x4
#define _T3CON_CKPS_SIZE                                    0x2
#define _T3CON_CKPS_LENGTH                                  0x2
#define _T3CON_CKPS_MASK                                    0x30
#define _T3CON_CS_POSN                                      0x6
#define _T3CON_CS_POSITION                                  0x6
#define _T3CON_CS_SIZE                                      0x2
#define _T3CON_CS_LENGTH                                    0x2
#define _T3CON_CS_MASK                                      0xC0
#define _T3CON_TMRON_POSN                                   0x0
#define _T3CON_TMRON_POSITION                               0x0
#define _T3CON_TMRON_SIZE                                   0x1
#define _T3CON_TMRON_LENGTH                                 0x1
#define _T3CON_TMRON_MASK                                   0x1
#define _T3CON_SYNC_POSN                                    0x2
#define _T3CON_SYNC_POSITION                                0x2
#define _T3CON_SYNC_SIZE                                    0x1
#define _T3CON_SYNC_LENGTH                                  0x1
#define _T3CON_SYNC_MASK                                    0x4
#define _T3CON_SOSCEN_POSN                                  0x3
#define _T3CON_SOSCEN_POSITION                              0x3
#define _T3CON_SOSCEN_SIZE                                  0x1
#define _T3CON_SOSCEN_LENGTH                                0x1
#define _T3CON_SOSCEN_MASK                                  0x8
#define _T3CON_CKPS0_POSN                                   0x4
#define _T3CON_CKPS0_POSITION                               0x4
#define _T3CON_CKPS0_SIZE                                   0x1
#define _T3CON_CKPS0_LENGTH                                 0x1
#define _T3CON_CKPS0_MASK                                   0x10
#define _T3CON_CKPS1_POSN                                   0x5
#define _T3CON_CKPS1_POSITION                               0x5
#define _T3CON_CKPS1_SIZE                                   0x1
#define _T3CON_CKPS1_LENGTH                                 0x1
#define _T3CON_CKPS1_MASK                                   0x20
#define _T3CON_CS0_POSN                                     0x6
#define _T3CON_CS0_POSITION                                 0x6
#define _T3CON_CS0_SIZE                                     0x1
#define _T3CON_CS0_LENGTH                                   0x1
#define _T3CON_CS0_MASK                                     0x40
#define _T3CON_CS1_POSN                                     0x7
#define _T3CON_CS1_POSITION                                 0x7
#define _T3CON_CS1_SIZE                                     0x1
#define _T3CON_CS1_LENGTH                                   0x1
#define _T3CON_CS1_MASK                                     0x80
#define _T3CON_TMR3ON_POSN                                  0x0
#define _T3CON_TMR3ON_POSITION                              0x0
#define _T3CON_TMR3ON_SIZE                                  0x1
#define _T3CON_TMR3ON_LENGTH                                0x1
#define _T3CON_TMR3ON_MASK                                  0x1
#define _T3CON_nT3SYNC_POSN                                 0x2
#define _T3CON_nT3SYNC_POSITION                             0x2
#define _T3CON_nT3SYNC_SIZE                                 0x1
#define _T3CON_nT3SYNC_LENGTH                               0x1
#define _T3CON_nT3SYNC_MASK                                 0x4
#define _T3CON_T3OSCEN_POSN                                 0x3
#define _T3CON_T3OSCEN_POSITION                             0x3
#define _T3CON_T3OSCEN_SIZE                                 0x1
#define _T3CON_T3OSCEN_LENGTH                               0x1
#define _T3CON_T3OSCEN_MASK                                 0x8
#define _T3CON_T3CS0_POSN                                   0x6
#define _T3CON_T3CS0_POSITION                               0x6
#define _T3CON_T3CS0_SIZE                                   0x1
#define _T3CON_T3CS0_LENGTH                                 0x1
#define _T3CON_T3CS0_MASK                                   0x40
#define _T3CON_T3CS1_POSN                                   0x7
#define _T3CON_T3CS1_POSITION                               0x7
#define _T3CON_T3CS1_SIZE                                   0x1
#define _T3CON_T3CS1_LENGTH                                 0x1
#define _T3CON_T3CS1_MASK                                   0x80
#define _T3CON_T3ON_POSN                                    0x0
#define _T3CON_T3ON_POSITION                                0x0
#define _T3CON_T3ON_SIZE                                    0x1
#define _T3CON_T3ON_LENGTH                                  0x1
#define _T3CON_T3ON_MASK                                    0x1
#define _T3CON_T3CKPS0_POSN                                 0x4
#define _T3CON_T3CKPS0_POSITION                             0x4
#define _T3CON_T3CKPS0_SIZE                                 0x1
#define _T3CON_T3CKPS0_LENGTH                               0x1
#define _T3CON_T3CKPS0_MASK                                 0x10
#define _T3CON_T3CKPS1_POSN                                 0x5
#define _T3CON_T3CKPS1_POSITION                             0x5
#define _T3CON_T3CKPS1_SIZE                                 0x1
#define _T3CON_T3CKPS1_LENGTH                               0x1
#define _T3CON_T3CKPS1_MASK                                 0x20
#define _T3CON_TMR3CS0_POSN                                 0x6
#define _T3CON_TMR3CS0_POSITION                             0x6
#define _T3CON_TMR3CS0_SIZE                                 0x1
#define _T3CON_TMR3CS0_LENGTH                               0x1
#define _T3CON_TMR3CS0_MASK                                 0x40
#define _T3CON_TMR3CS1_POSN                                 0x7
#define _T3CON_TMR3CS1_POSITION                             0x7
#define _T3CON_TMR3CS1_SIZE                                 0x1
#define _T3CON_TMR3CS1_LENGTH                               0x1
#define _T3CON_TMR3CS1_MASK                                 0x80

// Register: T3GCON
#define T3GCON T3GCON
extern volatile unsigned char           T3GCON              __at(0x01F);
#ifndef _LIB_BUILD
asm("T3GCON equ 01Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned GSS                    :2;
        unsigned GVAL                   :1;
        unsigned GGO_nDONE              :1;
        unsigned GSPM                   :1;
        unsigned GTM                    :1;
        unsigned GPOL                   :1;
        unsigned GE                     :1;
    };
    struct {
        unsigned GSS0                   :1;
        unsigned GSS1                   :1;
        unsigned                        :5;
        unsigned T3GE                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned T3GVAL                 :1;
        unsigned T3GGO_nDONE            :1;
        unsigned T3GSPM                 :1;
        unsigned T3GTM                  :1;
        unsigned T3GPOL                 :1;
        unsigned TMR3GE                 :1;
    };
    struct {
        unsigned T3GSS0                 :1;
        unsigned T3GSS1                 :1;
    };
} T3GCONbits_t;
extern volatile T3GCONbits_t T3GCONbits __at(0x01F);
// bitfield macros
#define _T3GCON_GSS_POSN                                    0x0
#define _T3GCON_GSS_POSITION                                0x0
#define _T3GCON_GSS_SIZE                                    0x2
#define _T3GCON_GSS_LENGTH                                  0x2
#define _T3GCON_GSS_MASK                                    0x3
#define _T3GCON_GVAL_POSN                                   0x2
#define _T3GCON_GVAL_POSITION                               0x2
#define _T3GCON_GVAL_SIZE                                   0x1
#define _T3GCON_GVAL_LENGTH                                 0x1
#define _T3GCON_GVAL_MASK                                   0x4
#define _T3GCON_GGO_nDONE_POSN                              0x3
#define _T3GCON_GGO_nDONE_POSITION                          0x3
#define _T3GCON_GGO_nDONE_SIZE                              0x1
#define _T3GCON_GGO_nDONE_LENGTH                            0x1
#define _T3GCON_GGO_nDONE_MASK                              0x8
#define _T3GCON_GSPM_POSN                                   0x4
#define _T3GCON_GSPM_POSITION                               0x4
#define _T3GCON_GSPM_SIZE                                   0x1
#define _T3GCON_GSPM_LENGTH                                 0x1
#define _T3GCON_GSPM_MASK                                   0x10
#define _T3GCON_GTM_POSN                                    0x5
#define _T3GCON_GTM_POSITION                                0x5
#define _T3GCON_GTM_SIZE                                    0x1
#define _T3GCON_GTM_LENGTH                                  0x1
#define _T3GCON_GTM_MASK                                    0x20
#define _T3GCON_GPOL_POSN                                   0x6
#define _T3GCON_GPOL_POSITION                               0x6
#define _T3GCON_GPOL_SIZE                                   0x1
#define _T3GCON_GPOL_LENGTH                                 0x1
#define _T3GCON_GPOL_MASK                                   0x40
#define _T3GCON_GE_POSN                                     0x7
#define _T3GCON_GE_POSITION                                 0x7
#define _T3GCON_GE_SIZE                                     0x1
#define _T3GCON_GE_LENGTH                                   0x1
#define _T3GCON_GE_MASK                                     0x80
#define _T3GCON_GSS0_POSN                                   0x0
#define _T3GCON_GSS0_POSITION                               0x0
#define _T3GCON_GSS0_SIZE                                   0x1
#define _T3GCON_GSS0_LENGTH                                 0x1
#define _T3GCON_GSS0_MASK                                   0x1
#define _T3GCON_GSS1_POSN                                   0x1
#define _T3GCON_GSS1_POSITION                               0x1
#define _T3GCON_GSS1_SIZE                                   0x1
#define _T3GCON_GSS1_LENGTH                                 0x1
#define _T3GCON_GSS1_MASK                                   0x2
#define _T3GCON_T3GE_POSN                                   0x7
#define _T3GCON_T3GE_POSITION                               0x7
#define _T3GCON_T3GE_SIZE                                   0x1
#define _T3GCON_T3GE_LENGTH                                 0x1
#define _T3GCON_T3GE_MASK                                   0x80
#define _T3GCON_T3GVAL_POSN                                 0x2
#define _T3GCON_T3GVAL_POSITION                             0x2
#define _T3GCON_T3GVAL_SIZE                                 0x1
#define _T3GCON_T3GVAL_LENGTH                               0x1
#define _T3GCON_T3GVAL_MASK                                 0x4
#define _T3GCON_T3GGO_nDONE_POSN                            0x3
#define _T3GCON_T3GGO_nDONE_POSITION                        0x3
#define _T3GCON_T3GGO_nDONE_SIZE                            0x1
#define _T3GCON_T3GGO_nDONE_LENGTH                          0x1
#define _T3GCON_T3GGO_nDONE_MASK                            0x8
#define _T3GCON_T3GSPM_POSN                                 0x4
#define _T3GCON_T3GSPM_POSITION                             0x4
#define _T3GCON_T3GSPM_SIZE                                 0x1
#define _T3GCON_T3GSPM_LENGTH                               0x1
#define _T3GCON_T3GSPM_MASK                                 0x10
#define _T3GCON_T3GTM_POSN                                  0x5
#define _T3GCON_T3GTM_POSITION                              0x5
#define _T3GCON_T3GTM_SIZE                                  0x1
#define _T3GCON_T3GTM_LENGTH                                0x1
#define _T3GCON_T3GTM_MASK                                  0x20
#define _T3GCON_T3GPOL_POSN                                 0x6
#define _T3GCON_T3GPOL_POSITION                             0x6
#define _T3GCON_T3GPOL_SIZE                                 0x1
#define _T3GCON_T3GPOL_LENGTH                               0x1
#define _T3GCON_T3GPOL_MASK                                 0x40
#define _T3GCON_TMR3GE_POSN                                 0x7
#define _T3GCON_TMR3GE_POSITION                             0x7
#define _T3GCON_TMR3GE_SIZE                                 0x1
#define _T3GCON_TMR3GE_LENGTH                               0x1
#define _T3GCON_TMR3GE_MASK                                 0x80
#define _T3GCON_T3GSS0_POSN                                 0x0
#define _T3GCON_T3GSS0_POSITION                             0x0
#define _T3GCON_T3GSS0_SIZE                                 0x1
#define _T3GCON_T3GSS0_LENGTH                               0x1
#define _T3GCON_T3GSS0_MASK                                 0x1
#define _T3GCON_T3GSS1_POSN                                 0x1
#define _T3GCON_T3GSS1_POSITION                             0x1
#define _T3GCON_T3GSS1_SIZE                                 0x1
#define _T3GCON_T3GSS1_LENGTH                               0x1
#define _T3GCON_T3GSS1_MASK                                 0x2

// Register: TRISA
#define TRISA TRISA
extern volatile unsigned char           TRISA               __at(0x08C);
#ifndef _LIB_BUILD
asm("TRISA equ 08Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISA0                 :1;
        unsigned TRISA1                 :1;
        unsigned TRISA2                 :1;
        unsigned TRISA3                 :1;
        unsigned TRISA4                 :1;
        unsigned TRISA5                 :1;
        unsigned TRISA6                 :1;
        unsigned TRISA7                 :1;
    };
} TRISAbits_t;
