MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1779/mcu.h
extern volatile CM3CON1bits_t CM3CON1bits __at(0x11B);
// bitfield macros
#define _CM3CON1_INTN_POSN                                  0x0
#define _CM3CON1_INTN_POSITION                              0x0
#define _CM3CON1_INTN_SIZE                                  0x1
#define _CM3CON1_INTN_LENGTH                                0x1
#define _CM3CON1_INTN_MASK                                  0x1
#define _CM3CON1_INTP_POSN                                  0x1
#define _CM3CON1_INTP_POSITION                              0x1
#define _CM3CON1_INTP_SIZE                                  0x1
#define _CM3CON1_INTP_LENGTH                                0x1
#define _CM3CON1_INTP_MASK                                  0x2
#define _CM3CON1_C3INTN_POSN                                0x0
#define _CM3CON1_C3INTN_POSITION                            0x0
#define _CM3CON1_C3INTN_SIZE                                0x1
#define _CM3CON1_C3INTN_LENGTH                              0x1
#define _CM3CON1_C3INTN_MASK                                0x1
#define _CM3CON1_C3INTP_POSN                                0x1
#define _CM3CON1_C3INTP_POSITION                            0x1
#define _CM3CON1_C3INTP_SIZE                                0x1
#define _CM3CON1_C3INTP_LENGTH                              0x1
#define _CM3CON1_C3INTP_MASK                                0x2

// Register: CM3NSEL
#define CM3NSEL CM3NSEL
extern volatile unsigned char           CM3NSEL             __at(0x11C);
#ifndef _LIB_BUILD
asm("CM3NSEL equ 011Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NCH                    :4;
    };
    struct {
        unsigned C3NCH                  :4;
    };
    struct {
        unsigned C3NCH0                 :1;
        unsigned C3NCH1                 :1;
        unsigned C3NCH2                 :1;
        unsigned C3NCH3                 :1;
    };
} CM3NSELbits_t;
extern volatile CM3NSELbits_t CM3NSELbits __at(0x11C);
// bitfield macros
#define _CM3NSEL_NCH_POSN                                   0x0
#define _CM3NSEL_NCH_POSITION                               0x0
#define _CM3NSEL_NCH_SIZE                                   0x4
#define _CM3NSEL_NCH_LENGTH                                 0x4
#define _CM3NSEL_NCH_MASK                                   0xF
#define _CM3NSEL_C3NCH_POSN                                 0x0
#define _CM3NSEL_C3NCH_POSITION                             0x0
#define _CM3NSEL_C3NCH_SIZE                                 0x4
#define _CM3NSEL_C3NCH_LENGTH                               0x4
#define _CM3NSEL_C3NCH_MASK                                 0xF
#define _CM3NSEL_C3NCH0_POSN                                0x0
#define _CM3NSEL_C3NCH0_POSITION                            0x0
#define _CM3NSEL_C3NCH0_SIZE                                0x1
#define _CM3NSEL_C3NCH0_LENGTH                              0x1
#define _CM3NSEL_C3NCH0_MASK                                0x1
#define _CM3NSEL_C3NCH1_POSN                                0x1
#define _CM3NSEL_C3NCH1_POSITION                            0x1
#define _CM3NSEL_C3NCH1_SIZE                                0x1
#define _CM3NSEL_C3NCH1_LENGTH                              0x1
#define _CM3NSEL_C3NCH1_MASK                                0x2
#define _CM3NSEL_C3NCH2_POSN                                0x2
#define _CM3NSEL_C3NCH2_POSITION                            0x2
#define _CM3NSEL_C3NCH2_SIZE                                0x1
#define _CM3NSEL_C3NCH2_LENGTH                              0x1
#define _CM3NSEL_C3NCH2_MASK                                0x4
#define _CM3NSEL_C3NCH3_POSN                                0x3
#define _CM3NSEL_C3NCH3_POSITION                            0x3
#define _CM3NSEL_C3NCH3_SIZE                                0x1
#define _CM3NSEL_C3NCH3_LENGTH                              0x1
#define _CM3NSEL_C3NCH3_MASK                                0x8

// Register: CM3PSEL
#define CM3PSEL CM3PSEL
extern volatile unsigned char           CM3PSEL             __at(0x11D);
#ifndef _LIB_BUILD
asm("CM3PSEL equ 011Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCH                    :4;
    };
    struct {
        unsigned PCH0                   :1;
        unsigned PCH1                   :1;
        unsigned PCH2                   :1;
        unsigned PCH3                   :1;
    };
    struct {
        unsigned C3PCH                  :4;
    };
    struct {
        unsigned C3PCH0                 :1;
        unsigned C3PCH1                 :1;
        unsigned C3PCH2                 :1;
        unsigned C3PCH3                 :1;
    };
} CM3PSELbits_t;
extern volatile CM3PSELbits_t CM3PSELbits __at(0x11D);
// bitfield macros
#define _CM3PSEL_PCH_POSN                                   0x0
#define _CM3PSEL_PCH_POSITION                               0x0
#define _CM3PSEL_PCH_SIZE                                   0x4
#define _CM3PSEL_PCH_LENGTH                                 0x4
#define _CM3PSEL_PCH_MASK                                   0xF
#define _CM3PSEL_PCH0_POSN                                  0x0
#define _CM3PSEL_PCH0_POSITION                              0x0
#define _CM3PSEL_PCH0_SIZE                                  0x1
#define _CM3PSEL_PCH0_LENGTH                                0x1
#define _CM3PSEL_PCH0_MASK                                  0x1
#define _CM3PSEL_PCH1_POSN                                  0x1
#define _CM3PSEL_PCH1_POSITION                              0x1
#define _CM3PSEL_PCH1_SIZE                                  0x1
#define _CM3PSEL_PCH1_LENGTH                                0x1
#define _CM3PSEL_PCH1_MASK                                  0x2
#define _CM3PSEL_PCH2_POSN                                  0x2
#define _CM3PSEL_PCH2_POSITION                              0x2
#define _CM3PSEL_PCH2_SIZE                                  0x1
#define _CM3PSEL_PCH2_LENGTH                                0x1
#define _CM3PSEL_PCH2_MASK                                  0x4
#define _CM3PSEL_PCH3_POSN                                  0x3
#define _CM3PSEL_PCH3_POSITION                              0x3
#define _CM3PSEL_PCH3_SIZE                                  0x1
#define _CM3PSEL_PCH3_LENGTH                                0x1
#define _CM3PSEL_PCH3_MASK                                  0x8
#define _CM3PSEL_C3PCH_POSN                                 0x0
#define _CM3PSEL_C3PCH_POSITION                             0x0
#define _CM3PSEL_C3PCH_SIZE                                 0x4
#define _CM3PSEL_C3PCH_LENGTH                               0x4
#define _CM3PSEL_C3PCH_MASK                                 0xF
#define _CM3PSEL_C3PCH0_POSN                                0x0
#define _CM3PSEL_C3PCH0_POSITION                            0x0
#define _CM3PSEL_C3PCH0_SIZE                                0x1
#define _CM3PSEL_C3PCH0_LENGTH                              0x1
#define _CM3PSEL_C3PCH0_MASK                                0x1
#define _CM3PSEL_C3PCH1_POSN                                0x1
#define _CM3PSEL_C3PCH1_POSITION                            0x1
#define _CM3PSEL_C3PCH1_SIZE                                0x1
#define _CM3PSEL_C3PCH1_LENGTH                              0x1
#define _CM3PSEL_C3PCH1_MASK                                0x2
#define _CM3PSEL_C3PCH2_POSN                                0x2
#define _CM3PSEL_C3PCH2_POSITION                            0x2
#define _CM3PSEL_C3PCH2_SIZE                                0x1
#define _CM3PSEL_C3PCH2_LENGTH                              0x1
#define _CM3PSEL_C3PCH2_MASK                                0x4
#define _CM3PSEL_C3PCH3_POSN                                0x3
#define _CM3PSEL_C3PCH3_POSITION                            0x3
#define _CM3PSEL_C3PCH3_SIZE                                0x1
#define _CM3PSEL_C3PCH3_LENGTH                              0x1
#define _CM3PSEL_C3PCH3_MASK                                0x8

// Register: ANSELA
#define ANSELA ANSELA
extern volatile unsigned char           ANSELA              __at(0x18C);
#ifndef _LIB_BUILD
asm("ANSELA equ 018Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSA0                  :1;
        unsigned ANSA1                  :1;
        unsigned ANSA2                  :1;
        unsigned ANSA3                  :1;
        unsigned ANSA4                  :1;
        unsigned ANSA5                  :1;
    };
} ANSELAbits_t;
extern volatile ANSELAbits_t ANSELAbits __at(0x18C);
// bitfield macros
#define _ANSELA_ANSA0_POSN                                  0x0
#define _ANSELA_ANSA0_POSITION                              0x0
#define _ANSELA_ANSA0_SIZE                                  0x1
#define _ANSELA_ANSA0_LENGTH                                0x1
#define _ANSELA_ANSA0_MASK                                  0x1
#define _ANSELA_ANSA1_POSN                                  0x1
#define _ANSELA_ANSA1_POSITION                              0x1
#define _ANSELA_ANSA1_SIZE                                  0x1
#define _ANSELA_ANSA1_LENGTH                                0x1
#define _ANSELA_ANSA1_MASK                                  0x2
#define _ANSELA_ANSA2_POSN                                  0x2
#define _ANSELA_ANSA2_POSITION                              0x2
#define _ANSELA_ANSA2_SIZE                                  0x1
#define _ANSELA_ANSA2_LENGTH                                0x1
#define _ANSELA_ANSA2_MASK                                  0x4
#define _ANSELA_ANSA3_POSN                                  0x3
#define _ANSELA_ANSA3_POSITION                              0x3
#define _ANSELA_ANSA3_SIZE                                  0x1
#define _ANSELA_ANSA3_LENGTH                                0x1
#define _ANSELA_ANSA3_MASK                                  0x8
#define _ANSELA_ANSA4_POSN                                  0x4
#define _ANSELA_ANSA4_POSITION                              0x4
#define _ANSELA_ANSA4_SIZE                                  0x1
#define _ANSELA_ANSA4_LENGTH                                0x1
#define _ANSELA_ANSA4_MASK                                  0x10
#define _ANSELA_ANSA5_POSN                                  0x5
#define _ANSELA_ANSA5_POSITION                              0x5
#define _ANSELA_ANSA5_SIZE                                  0x1
#define _ANSELA_ANSA5_LENGTH                                0x1
#define _ANSELA_ANSA5_MASK                                  0x20

// Register: ANSELB
#define ANSELB ANSELB
extern volatile unsigned char           ANSELB              __at(0x18D);
#ifndef _LIB_BUILD
asm("ANSELB equ 018Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSB0                  :1;
        unsigned ANSB1                  :1;
        unsigned ANSB2                  :1;
        unsigned ANSB3                  :1;
        unsigned ANSB4                  :1;
        unsigned ANSB5                  :1;
    };
} ANSELBbits_t;
extern volatile ANSELBbits_t ANSELBbits __at(0x18D);
// bitfield macros
#define _ANSELB_ANSB0_POSN                                  0x0
#define _ANSELB_ANSB0_POSITION                              0x0
#define _ANSELB_ANSB0_SIZE                                  0x1
#define _ANSELB_ANSB0_LENGTH                                0x1
#define _ANSELB_ANSB0_MASK                                  0x1
#define _ANSELB_ANSB1_POSN                                  0x1
#define _ANSELB_ANSB1_POSITION                              0x1
#define _ANSELB_ANSB1_SIZE                                  0x1
#define _ANSELB_ANSB1_LENGTH                                0x1
#define _ANSELB_ANSB1_MASK                                  0x2
#define _ANSELB_ANSB2_POSN                                  0x2
#define _ANSELB_ANSB2_POSITION                              0x2
#define _ANSELB_ANSB2_SIZE                                  0x1
#define _ANSELB_ANSB2_LENGTH                                0x1
#define _ANSELB_ANSB2_MASK                                  0x4
#define _ANSELB_ANSB3_POSN                                  0x3
#define _ANSELB_ANSB3_POSITION                              0x3
#define _ANSELB_ANSB3_SIZE                                  0x1
#define _ANSELB_ANSB3_LENGTH                                0x1
#define _ANSELB_ANSB3_MASK                                  0x8
#define _ANSELB_ANSB4_POSN                                  0x4
#define _ANSELB_ANSB4_POSITION                              0x4
#define _ANSELB_ANSB4_SIZE                                  0x1
#define _ANSELB_ANSB4_LENGTH                                0x1
#define _ANSELB_ANSB4_MASK                                  0x10
#define _ANSELB_ANSB5_POSN                                  0x5
#define _ANSELB_ANSB5_POSITION                              0x5
#define _ANSELB_ANSB5_SIZE                                  0x1
#define _ANSELB_ANSB5_LENGTH                                0x1
#define _ANSELB_ANSB5_MASK                                  0x20

// Register: ANSELC
#define ANSELC ANSELC
extern volatile unsigned char           ANSELC              __at(0x18E);
#ifndef _LIB_BUILD
asm("ANSELC equ 018Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned ANSC2                  :1;
        unsigned ANSC3                  :1;
        unsigned ANSC4                  :1;
        unsigned ANSC5                  :1;
        unsigned ANSC6                  :1;
        unsigned ANSC7                  :1;
    };
} ANSELCbits_t;
