MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1779/mcu.h
extern volatile MD3CON0bits_t MD3CON0bits __at(0x21B);
// bitfield macros
#define _MD3CON0_BIT_POSN                                   0x0
#define _MD3CON0_BIT_POSITION                               0x0
#define _MD3CON0_BIT_SIZE                                   0x1
#define _MD3CON0_BIT_LENGTH                                 0x1
#define _MD3CON0_BIT_MASK                                   0x1
#define _MD3CON0_OPOL_POSN                                  0x4
#define _MD3CON0_OPOL_POSITION                              0x4
#define _MD3CON0_OPOL_SIZE                                  0x1
#define _MD3CON0_OPOL_LENGTH                                0x1
#define _MD3CON0_OPOL_MASK                                  0x10
#define _MD3CON0_OUT_POSN                                   0x5
#define _MD3CON0_OUT_POSITION                               0x5
#define _MD3CON0_OUT_SIZE                                   0x1
#define _MD3CON0_OUT_LENGTH                                 0x1
#define _MD3CON0_OUT_MASK                                   0x20
#define _MD3CON0_EN_POSN                                    0x7
#define _MD3CON0_EN_POSITION                                0x7
#define _MD3CON0_EN_SIZE                                    0x1
#define _MD3CON0_EN_LENGTH                                  0x1
#define _MD3CON0_EN_MASK                                    0x80
#define _MD3CON0_MD3BIT_POSN                                0x0
#define _MD3CON0_MD3BIT_POSITION                            0x0
#define _MD3CON0_MD3BIT_SIZE                                0x1
#define _MD3CON0_MD3BIT_LENGTH                              0x1
#define _MD3CON0_MD3BIT_MASK                                0x1
#define _MD3CON0_MD3OPOL_POSN                               0x4
#define _MD3CON0_MD3OPOL_POSITION                           0x4
#define _MD3CON0_MD3OPOL_SIZE                               0x1
#define _MD3CON0_MD3OPOL_LENGTH                             0x1
#define _MD3CON0_MD3OPOL_MASK                               0x10
#define _MD3CON0_MD3OUT_POSN                                0x5
#define _MD3CON0_MD3OUT_POSITION                            0x5
#define _MD3CON0_MD3OUT_SIZE                                0x1
#define _MD3CON0_MD3OUT_LENGTH                              0x1
#define _MD3CON0_MD3OUT_MASK                                0x20
#define _MD3CON0_MD3EN_POSN                                 0x7
#define _MD3CON0_MD3EN_POSITION                             0x7
#define _MD3CON0_MD3EN_SIZE                                 0x1
#define _MD3CON0_MD3EN_LENGTH                               0x1
#define _MD3CON0_MD3EN_MASK                                 0x80

// Register: MD3CON1
#define MD3CON1 MD3CON1
extern volatile unsigned char           MD3CON1             __at(0x21C);
#ifndef _LIB_BUILD
asm("MD3CON1 equ 021Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLSYNC                 :1;
        unsigned CLPOL                  :1;
        unsigned                        :2;
        unsigned CHSYNC                 :1;
        unsigned CHPOL                  :1;
    };
    struct {
        unsigned MD3CLSYNC              :1;
        unsigned MD3CLPOL               :1;
        unsigned                        :2;
        unsigned MD3CHSYNC              :1;
        unsigned MD3CHPOL               :1;
    };
} MD3CON1bits_t;
extern volatile MD3CON1bits_t MD3CON1bits __at(0x21C);
// bitfield macros
#define _MD3CON1_CLSYNC_POSN                                0x0
#define _MD3CON1_CLSYNC_POSITION                            0x0
#define _MD3CON1_CLSYNC_SIZE                                0x1
#define _MD3CON1_CLSYNC_LENGTH                              0x1
#define _MD3CON1_CLSYNC_MASK                                0x1
#define _MD3CON1_CLPOL_POSN                                 0x1
#define _MD3CON1_CLPOL_POSITION                             0x1
#define _MD3CON1_CLPOL_SIZE                                 0x1
#define _MD3CON1_CLPOL_LENGTH                               0x1
#define _MD3CON1_CLPOL_MASK                                 0x2
#define _MD3CON1_CHSYNC_POSN                                0x4
#define _MD3CON1_CHSYNC_POSITION                            0x4
#define _MD3CON1_CHSYNC_SIZE                                0x1
#define _MD3CON1_CHSYNC_LENGTH                              0x1
#define _MD3CON1_CHSYNC_MASK                                0x10
#define _MD3CON1_CHPOL_POSN                                 0x5
#define _MD3CON1_CHPOL_POSITION                             0x5
#define _MD3CON1_CHPOL_SIZE                                 0x1
#define _MD3CON1_CHPOL_LENGTH                               0x1
#define _MD3CON1_CHPOL_MASK                                 0x20
#define _MD3CON1_MD3CLSYNC_POSN                             0x0
#define _MD3CON1_MD3CLSYNC_POSITION                         0x0
#define _MD3CON1_MD3CLSYNC_SIZE                             0x1
#define _MD3CON1_MD3CLSYNC_LENGTH                           0x1
#define _MD3CON1_MD3CLSYNC_MASK                             0x1
#define _MD3CON1_MD3CLPOL_POSN                              0x1
#define _MD3CON1_MD3CLPOL_POSITION                          0x1
#define _MD3CON1_MD3CLPOL_SIZE                              0x1
#define _MD3CON1_MD3CLPOL_LENGTH                            0x1
#define _MD3CON1_MD3CLPOL_MASK                              0x2
#define _MD3CON1_MD3CHSYNC_POSN                             0x4
#define _MD3CON1_MD3CHSYNC_POSITION                         0x4
#define _MD3CON1_MD3CHSYNC_SIZE                             0x1
#define _MD3CON1_MD3CHSYNC_LENGTH                           0x1
#define _MD3CON1_MD3CHSYNC_MASK                             0x10
#define _MD3CON1_MD3CHPOL_POSN                              0x5
#define _MD3CON1_MD3CHPOL_POSITION                          0x5
#define _MD3CON1_MD3CHPOL_SIZE                              0x1
#define _MD3CON1_MD3CHPOL_LENGTH                            0x1
#define _MD3CON1_MD3CHPOL_MASK                              0x20

// Register: MD3SRC
#define MD3SRC MD3SRC
extern volatile unsigned char           MD3SRC              __at(0x21D);
#ifndef _LIB_BUILD
asm("MD3SRC equ 021Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MS                     :5;
    };
    struct {
        unsigned MS0                    :1;
        unsigned MS1                    :1;
        unsigned MS2                    :1;
        unsigned MS3                    :1;
        unsigned MS4                    :1;
    };
    struct {
        unsigned MD3MS                  :5;
    };
    struct {
        unsigned MD3MS0                 :1;
        unsigned MD3MS1                 :1;
        unsigned MD3MS2                 :1;
        unsigned MD3MS3                 :1;
        unsigned MD3MS4                 :1;
    };
} MD3SRCbits_t;
