MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1779/mcu.h
// Register: CCP2CAP
#define CCP2CAP CCP2CAP
extern volatile unsigned char           CCP2CAP             __at(0x298);
#ifndef _LIB_BUILD
asm("CCP2CAP equ 0298h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CTS                    :8;
    };
    struct {
        unsigned CTS0                   :1;
        unsigned CTS1                   :1;
        unsigned CTS2                   :1;
        unsigned CTS3                   :1;
    };
    struct {
        unsigned CCP2CTS                :8;
    };
    struct {
        unsigned CCP2CTS0               :1;
        unsigned CCP2CTS1               :1;
        unsigned CCP2CTS2               :1;
        unsigned CCP2CTS3               :1;
    };
} CCP2CAPbits_t;
extern volatile CCP2CAPbits_t CCP2CAPbits __at(0x298);
// bitfield macros
#define _CCP2CAP_CTS_POSN                                   0x0
#define _CCP2CAP_CTS_POSITION                               0x0
#define _CCP2CAP_CTS_SIZE                                   0x8
#define _CCP2CAP_CTS_LENGTH                                 0x8
#define _CCP2CAP_CTS_MASK                                   0xFF
#define _CCP2CAP_CTS0_POSN                                  0x0
#define _CCP2CAP_CTS0_POSITION                              0x0
#define _CCP2CAP_CTS0_SIZE                                  0x1
#define _CCP2CAP_CTS0_LENGTH                                0x1
#define _CCP2CAP_CTS0_MASK                                  0x1
#define _CCP2CAP_CTS1_POSN                                  0x1
#define _CCP2CAP_CTS1_POSITION                              0x1
#define _CCP2CAP_CTS1_SIZE                                  0x1
#define _CCP2CAP_CTS1_LENGTH                                0x1
#define _CCP2CAP_CTS1_MASK                                  0x2
#define _CCP2CAP_CTS2_POSN                                  0x2
#define _CCP2CAP_CTS2_POSITION                              0x2
#define _CCP2CAP_CTS2_SIZE                                  0x1
#define _CCP2CAP_CTS2_LENGTH                                0x1
#define _CCP2CAP_CTS2_MASK                                  0x4
#define _CCP2CAP_CTS3_POSN                                  0x3
#define _CCP2CAP_CTS3_POSITION                              0x3
#define _CCP2CAP_CTS3_SIZE                                  0x1
#define _CCP2CAP_CTS3_LENGTH                                0x1
#define _CCP2CAP_CTS3_MASK                                  0x8
#define _CCP2CAP_CCP2CTS_POSN                               0x0
#define _CCP2CAP_CCP2CTS_POSITION                           0x0
#define _CCP2CAP_CCP2CTS_SIZE                               0x8
#define _CCP2CAP_CCP2CTS_LENGTH                             0x8
#define _CCP2CAP_CCP2CTS_MASK                               0xFF
#define _CCP2CAP_CCP2CTS0_POSN                              0x0
#define _CCP2CAP_CCP2CTS0_POSITION                          0x0
#define _CCP2CAP_CCP2CTS0_SIZE                              0x1
#define _CCP2CAP_CCP2CTS0_LENGTH                            0x1
#define _CCP2CAP_CCP2CTS0_MASK                              0x1
#define _CCP2CAP_CCP2CTS1_POSN                              0x1
#define _CCP2CAP_CCP2CTS1_POSITION                          0x1
#define _CCP2CAP_CCP2CTS1_SIZE                              0x1
#define _CCP2CAP_CCP2CTS1_LENGTH                            0x1
#define _CCP2CAP_CCP2CTS1_MASK                              0x2
#define _CCP2CAP_CCP2CTS2_POSN                              0x2
#define _CCP2CAP_CCP2CTS2_POSITION                          0x2
#define _CCP2CAP_CCP2CTS2_SIZE                              0x1
#define _CCP2CAP_CCP2CTS2_LENGTH                            0x1
#define _CCP2CAP_CCP2CTS2_MASK                              0x4
#define _CCP2CAP_CCP2CTS3_POSN                              0x3
#define _CCP2CAP_CCP2CTS3_POSITION                          0x3
#define _CCP2CAP_CCP2CTS3_SIZE                              0x1
#define _CCP2CAP_CCP2CTS3_LENGTH                            0x1
#define _CCP2CAP_CCP2CTS3_MASK                              0x8

// Register: CCPR7
#define CCPR7 CCPR7
extern volatile unsigned short          CCPR7               __at(0x299);
#ifndef _LIB_BUILD
asm("CCPR7 equ 0299h");
#endif

// Register: CCPR7L
#define CCPR7L CCPR7L
extern volatile unsigned char           CCPR7L              __at(0x299);
#ifndef _LIB_BUILD
asm("CCPR7L equ 0299h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RL                     :8;
    };
} CCPR7Lbits_t;
extern volatile CCPR7Lbits_t CCPR7Lbits __at(0x299);
// bitfield macros
#define _CCPR7L_RL_POSN                                     0x0
#define _CCPR7L_RL_POSITION                                 0x0
#define _CCPR7L_RL_SIZE                                     0x8
#define _CCPR7L_RL_LENGTH                                   0x8
#define _CCPR7L_RL_MASK                                     0xFF

// Register: CCPR7H
#define CCPR7H CCPR7H
extern volatile unsigned char           CCPR7H              __at(0x29A);
#ifndef _LIB_BUILD
asm("CCPR7H equ 029Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RH                     :8;
    };
} CCPR7Hbits_t;
extern volatile CCPR7Hbits_t CCPR7Hbits __at(0x29A);
// bitfield macros
#define _CCPR7H_RH_POSN                                     0x0
#define _CCPR7H_RH_POSITION                                 0x0
#define _CCPR7H_RH_SIZE                                     0x8
#define _CCPR7H_RH_LENGTH                                   0x8
#define _CCPR7H_RH_MASK                                     0xFF

// Register: CCP7CON
#define CCP7CON CCP7CON
extern volatile unsigned char           CCP7CON             __at(0x29B);
#ifndef _LIB_BUILD
asm("CCP7CON equ 029Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :4;
        unsigned FMT                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
        unsigned MODE3                  :1;
    };
    struct {
        unsigned CCP7MODE               :4;
        unsigned CCP7FMT                :1;
        unsigned CCP7OUT                :1;
        unsigned                        :1;
        unsigned CCP7EN                 :1;
    };
    struct {
        unsigned CCP7MODE0              :1;
        unsigned CCP7MODE1              :1;
        unsigned CCP7MODE2              :1;
        unsigned CCP7MODE3              :1;
    };
} CCP7CONbits_t;
extern volatile CCP7CONbits_t CCP7CONbits __at(0x29B);
// bitfield macros
#define _CCP7CON_MODE_POSN                                  0x0
#define _CCP7CON_MODE_POSITION                              0x0
#define _CCP7CON_MODE_SIZE                                  0x4
#define _CCP7CON_MODE_LENGTH                                0x4
#define _CCP7CON_MODE_MASK                                  0xF
#define _CCP7CON_FMT_POSN                                   0x4
#define _CCP7CON_FMT_POSITION                               0x4
#define _CCP7CON_FMT_SIZE                                   0x1
#define _CCP7CON_FMT_LENGTH                                 0x1
#define _CCP7CON_FMT_MASK                                   0x10
#define _CCP7CON_OUT_POSN                                   0x5
#define _CCP7CON_OUT_POSITION                               0x5
#define _CCP7CON_OUT_SIZE                                   0x1
#define _CCP7CON_OUT_LENGTH                                 0x1
#define _CCP7CON_OUT_MASK                                   0x20
#define _CCP7CON_EN_POSN                                    0x7
#define _CCP7CON_EN_POSITION                                0x7
#define _CCP7CON_EN_SIZE                                    0x1
#define _CCP7CON_EN_LENGTH                                  0x1
#define _CCP7CON_EN_MASK                                    0x80
#define _CCP7CON_MODE0_POSN                                 0x0
#define _CCP7CON_MODE0_POSITION                             0x0
#define _CCP7CON_MODE0_SIZE                                 0x1
#define _CCP7CON_MODE0_LENGTH                               0x1
#define _CCP7CON_MODE0_MASK                                 0x1
#define _CCP7CON_MODE1_POSN                                 0x1
#define _CCP7CON_MODE1_POSITION                             0x1
#define _CCP7CON_MODE1_SIZE                                 0x1
#define _CCP7CON_MODE1_LENGTH                               0x1
#define _CCP7CON_MODE1_MASK                                 0x2
#define _CCP7CON_MODE2_POSN                                 0x2
#define _CCP7CON_MODE2_POSITION                             0x2
#define _CCP7CON_MODE2_SIZE                                 0x1
#define _CCP7CON_MODE2_LENGTH                               0x1
#define _CCP7CON_MODE2_MASK                                 0x4
#define _CCP7CON_MODE3_POSN                                 0x3
#define _CCP7CON_MODE3_POSITION                             0x3
#define _CCP7CON_MODE3_SIZE                                 0x1
#define _CCP7CON_MODE3_LENGTH                               0x1
#define _CCP7CON_MODE3_MASK                                 0x8
#define _CCP7CON_CCP7MODE_POSN                              0x0
#define _CCP7CON_CCP7MODE_POSITION                          0x0
#define _CCP7CON_CCP7MODE_SIZE                              0x4
#define _CCP7CON_CCP7MODE_LENGTH                            0x4
#define _CCP7CON_CCP7MODE_MASK                              0xF
#define _CCP7CON_CCP7FMT_POSN                               0x4
#define _CCP7CON_CCP7FMT_POSITION                           0x4
#define _CCP7CON_CCP7FMT_SIZE                               0x1
#define _CCP7CON_CCP7FMT_LENGTH                             0x1
#define _CCP7CON_CCP7FMT_MASK                               0x10
#define _CCP7CON_CCP7OUT_POSN                               0x5
#define _CCP7CON_CCP7OUT_POSITION                           0x5
#define _CCP7CON_CCP7OUT_SIZE                               0x1
#define _CCP7CON_CCP7OUT_LENGTH                             0x1
#define _CCP7CON_CCP7OUT_MASK                               0x20
#define _CCP7CON_CCP7EN_POSN                                0x7
#define _CCP7CON_CCP7EN_POSITION                            0x7
#define _CCP7CON_CCP7EN_SIZE                                0x1
#define _CCP7CON_CCP7EN_LENGTH                              0x1
#define _CCP7CON_CCP7EN_MASK                                0x80
#define _CCP7CON_CCP7MODE0_POSN                             0x0
#define _CCP7CON_CCP7MODE0_POSITION                         0x0
#define _CCP7CON_CCP7MODE0_SIZE                             0x1
#define _CCP7CON_CCP7MODE0_LENGTH                           0x1
#define _CCP7CON_CCP7MODE0_MASK                             0x1
#define _CCP7CON_CCP7MODE1_POSN                             0x1
#define _CCP7CON_CCP7MODE1_POSITION                         0x1
#define _CCP7CON_CCP7MODE1_SIZE                             0x1
#define _CCP7CON_CCP7MODE1_LENGTH                           0x1
#define _CCP7CON_CCP7MODE1_MASK                             0x2
#define _CCP7CON_CCP7MODE2_POSN                             0x2
#define _CCP7CON_CCP7MODE2_POSITION                         0x2
#define _CCP7CON_CCP7MODE2_SIZE                             0x1
#define _CCP7CON_CCP7MODE2_LENGTH                           0x1
#define _CCP7CON_CCP7MODE2_MASK                             0x4
#define _CCP7CON_CCP7MODE3_POSN                             0x3
#define _CCP7CON_CCP7MODE3_POSITION                         0x3
#define _CCP7CON_CCP7MODE3_SIZE                             0x1
#define _CCP7CON_CCP7MODE3_LENGTH                           0x1
#define _CCP7CON_CCP7MODE3_MASK                             0x8

// Register: CCP7CAP
#define CCP7CAP CCP7CAP
extern volatile unsigned char           CCP7CAP             __at(0x29C);
#ifndef _LIB_BUILD
asm("CCP7CAP equ 029Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CTS                    :8;
    };
    struct {
        unsigned CTS0                   :1;
        unsigned CTS1                   :1;
        unsigned CTS2                   :1;
        unsigned CTS3                   :1;
    };
    struct {
        unsigned CCP7CTS                :8;
    };
    struct {
        unsigned CCP7CTS0               :1;
        unsigned CCP7CTS1               :1;
        unsigned CCP7CTS2               :1;
        unsigned CCP7CTS3               :1;
    };
} CCP7CAPbits_t;
extern volatile CCP7CAPbits_t CCP7CAPbits __at(0x29C);
// bitfield macros
#define _CCP7CAP_CTS_POSN                                   0x0
#define _CCP7CAP_CTS_POSITION                               0x0
#define _CCP7CAP_CTS_SIZE                                   0x8
#define _CCP7CAP_CTS_LENGTH                                 0x8
#define _CCP7CAP_CTS_MASK                                   0xFF
#define _CCP7CAP_CTS0_POSN                                  0x0
#define _CCP7CAP_CTS0_POSITION                              0x0
#define _CCP7CAP_CTS0_SIZE                                  0x1
#define _CCP7CAP_CTS0_LENGTH                                0x1
#define _CCP7CAP_CTS0_MASK                                  0x1
#define _CCP7CAP_CTS1_POSN                                  0x1
#define _CCP7CAP_CTS1_POSITION                              0x1
#define _CCP7CAP_CTS1_SIZE                                  0x1
#define _CCP7CAP_CTS1_LENGTH                                0x1
#define _CCP7CAP_CTS1_MASK                                  0x2
#define _CCP7CAP_CTS2_POSN                                  0x2
#define _CCP7CAP_CTS2_POSITION                              0x2
#define _CCP7CAP_CTS2_SIZE                                  0x1
#define _CCP7CAP_CTS2_LENGTH                                0x1
#define _CCP7CAP_CTS2_MASK                                  0x4
#define _CCP7CAP_CTS3_POSN                                  0x3
#define _CCP7CAP_CTS3_POSITION                              0x3
#define _CCP7CAP_CTS3_SIZE                                  0x1
#define _CCP7CAP_CTS3_LENGTH                                0x1
#define _CCP7CAP_CTS3_MASK                                  0x8
#define _CCP7CAP_CCP7CTS_POSN                               0x0
#define _CCP7CAP_CCP7CTS_POSITION                           0x0
#define _CCP7CAP_CCP7CTS_SIZE                               0x8
#define _CCP7CAP_CCP7CTS_LENGTH                             0x8
#define _CCP7CAP_CCP7CTS_MASK                               0xFF
#define _CCP7CAP_CCP7CTS0_POSN                              0x0
#define _CCP7CAP_CCP7CTS0_POSITION                          0x0
#define _CCP7CAP_CCP7CTS0_SIZE                              0x1
#define _CCP7CAP_CCP7CTS0_LENGTH                            0x1
#define _CCP7CAP_CCP7CTS0_MASK                              0x1
#define _CCP7CAP_CCP7CTS1_POSN                              0x1
#define _CCP7CAP_CCP7CTS1_POSITION                          0x1
#define _CCP7CAP_CCP7CTS1_SIZE                              0x1
#define _CCP7CAP_CCP7CTS1_LENGTH                            0x1
#define _CCP7CAP_CCP7CTS1_MASK                              0x2
#define _CCP7CAP_CCP7CTS2_POSN                              0x2
#define _CCP7CAP_CCP7CTS2_POSITION                          0x2
#define _CCP7CAP_CCP7CTS2_SIZE                              0x1
#define _CCP7CAP_CCP7CTS2_LENGTH                            0x1
#define _CCP7CAP_CCP7CTS2_MASK                              0x4
#define _CCP7CAP_CCP7CTS3_POSN                              0x3
#define _CCP7CAP_CCP7CTS3_POSITION                          0x3
#define _CCP7CAP_CCP7CTS3_SIZE                              0x1
#define _CCP7CAP_CCP7CTS3_LENGTH                            0x1
#define _CCP7CAP_CCP7CTS3_MASK                              0x8

// Register: CCPTMRS1
#define CCPTMRS1 CCPTMRS1
extern volatile unsigned char           CCPTMRS1            __at(0x29E);
#ifndef _LIB_BUILD
asm("CCPTMRS1 equ 029Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C1TSEL                 :2;
        unsigned C2TSEL                 :2;
        unsigned C7TSEL                 :2;
        unsigned C8TSEL                 :2;
    };
    struct {
        unsigned C1TSEL0                :1;
        unsigned C1TSEL1                :1;
        unsigned C2TSEL0                :1;
        unsigned C2TSEL1                :1;
        unsigned C7TSEL0                :1;
        unsigned C7TSEL1                :1;
    };
} CCPTMRS1bits_t;
extern volatile CCPTMRS1bits_t CCPTMRS1bits __at(0x29E);
// bitfield macros
#define _CCPTMRS1_C1TSEL_POSN                               0x0
#define _CCPTMRS1_C1TSEL_POSITION                           0x0
#define _CCPTMRS1_C1TSEL_SIZE                               0x2
#define _CCPTMRS1_C1TSEL_LENGTH                             0x2
#define _CCPTMRS1_C1TSEL_MASK                               0x3
#define _CCPTMRS1_C2TSEL_POSN                               0x2
#define _CCPTMRS1_C2TSEL_POSITION                           0x2
#define _CCPTMRS1_C2TSEL_SIZE                               0x2
#define _CCPTMRS1_C2TSEL_LENGTH                             0x2
#define _CCPTMRS1_C2TSEL_MASK                               0xC
#define _CCPTMRS1_C7TSEL_POSN                               0x4
#define _CCPTMRS1_C7TSEL_POSITION                           0x4
#define _CCPTMRS1_C7TSEL_SIZE                               0x2
#define _CCPTMRS1_C7TSEL_LENGTH                             0x2
#define _CCPTMRS1_C7TSEL_MASK                               0x30
#define _CCPTMRS1_C8TSEL_POSN                               0x6
#define _CCPTMRS1_C8TSEL_POSITION                           0x6
#define _CCPTMRS1_C8TSEL_SIZE                               0x2
#define _CCPTMRS1_C8TSEL_LENGTH                             0x2
#define _CCPTMRS1_C8TSEL_MASK                               0xC0
#define _CCPTMRS1_C1TSEL0_POSN                              0x0
#define _CCPTMRS1_C1TSEL0_POSITION                          0x0
#define _CCPTMRS1_C1TSEL0_SIZE                              0x1
#define _CCPTMRS1_C1TSEL0_LENGTH                            0x1
#define _CCPTMRS1_C1TSEL0_MASK                              0x1
#define _CCPTMRS1_C1TSEL1_POSN                              0x1
#define _CCPTMRS1_C1TSEL1_POSITION                          0x1
#define _CCPTMRS1_C1TSEL1_SIZE                              0x1
#define _CCPTMRS1_C1TSEL1_LENGTH                            0x1
#define _CCPTMRS1_C1TSEL1_MASK                              0x2
#define _CCPTMRS1_C2TSEL0_POSN                              0x2
#define _CCPTMRS1_C2TSEL0_POSITION                          0x2
#define _CCPTMRS1_C2TSEL0_SIZE                              0x1
#define _CCPTMRS1_C2TSEL0_LENGTH                            0x1
#define _CCPTMRS1_C2TSEL0_MASK                              0x4
#define _CCPTMRS1_C2TSEL1_POSN                              0x3
#define _CCPTMRS1_C2TSEL1_POSITION                          0x3
#define _CCPTMRS1_C2TSEL1_SIZE                              0x1
#define _CCPTMRS1_C2TSEL1_LENGTH                            0x1
#define _CCPTMRS1_C2TSEL1_MASK                              0x8
#define _CCPTMRS1_C7TSEL0_POSN                              0x4
#define _CCPTMRS1_C7TSEL0_POSITION                          0x4
#define _CCPTMRS1_C7TSEL0_SIZE                              0x1
#define _CCPTMRS1_C7TSEL0_LENGTH                            0x1
#define _CCPTMRS1_C7TSEL0_MASK                              0x10
#define _CCPTMRS1_C7TSEL1_POSN                              0x5
#define _CCPTMRS1_C7TSEL1_POSITION                          0x5
#define _CCPTMRS1_C7TSEL1_SIZE                              0x1
#define _CCPTMRS1_C7TSEL1_LENGTH                            0x1
#define _CCPTMRS1_C7TSEL1_MASK                              0x20

// Register: CCPTMRS2
#define CCPTMRS2 CCPTMRS2
extern volatile unsigned char           CCPTMRS2            __at(0x29F);
#ifndef _LIB_BUILD
asm("CCPTMRS2 equ 029Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3TSEL                 :2;
        unsigned P4TSEL                 :2;
        unsigned P9TSEL                 :2;
        unsigned P10TSEL                :2;
    };
    struct {
        unsigned P3TSEL0                :1;
        unsigned P3TSEL1                :1;
        unsigned P4TSEL0                :1;
        unsigned P4TSEL1                :1;
        unsigned P9TSEL0                :1;
        unsigned P9TSEL1                :1;
    };
} CCPTMRS2bits_t;
extern volatile CCPTMRS2bits_t CCPTMRS2bits __at(0x29F);
// bitfield macros
#define _CCPTMRS2_P3TSEL_POSN                               0x0
#define _CCPTMRS2_P3TSEL_POSITION                           0x0
#define _CCPTMRS2_P3TSEL_SIZE                               0x2
#define _CCPTMRS2_P3TSEL_LENGTH                             0x2
#define _CCPTMRS2_P3TSEL_MASK                               0x3
#define _CCPTMRS2_P4TSEL_POSN                               0x2
#define _CCPTMRS2_P4TSEL_POSITION                           0x2
#define _CCPTMRS2_P4TSEL_SIZE                               0x2
#define _CCPTMRS2_P4TSEL_LENGTH                             0x2
#define _CCPTMRS2_P4TSEL_MASK                               0xC
#define _CCPTMRS2_P9TSEL_POSN                               0x4
#define _CCPTMRS2_P9TSEL_POSITION                           0x4
#define _CCPTMRS2_P9TSEL_SIZE                               0x2
#define _CCPTMRS2_P9TSEL_LENGTH                             0x2
#define _CCPTMRS2_P9TSEL_MASK                               0x30
#define _CCPTMRS2_P10TSEL_POSN                              0x6
#define _CCPTMRS2_P10TSEL_POSITION                          0x6
#define _CCPTMRS2_P10TSEL_SIZE                              0x2
#define _CCPTMRS2_P10TSEL_LENGTH                            0x2
#define _CCPTMRS2_P10TSEL_MASK                              0xC0
#define _CCPTMRS2_P3TSEL0_POSN                              0x0
#define _CCPTMRS2_P3TSEL0_POSITION                          0x0
#define _CCPTMRS2_P3TSEL0_SIZE                              0x1
#define _CCPTMRS2_P3TSEL0_LENGTH                            0x1
#define _CCPTMRS2_P3TSEL0_MASK                              0x1
#define _CCPTMRS2_P3TSEL1_POSN                              0x1
#define _CCPTMRS2_P3TSEL1_POSITION                          0x1
#define _CCPTMRS2_P3TSEL1_SIZE                              0x1
#define _CCPTMRS2_P3TSEL1_LENGTH                            0x1
#define _CCPTMRS2_P3TSEL1_MASK                              0x2
#define _CCPTMRS2_P4TSEL0_POSN                              0x2
#define _CCPTMRS2_P4TSEL0_POSITION                          0x2
#define _CCPTMRS2_P4TSEL0_SIZE                              0x1
#define _CCPTMRS2_P4TSEL0_LENGTH                            0x1
#define _CCPTMRS2_P4TSEL0_MASK                              0x4
#define _CCPTMRS2_P4TSEL1_POSN                              0x3
#define _CCPTMRS2_P4TSEL1_POSITION                          0x3
#define _CCPTMRS2_P4TSEL1_SIZE                              0x1
#define _CCPTMRS2_P4TSEL1_LENGTH                            0x1
#define _CCPTMRS2_P4TSEL1_MASK                              0x8
#define _CCPTMRS2_P9TSEL0_POSN                              0x4
#define _CCPTMRS2_P9TSEL0_POSITION                          0x4
#define _CCPTMRS2_P9TSEL0_SIZE                              0x1
#define _CCPTMRS2_P9TSEL0_LENGTH                            0x1
#define _CCPTMRS2_P9TSEL0_MASK                              0x10
#define _CCPTMRS2_P9TSEL1_POSN                              0x5
#define _CCPTMRS2_P9TSEL1_POSITION                          0x5
#define _CCPTMRS2_P9TSEL1_SIZE                              0x1
#define _CCPTMRS2_P9TSEL1_LENGTH                            0x1
#define _CCPTMRS2_P9TSEL1_MASK                              0x20

