MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1779/mcu.h
// Register: DAC7CON0
#define DAC7CON0 DAC7CON0
extern volatile unsigned char           DAC7CON0            __at(0x59E);
#ifndef _LIB_BUILD
asm("DAC7CON0 equ 059Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NSS                    :2;
        unsigned PSS                    :2;
        unsigned OE2                    :1;
        unsigned OE1                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned NSS0                   :1;
        unsigned NSS1                   :1;
        unsigned PSS0                   :1;
        unsigned PSS1                   :1;
    };
    struct {
        unsigned DACNSS                 :2;
        unsigned DACPSS                 :2;
        unsigned DACOE2                 :1;
        unsigned DACOE1                 :1;
        unsigned                        :1;
        unsigned DACEN                  :1;
    };
    struct {
        unsigned DACNSS0                :1;
        unsigned DACNSS1                :1;
        unsigned DACPSS0                :1;
        unsigned DACPSS1                :1;
    };
    struct {
        unsigned DAC7NSS                :2;
        unsigned DAC7PSS                :2;
        unsigned DAC7OE2                :1;
        unsigned DAC7OE1                :1;
        unsigned                        :1;
        unsigned DAC7EN                 :1;
    };
    struct {
        unsigned DAC7NSS0               :1;
        unsigned DAC7NSS1               :1;
        unsigned DAC7PSS0               :1;
        unsigned DAC7PSS1               :1;
    };
} DAC7CON0bits_t;
extern volatile DAC7CON0bits_t DAC7CON0bits __at(0x59E);
// bitfield macros
#define _DAC7CON0_NSS_POSN                                  0x0
#define _DAC7CON0_NSS_POSITION                              0x0
#define _DAC7CON0_NSS_SIZE                                  0x2
#define _DAC7CON0_NSS_LENGTH                                0x2
#define _DAC7CON0_NSS_MASK                                  0x3
#define _DAC7CON0_PSS_POSN                                  0x2
#define _DAC7CON0_PSS_POSITION                              0x2
#define _DAC7CON0_PSS_SIZE                                  0x2
#define _DAC7CON0_PSS_LENGTH                                0x2
#define _DAC7CON0_PSS_MASK                                  0xC
#define _DAC7CON0_OE2_POSN                                  0x4
#define _DAC7CON0_OE2_POSITION                              0x4
#define _DAC7CON0_OE2_SIZE                                  0x1
#define _DAC7CON0_OE2_LENGTH                                0x1
#define _DAC7CON0_OE2_MASK                                  0x10
#define _DAC7CON0_OE1_POSN                                  0x5
#define _DAC7CON0_OE1_POSITION                              0x5
#define _DAC7CON0_OE1_SIZE                                  0x1
#define _DAC7CON0_OE1_LENGTH                                0x1
#define _DAC7CON0_OE1_MASK                                  0x20
#define _DAC7CON0_EN_POSN                                   0x7
#define _DAC7CON0_EN_POSITION                               0x7
#define _DAC7CON0_EN_SIZE                                   0x1
#define _DAC7CON0_EN_LENGTH                                 0x1
#define _DAC7CON0_EN_MASK                                   0x80
#define _DAC7CON0_NSS0_POSN                                 0x0
#define _DAC7CON0_NSS0_POSITION                             0x0
#define _DAC7CON0_NSS0_SIZE                                 0x1
#define _DAC7CON0_NSS0_LENGTH                               0x1
#define _DAC7CON0_NSS0_MASK                                 0x1
#define _DAC7CON0_NSS1_POSN                                 0x1
#define _DAC7CON0_NSS1_POSITION                             0x1
#define _DAC7CON0_NSS1_SIZE                                 0x1
#define _DAC7CON0_NSS1_LENGTH                               0x1
#define _DAC7CON0_NSS1_MASK                                 0x2
#define _DAC7CON0_PSS0_POSN                                 0x2
#define _DAC7CON0_PSS0_POSITION                             0x2
#define _DAC7CON0_PSS0_SIZE                                 0x1
#define _DAC7CON0_PSS0_LENGTH                               0x1
#define _DAC7CON0_PSS0_MASK                                 0x4
#define _DAC7CON0_PSS1_POSN                                 0x3
#define _DAC7CON0_PSS1_POSITION                             0x3
#define _DAC7CON0_PSS1_SIZE                                 0x1
#define _DAC7CON0_PSS1_LENGTH                               0x1
#define _DAC7CON0_PSS1_MASK                                 0x8
#define _DAC7CON0_DACNSS_POSN                               0x0
#define _DAC7CON0_DACNSS_POSITION                           0x0
#define _DAC7CON0_DACNSS_SIZE                               0x2
#define _DAC7CON0_DACNSS_LENGTH                             0x2
#define _DAC7CON0_DACNSS_MASK                               0x3
#define _DAC7CON0_DACPSS_POSN                               0x2
#define _DAC7CON0_DACPSS_POSITION                           0x2
#define _DAC7CON0_DACPSS_SIZE                               0x2
#define _DAC7CON0_DACPSS_LENGTH                             0x2
#define _DAC7CON0_DACPSS_MASK                               0xC
#define _DAC7CON0_DACOE2_POSN                               0x4
#define _DAC7CON0_DACOE2_POSITION                           0x4
#define _DAC7CON0_DACOE2_SIZE                               0x1
#define _DAC7CON0_DACOE2_LENGTH                             0x1
#define _DAC7CON0_DACOE2_MASK                               0x10
#define _DAC7CON0_DACOE1_POSN                               0x5
#define _DAC7CON0_DACOE1_POSITION                           0x5
#define _DAC7CON0_DACOE1_SIZE                               0x1
#define _DAC7CON0_DACOE1_LENGTH                             0x1
#define _DAC7CON0_DACOE1_MASK                               0x20
#define _DAC7CON0_DACEN_POSN                                0x7
#define _DAC7CON0_DACEN_POSITION                            0x7
#define _DAC7CON0_DACEN_SIZE                                0x1
#define _DAC7CON0_DACEN_LENGTH                              0x1
#define _DAC7CON0_DACEN_MASK                                0x80
#define _DAC7CON0_DACNSS0_POSN                              0x0
#define _DAC7CON0_DACNSS0_POSITION                          0x0
#define _DAC7CON0_DACNSS0_SIZE                              0x1
#define _DAC7CON0_DACNSS0_LENGTH                            0x1
#define _DAC7CON0_DACNSS0_MASK                              0x1
#define _DAC7CON0_DACNSS1_POSN                              0x1
#define _DAC7CON0_DACNSS1_POSITION                          0x1
#define _DAC7CON0_DACNSS1_SIZE                              0x1
#define _DAC7CON0_DACNSS1_LENGTH                            0x1
#define _DAC7CON0_DACNSS1_MASK                              0x2
#define _DAC7CON0_DACPSS0_POSN                              0x2
#define _DAC7CON0_DACPSS0_POSITION                          0x2
#define _DAC7CON0_DACPSS0_SIZE                              0x1
#define _DAC7CON0_DACPSS0_LENGTH                            0x1
#define _DAC7CON0_DACPSS0_MASK                              0x4
#define _DAC7CON0_DACPSS1_POSN                              0x3
#define _DAC7CON0_DACPSS1_POSITION                          0x3
#define _DAC7CON0_DACPSS1_SIZE                              0x1
#define _DAC7CON0_DACPSS1_LENGTH                            0x1
#define _DAC7CON0_DACPSS1_MASK                              0x8
#define _DAC7CON0_DAC7NSS_POSN                              0x0
#define _DAC7CON0_DAC7NSS_POSITION                          0x0
#define _DAC7CON0_DAC7NSS_SIZE                              0x2
#define _DAC7CON0_DAC7NSS_LENGTH                            0x2
#define _DAC7CON0_DAC7NSS_MASK                              0x3
#define _DAC7CON0_DAC7PSS_POSN                              0x2
#define _DAC7CON0_DAC7PSS_POSITION                          0x2
#define _DAC7CON0_DAC7PSS_SIZE                              0x2
#define _DAC7CON0_DAC7PSS_LENGTH                            0x2
#define _DAC7CON0_DAC7PSS_MASK                              0xC
#define _DAC7CON0_DAC7OE2_POSN                              0x4
#define _DAC7CON0_DAC7OE2_POSITION                          0x4
#define _DAC7CON0_DAC7OE2_SIZE                              0x1
#define _DAC7CON0_DAC7OE2_LENGTH                            0x1
#define _DAC7CON0_DAC7OE2_MASK                              0x10
#define _DAC7CON0_DAC7OE1_POSN                              0x5
#define _DAC7CON0_DAC7OE1_POSITION                          0x5
#define _DAC7CON0_DAC7OE1_SIZE                              0x1
#define _DAC7CON0_DAC7OE1_LENGTH                            0x1
#define _DAC7CON0_DAC7OE1_MASK                              0x20
#define _DAC7CON0_DAC7EN_POSN                               0x7
#define _DAC7CON0_DAC7EN_POSITION                           0x7
#define _DAC7CON0_DAC7EN_SIZE                               0x1
#define _DAC7CON0_DAC7EN_LENGTH                             0x1
#define _DAC7CON0_DAC7EN_MASK                               0x80
#define _DAC7CON0_DAC7NSS0_POSN                             0x0
#define _DAC7CON0_DAC7NSS0_POSITION                         0x0
#define _DAC7CON0_DAC7NSS0_SIZE                             0x1
#define _DAC7CON0_DAC7NSS0_LENGTH                           0x1
#define _DAC7CON0_DAC7NSS0_MASK                             0x1
#define _DAC7CON0_DAC7NSS1_POSN                             0x1
#define _DAC7CON0_DAC7NSS1_POSITION                         0x1
#define _DAC7CON0_DAC7NSS1_SIZE                             0x1
#define _DAC7CON0_DAC7NSS1_LENGTH                           0x1
#define _DAC7CON0_DAC7NSS1_MASK                             0x2
#define _DAC7CON0_DAC7PSS0_POSN                             0x2
#define _DAC7CON0_DAC7PSS0_POSITION                         0x2
#define _DAC7CON0_DAC7PSS0_SIZE                             0x1
#define _DAC7CON0_DAC7PSS0_LENGTH                           0x1
#define _DAC7CON0_DAC7PSS0_MASK                             0x4
#define _DAC7CON0_DAC7PSS1_POSN                             0x3
#define _DAC7CON0_DAC7PSS1_POSITION                         0x3
#define _DAC7CON0_DAC7PSS1_SIZE                             0x1
#define _DAC7CON0_DAC7PSS1_LENGTH                           0x1
#define _DAC7CON0_DAC7PSS1_MASK                             0x8

// Register: DAC7REF
#define DAC7REF DAC7REF
extern volatile unsigned char           DAC7REF             __at(0x59F);
#ifndef _LIB_BUILD
asm("DAC7REF equ 059Fh");
#endif
// aliases
extern volatile unsigned char           DAC7CON1            __at(0x59F);
#ifndef _LIB_BUILD
asm("DAC7CON1 equ 059Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DACR                   :5;
    };
    struct {
        unsigned DACR0                  :1;
        unsigned DACR1                  :1;
        unsigned DACR2                  :1;
        unsigned DACR3                  :1;
        unsigned DACR4                  :1;
    };
    struct {
        unsigned R0                     :1;
        unsigned R1                     :1;
        unsigned R2                     :1;
        unsigned R3                     :1;
        unsigned R4                     :1;
    };
    struct {
        unsigned DAC7R                  :5;
    };
    struct {
        unsigned DAC7R0                 :1;
        unsigned DAC7R1                 :1;
        unsigned DAC7R2                 :1;
        unsigned DAC7R3                 :1;
        unsigned DAC7R4                 :1;
    };
    struct {
        unsigned REF0                   :1;
        unsigned REF1                   :1;
        unsigned REF2                   :1;
        unsigned REF3                   :1;
        unsigned REF4                   :1;
    };
    struct {
        unsigned DAC7REF0               :1;
        unsigned DAC7REF1               :1;
        unsigned DAC7REF2               :1;
        unsigned DAC7REF3               :1;
        unsigned DAC7REF4               :1;
    };
} DAC7REFbits_t;
