MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1779/mcu.h
extern volatile PRG4RTSSbits_t PRG4RTSSbits __at(0x60E);
// bitfield macros
#define _PRG4RTSS_RTSS_POSN                                 0x0
#define _PRG4RTSS_RTSS_POSITION                             0x0
#define _PRG4RTSS_RTSS_SIZE                                 0x8
#define _PRG4RTSS_RTSS_LENGTH                               0x8
#define _PRG4RTSS_RTSS_MASK                                 0xFF
#define _PRG4RTSS_RTSS0_POSN                                0x0
#define _PRG4RTSS_RTSS0_POSITION                            0x0
#define _PRG4RTSS_RTSS0_SIZE                                0x1
#define _PRG4RTSS_RTSS0_LENGTH                              0x1
#define _PRG4RTSS_RTSS0_MASK                                0x1
#define _PRG4RTSS_RTSS1_POSN                                0x1
#define _PRG4RTSS_RTSS1_POSITION                            0x1
#define _PRG4RTSS_RTSS1_SIZE                                0x1
#define _PRG4RTSS_RTSS1_LENGTH                              0x1
#define _PRG4RTSS_RTSS1_MASK                                0x2
#define _PRG4RTSS_RTSS2_POSN                                0x2
#define _PRG4RTSS_RTSS2_POSITION                            0x2
#define _PRG4RTSS_RTSS2_SIZE                                0x1
#define _PRG4RTSS_RTSS2_LENGTH                              0x1
#define _PRG4RTSS_RTSS2_MASK                                0x4
#define _PRG4RTSS_RTSS3_POSN                                0x3
#define _PRG4RTSS_RTSS3_POSITION                            0x3
#define _PRG4RTSS_RTSS3_SIZE                                0x1
#define _PRG4RTSS_RTSS3_LENGTH                              0x1
#define _PRG4RTSS_RTSS3_MASK                                0x8
#define _PRG4RTSS_RG4RTSS0_POSN                             0x0
#define _PRG4RTSS_RG4RTSS0_POSITION                         0x0
#define _PRG4RTSS_RG4RTSS0_SIZE                             0x1
#define _PRG4RTSS_RG4RTSS0_LENGTH                           0x1
#define _PRG4RTSS_RG4RTSS0_MASK                             0x1
#define _PRG4RTSS_RG4RTSS1_POSN                             0x1
#define _PRG4RTSS_RG4RTSS1_POSITION                         0x1
#define _PRG4RTSS_RG4RTSS1_SIZE                             0x1
#define _PRG4RTSS_RG4RTSS1_LENGTH                           0x1
#define _PRG4RTSS_RG4RTSS1_MASK                             0x2
#define _PRG4RTSS_RG4RTSS2_POSN                             0x2
#define _PRG4RTSS_RG4RTSS2_POSITION                         0x2
#define _PRG4RTSS_RG4RTSS2_SIZE                             0x1
#define _PRG4RTSS_RG4RTSS2_LENGTH                           0x1
#define _PRG4RTSS_RG4RTSS2_MASK                             0x4
#define _PRG4RTSS_RG4RTSS3_POSN                             0x3
#define _PRG4RTSS_RG4RTSS3_POSITION                         0x3
#define _PRG4RTSS_RG4RTSS3_SIZE                             0x1
#define _PRG4RTSS_RG4RTSS3_LENGTH                           0x1
#define _PRG4RTSS_RG4RTSS3_MASK                             0x8

// Register: PRG4FTSS
#define PRG4FTSS PRG4FTSS
extern volatile unsigned char           PRG4FTSS            __at(0x60F);
#ifndef _LIB_BUILD
asm("PRG4FTSS equ 060Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FTSS                   :8;
    };
    struct {
        unsigned FTSS0                  :1;
        unsigned FTSS1                  :1;
        unsigned FTSS2                  :1;
        unsigned FTSS3                  :1;
    };
    struct {
        unsigned RG4FTSS0               :1;
        unsigned RG4FTSS1               :1;
        unsigned RG4FTSS2               :1;
        unsigned RG4FTSS3               :1;
    };
} PRG4FTSSbits_t;
extern volatile PRG4FTSSbits_t PRG4FTSSbits __at(0x60F);
// bitfield macros
#define _PRG4FTSS_FTSS_POSN                                 0x0
#define _PRG4FTSS_FTSS_POSITION                             0x0
#define _PRG4FTSS_FTSS_SIZE                                 0x8
#define _PRG4FTSS_FTSS_LENGTH                               0x8
#define _PRG4FTSS_FTSS_MASK                                 0xFF
#define _PRG4FTSS_FTSS0_POSN                                0x0
#define _PRG4FTSS_FTSS0_POSITION                            0x0
#define _PRG4FTSS_FTSS0_SIZE                                0x1
#define _PRG4FTSS_FTSS0_LENGTH                              0x1
#define _PRG4FTSS_FTSS0_MASK                                0x1
#define _PRG4FTSS_FTSS1_POSN                                0x1
#define _PRG4FTSS_FTSS1_POSITION                            0x1
#define _PRG4FTSS_FTSS1_SIZE                                0x1
#define _PRG4FTSS_FTSS1_LENGTH                              0x1
#define _PRG4FTSS_FTSS1_MASK                                0x2
#define _PRG4FTSS_FTSS2_POSN                                0x2
#define _PRG4FTSS_FTSS2_POSITION                            0x2
#define _PRG4FTSS_FTSS2_SIZE                                0x1
#define _PRG4FTSS_FTSS2_LENGTH                              0x1
#define _PRG4FTSS_FTSS2_MASK                                0x4
#define _PRG4FTSS_FTSS3_POSN                                0x3
#define _PRG4FTSS_FTSS3_POSITION                            0x3
#define _PRG4FTSS_FTSS3_SIZE                                0x1
#define _PRG4FTSS_FTSS3_LENGTH                              0x1
#define _PRG4FTSS_FTSS3_MASK                                0x8
#define _PRG4FTSS_RG4FTSS0_POSN                             0x0
#define _PRG4FTSS_RG4FTSS0_POSITION                         0x0
#define _PRG4FTSS_RG4FTSS0_SIZE                             0x1
#define _PRG4FTSS_RG4FTSS0_LENGTH                           0x1
#define _PRG4FTSS_RG4FTSS0_MASK                             0x1
#define _PRG4FTSS_RG4FTSS1_POSN                             0x1
#define _PRG4FTSS_RG4FTSS1_POSITION                         0x1
#define _PRG4FTSS_RG4FTSS1_SIZE                             0x1
#define _PRG4FTSS_RG4FTSS1_LENGTH                           0x1
#define _PRG4FTSS_RG4FTSS1_MASK                             0x2
#define _PRG4FTSS_RG4FTSS2_POSN                             0x2
#define _PRG4FTSS_RG4FTSS2_POSITION                         0x2
#define _PRG4FTSS_RG4FTSS2_SIZE                             0x1
#define _PRG4FTSS_RG4FTSS2_LENGTH                           0x1
#define _PRG4FTSS_RG4FTSS2_MASK                             0x4
#define _PRG4FTSS_RG4FTSS3_POSN                             0x3
#define _PRG4FTSS_RG4FTSS3_POSITION                         0x3
#define _PRG4FTSS_RG4FTSS3_SIZE                             0x1
#define _PRG4FTSS_RG4FTSS3_LENGTH                           0x1
#define _PRG4FTSS_RG4FTSS3_MASK                             0x8

