MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1779/mcu.h
extern volatile PWM9DCHbits_t PWM9DCHbits __at(0x61B);
// bitfield macros
#define _PWM9DCH_DC_POSN                                    0x0
#define _PWM9DCH_DC_POSITION                                0x0
#define _PWM9DCH_DC_SIZE                                    0x8
#define _PWM9DCH_DC_LENGTH                                  0x8
#define _PWM9DCH_DC_MASK                                    0xFF
#define _PWM9DCH_DC2_POSN                                   0x0
#define _PWM9DCH_DC2_POSITION                               0x0
#define _PWM9DCH_DC2_SIZE                                   0x1
#define _PWM9DCH_DC2_LENGTH                                 0x1
#define _PWM9DCH_DC2_MASK                                   0x1
#define _PWM9DCH_DC3_POSN                                   0x1
#define _PWM9DCH_DC3_POSITION                               0x1
#define _PWM9DCH_DC3_SIZE                                   0x1
#define _PWM9DCH_DC3_LENGTH                                 0x1
#define _PWM9DCH_DC3_MASK                                   0x2
#define _PWM9DCH_DC4_POSN                                   0x2
#define _PWM9DCH_DC4_POSITION                               0x2
#define _PWM9DCH_DC4_SIZE                                   0x1
#define _PWM9DCH_DC4_LENGTH                                 0x1
#define _PWM9DCH_DC4_MASK                                   0x4
#define _PWM9DCH_DC5_POSN                                   0x3
#define _PWM9DCH_DC5_POSITION                               0x3
#define _PWM9DCH_DC5_SIZE                                   0x1
#define _PWM9DCH_DC5_LENGTH                                 0x1
#define _PWM9DCH_DC5_MASK                                   0x8
#define _PWM9DCH_DC6_POSN                                   0x4
#define _PWM9DCH_DC6_POSITION                               0x4
#define _PWM9DCH_DC6_SIZE                                   0x1
#define _PWM9DCH_DC6_LENGTH                                 0x1
#define _PWM9DCH_DC6_MASK                                   0x10
#define _PWM9DCH_DC7_POSN                                   0x5
#define _PWM9DCH_DC7_POSITION                               0x5
#define _PWM9DCH_DC7_SIZE                                   0x1
#define _PWM9DCH_DC7_LENGTH                                 0x1
#define _PWM9DCH_DC7_MASK                                   0x20
#define _PWM9DCH_DC8_POSN                                   0x6
#define _PWM9DCH_DC8_POSITION                               0x6
#define _PWM9DCH_DC8_SIZE                                   0x1
#define _PWM9DCH_DC8_LENGTH                                 0x1
#define _PWM9DCH_DC8_MASK                                   0x40
#define _PWM9DCH_DC9_POSN                                   0x7
#define _PWM9DCH_DC9_POSITION                               0x7
#define _PWM9DCH_DC9_SIZE                                   0x1
#define _PWM9DCH_DC9_LENGTH                                 0x1
#define _PWM9DCH_DC9_MASK                                   0x80
#define _PWM9DCH_PWM9DC2_POSN                               0x0
#define _PWM9DCH_PWM9DC2_POSITION                           0x0
#define _PWM9DCH_PWM9DC2_SIZE                               0x1
#define _PWM9DCH_PWM9DC2_LENGTH                             0x1
#define _PWM9DCH_PWM9DC2_MASK                               0x1
#define _PWM9DCH_PWM9DC3_POSN                               0x1
#define _PWM9DCH_PWM9DC3_POSITION                           0x1
#define _PWM9DCH_PWM9DC3_SIZE                               0x1
#define _PWM9DCH_PWM9DC3_LENGTH                             0x1
#define _PWM9DCH_PWM9DC3_MASK                               0x2
#define _PWM9DCH_PWM9DC4_POSN                               0x2
#define _PWM9DCH_PWM9DC4_POSITION                           0x2
#define _PWM9DCH_PWM9DC4_SIZE                               0x1
#define _PWM9DCH_PWM9DC4_LENGTH                             0x1
#define _PWM9DCH_PWM9DC4_MASK                               0x4
#define _PWM9DCH_PWM9DC5_POSN                               0x3
#define _PWM9DCH_PWM9DC5_POSITION                           0x3
#define _PWM9DCH_PWM9DC5_SIZE                               0x1
#define _PWM9DCH_PWM9DC5_LENGTH                             0x1
#define _PWM9DCH_PWM9DC5_MASK                               0x8
#define _PWM9DCH_PWM9DC6_POSN                               0x4
#define _PWM9DCH_PWM9DC6_POSITION                           0x4
#define _PWM9DCH_PWM9DC6_SIZE                               0x1
#define _PWM9DCH_PWM9DC6_LENGTH                             0x1
#define _PWM9DCH_PWM9DC6_MASK                               0x10
#define _PWM9DCH_PWM9DC7_POSN                               0x5
#define _PWM9DCH_PWM9DC7_POSITION                           0x5
#define _PWM9DCH_PWM9DC7_SIZE                               0x1
#define _PWM9DCH_PWM9DC7_LENGTH                             0x1
#define _PWM9DCH_PWM9DC7_MASK                               0x20
#define _PWM9DCH_PWM9DC8_POSN                               0x6
#define _PWM9DCH_PWM9DC8_POSITION                           0x6
#define _PWM9DCH_PWM9DC8_SIZE                               0x1
#define _PWM9DCH_PWM9DC8_LENGTH                             0x1
#define _PWM9DCH_PWM9DC8_MASK                               0x40
#define _PWM9DCH_PWM9DC9_POSN                               0x7
#define _PWM9DCH_PWM9DC9_POSITION                           0x7
#define _PWM9DCH_PWM9DC9_SIZE                               0x1
#define _PWM9DCH_PWM9DC9_LENGTH                             0x1
#define _PWM9DCH_PWM9DC9_MASK                               0x80
#define _PWM9DCH_PWMPW2_POSN                                0x0
#define _PWM9DCH_PWMPW2_POSITION                            0x0
#define _PWM9DCH_PWMPW2_SIZE                                0x1
#define _PWM9DCH_PWMPW2_LENGTH                              0x1
#define _PWM9DCH_PWMPW2_MASK                                0x1
#define _PWM9DCH_PWMPW3_POSN                                0x1
#define _PWM9DCH_PWMPW3_POSITION                            0x1
#define _PWM9DCH_PWMPW3_SIZE                                0x1
#define _PWM9DCH_PWMPW3_LENGTH                              0x1
#define _PWM9DCH_PWMPW3_MASK                                0x2
#define _PWM9DCH_PWMPW4_POSN                                0x2
#define _PWM9DCH_PWMPW4_POSITION                            0x2
#define _PWM9DCH_PWMPW4_SIZE                                0x1
#define _PWM9DCH_PWMPW4_LENGTH                              0x1
#define _PWM9DCH_PWMPW4_MASK                                0x4
#define _PWM9DCH_PWMPW5_POSN                                0x3
#define _PWM9DCH_PWMPW5_POSITION                            0x3
#define _PWM9DCH_PWMPW5_SIZE                                0x1
#define _PWM9DCH_PWMPW5_LENGTH                              0x1
#define _PWM9DCH_PWMPW5_MASK                                0x8
#define _PWM9DCH_PWMPW6_POSN                                0x4
#define _PWM9DCH_PWMPW6_POSITION                            0x4
#define _PWM9DCH_PWMPW6_SIZE                                0x1
#define _PWM9DCH_PWMPW6_LENGTH                              0x1
#define _PWM9DCH_PWMPW6_MASK                                0x10
#define _PWM9DCH_PWMPW7_POSN                                0x5
#define _PWM9DCH_PWMPW7_POSITION                            0x5
#define _PWM9DCH_PWMPW7_SIZE                                0x1
#define _PWM9DCH_PWMPW7_LENGTH                              0x1
#define _PWM9DCH_PWMPW7_MASK                                0x20
#define _PWM9DCH_PWMPW8_POSN                                0x6
#define _PWM9DCH_PWMPW8_POSITION                            0x6
#define _PWM9DCH_PWMPW8_SIZE                                0x1
#define _PWM9DCH_PWMPW8_LENGTH                              0x1
#define _PWM9DCH_PWMPW8_MASK                                0x40
#define _PWM9DCH_PWMPW9_POSN                                0x7
#define _PWM9DCH_PWMPW9_POSITION                            0x7
#define _PWM9DCH_PWMPW9_SIZE                                0x1
#define _PWM9DCH_PWMPW9_LENGTH                              0x1
#define _PWM9DCH_PWMPW9_MASK                                0x80

// Register: PWM9CON
#define PWM9CON PWM9CON
extern volatile unsigned char           PWM9CON             __at(0x61C);
#ifndef _LIB_BUILD
asm("PWM9CON equ 061Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :4;
        unsigned PWM9POL                :1;
        unsigned PWM9OUT                :1;
        unsigned                        :1;
        unsigned PWM9EN                 :1;
    };
} PWM9CONbits_t;
extern volatile PWM9CONbits_t PWM9CONbits __at(0x61C);
// bitfield macros
#define _PWM9CON_POL_POSN                                   0x4
#define _PWM9CON_POL_POSITION                               0x4
#define _PWM9CON_POL_SIZE                                   0x1
#define _PWM9CON_POL_LENGTH                                 0x1
#define _PWM9CON_POL_MASK                                   0x10
#define _PWM9CON_OUT_POSN                                   0x5
#define _PWM9CON_OUT_POSITION                               0x5
#define _PWM9CON_OUT_SIZE                                   0x1
#define _PWM9CON_OUT_LENGTH                                 0x1
#define _PWM9CON_OUT_MASK                                   0x20
#define _PWM9CON_EN_POSN                                    0x7
#define _PWM9CON_EN_POSITION                                0x7
#define _PWM9CON_EN_SIZE                                    0x1
#define _PWM9CON_EN_LENGTH                                  0x1
#define _PWM9CON_EN_MASK                                    0x80
#define _PWM9CON_PWM9POL_POSN                               0x4
#define _PWM9CON_PWM9POL_POSITION                           0x4
#define _PWM9CON_PWM9POL_SIZE                               0x1
#define _PWM9CON_PWM9POL_LENGTH                             0x1
#define _PWM9CON_PWM9POL_MASK                               0x10
#define _PWM9CON_PWM9OUT_POSN                               0x5
#define _PWM9CON_PWM9OUT_POSITION                           0x5
#define _PWM9CON_PWM9OUT_SIZE                               0x1
#define _PWM9CON_PWM9OUT_LENGTH                             0x1
#define _PWM9CON_PWM9OUT_MASK                               0x20
#define _PWM9CON_PWM9EN_POSN                                0x7
#define _PWM9CON_PWM9EN_POSITION                            0x7
#define _PWM9CON_PWM9EN_SIZE                                0x1
#define _PWM9CON_PWM9EN_LENGTH                              0x1
#define _PWM9CON_PWM9EN_MASK                                0x80

// Register: PWM10DC
#define PWM10DC PWM10DC
extern volatile unsigned short          PWM10DC             __at(0x61D);
#ifndef _LIB_BUILD
asm("PWM10DC equ 061Dh");
#endif

// Register: PWM10DCL
#define PWM10DCL PWM10DCL
extern volatile unsigned char           PWM10DCL            __at(0x61D);
#ifndef _LIB_BUILD
asm("PWM10DCL equ 061Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned DC                     :2;
    };
    struct {
        unsigned                        :6;
        unsigned DC0                    :1;
        unsigned DC1                    :1;
    };
    struct {
        unsigned                        :6;
        unsigned PWM10DC0               :1;
        unsigned PWM10DC1               :1;
    };
    struct {
        unsigned                        :6;
        unsigned PWMPW0                 :1;
        unsigned PWMPW1                 :1;
    };
} PWM10DCLbits_t;
extern volatile PWM10DCLbits_t PWM10DCLbits __at(0x61D);
// bitfield macros
#define _PWM10DCL_DC_POSN                                   0x6
#define _PWM10DCL_DC_POSITION                               0x6
#define _PWM10DCL_DC_SIZE                                   0x2
#define _PWM10DCL_DC_LENGTH                                 0x2
#define _PWM10DCL_DC_MASK                                   0xC0
#define _PWM10DCL_DC0_POSN                                  0x6
#define _PWM10DCL_DC0_POSITION                              0x6
#define _PWM10DCL_DC0_SIZE                                  0x1
#define _PWM10DCL_DC0_LENGTH                                0x1
#define _PWM10DCL_DC0_MASK                                  0x40
#define _PWM10DCL_DC1_POSN                                  0x7
#define _PWM10DCL_DC1_POSITION                              0x7
#define _PWM10DCL_DC1_SIZE                                  0x1
#define _PWM10DCL_DC1_LENGTH                                0x1
#define _PWM10DCL_DC1_MASK                                  0x80
#define _PWM10DCL_PWM10DC0_POSN                             0x6
#define _PWM10DCL_PWM10DC0_POSITION                         0x6
#define _PWM10DCL_PWM10DC0_SIZE                             0x1
#define _PWM10DCL_PWM10DC0_LENGTH                           0x1
#define _PWM10DCL_PWM10DC0_MASK                             0x40
#define _PWM10DCL_PWM10DC1_POSN                             0x7
#define _PWM10DCL_PWM10DC1_POSITION                         0x7
#define _PWM10DCL_PWM10DC1_SIZE                             0x1
#define _PWM10DCL_PWM10DC1_LENGTH                           0x1
#define _PWM10DCL_PWM10DC1_MASK                             0x80
#define _PWM10DCL_PWMPW0_POSN                               0x6
#define _PWM10DCL_PWMPW0_POSITION                           0x6
#define _PWM10DCL_PWMPW0_SIZE                               0x1
#define _PWM10DCL_PWMPW0_LENGTH                             0x1
#define _PWM10DCL_PWMPW0_MASK                               0x40
#define _PWM10DCL_PWMPW1_POSN                               0x7
#define _PWM10DCL_PWMPW1_POSITION                           0x7
#define _PWM10DCL_PWMPW1_SIZE                               0x1
#define _PWM10DCL_PWMPW1_LENGTH                             0x1
#define _PWM10DCL_PWMPW1_MASK                               0x80

// Register: PWM10DCH
#define PWM10DCH PWM10DCH
extern volatile unsigned char           PWM10DCH            __at(0x61E);
#ifndef _LIB_BUILD
asm("PWM10DCH equ 061Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned DC2                    :1;
        unsigned DC3                    :1;
        unsigned DC4                    :1;
        unsigned DC5                    :1;
        unsigned DC6                    :1;
        unsigned DC7                    :1;
        unsigned DC8                    :1;
        unsigned DC9                    :1;
    };
    struct {
        unsigned PWM10DC2               :1;
        unsigned PWM10DC3               :1;
        unsigned PWM10DC4               :1;
        unsigned PWM10DC5               :1;
        unsigned PWM10DC6               :1;
        unsigned PWM10DC7               :1;
        unsigned PWM10DC8               :1;
        unsigned PWM10DC9               :1;
    };
    struct {
        unsigned PWMPW2                 :1;
        unsigned PWMPW3                 :1;
        unsigned PWMPW4                 :1;
        unsigned PWMPW5                 :1;
        unsigned PWMPW6                 :1;
        unsigned PWMPW7                 :1;
        unsigned PWMPW8                 :1;
        unsigned PWMPW9                 :1;
    };
} PWM10DCHbits_t;
extern volatile PWM10DCHbits_t PWM10DCHbits __at(0x61E);
// bitfield macros
#define _PWM10DCH_DC_POSN                                   0x0
#define _PWM10DCH_DC_POSITION                               0x0
#define _PWM10DCH_DC_SIZE                                   0x8
#define _PWM10DCH_DC_LENGTH                                 0x8
#define _PWM10DCH_DC_MASK                                   0xFF
#define _PWM10DCH_DC2_POSN                                  0x0
#define _PWM10DCH_DC2_POSITION                              0x0
#define _PWM10DCH_DC2_SIZE                                  0x1
#define _PWM10DCH_DC2_LENGTH                                0x1
#define _PWM10DCH_DC2_MASK                                  0x1
#define _PWM10DCH_DC3_POSN                                  0x1
#define _PWM10DCH_DC3_POSITION                              0x1
#define _PWM10DCH_DC3_SIZE                                  0x1
#define _PWM10DCH_DC3_LENGTH                                0x1
#define _PWM10DCH_DC3_MASK                                  0x2
#define _PWM10DCH_DC4_POSN                                  0x2
#define _PWM10DCH_DC4_POSITION                              0x2
#define _PWM10DCH_DC4_SIZE                                  0x1
#define _PWM10DCH_DC4_LENGTH                                0x1
#define _PWM10DCH_DC4_MASK                                  0x4
#define _PWM10DCH_DC5_POSN                                  0x3
#define _PWM10DCH_DC5_POSITION                              0x3
#define _PWM10DCH_DC5_SIZE                                  0x1
#define _PWM10DCH_DC5_LENGTH                                0x1
#define _PWM10DCH_DC5_MASK                                  0x8
#define _PWM10DCH_DC6_POSN                                  0x4
#define _PWM10DCH_DC6_POSITION                              0x4
#define _PWM10DCH_DC6_SIZE                                  0x1
#define _PWM10DCH_DC6_LENGTH                                0x1
#define _PWM10DCH_DC6_MASK                                  0x10
#define _PWM10DCH_DC7_POSN                                  0x5
#define _PWM10DCH_DC7_POSITION                              0x5
#define _PWM10DCH_DC7_SIZE                                  0x1
#define _PWM10DCH_DC7_LENGTH                                0x1
#define _PWM10DCH_DC7_MASK                                  0x20
#define _PWM10DCH_DC8_POSN                                  0x6
#define _PWM10DCH_DC8_POSITION                              0x6
#define _PWM10DCH_DC8_SIZE                                  0x1
#define _PWM10DCH_DC8_LENGTH                                0x1
#define _PWM10DCH_DC8_MASK                                  0x40
#define _PWM10DCH_DC9_POSN                                  0x7
#define _PWM10DCH_DC9_POSITION                              0x7
#define _PWM10DCH_DC9_SIZE                                  0x1
#define _PWM10DCH_DC9_LENGTH                                0x1
#define _PWM10DCH_DC9_MASK                                  0x80
#define _PWM10DCH_PWM10DC2_POSN                             0x0
#define _PWM10DCH_PWM10DC2_POSITION                         0x0
#define _PWM10DCH_PWM10DC2_SIZE                             0x1
#define _PWM10DCH_PWM10DC2_LENGTH                           0x1
#define _PWM10DCH_PWM10DC2_MASK                             0x1
#define _PWM10DCH_PWM10DC3_POSN                             0x1
#define _PWM10DCH_PWM10DC3_POSITION                         0x1
#define _PWM10DCH_PWM10DC3_SIZE                             0x1
#define _PWM10DCH_PWM10DC3_LENGTH                           0x1
#define _PWM10DCH_PWM10DC3_MASK                             0x2
#define _PWM10DCH_PWM10DC4_POSN                             0x2
#define _PWM10DCH_PWM10DC4_POSITION                         0x2
#define _PWM10DCH_PWM10DC4_SIZE                             0x1
#define _PWM10DCH_PWM10DC4_LENGTH                           0x1
#define _PWM10DCH_PWM10DC4_MASK                             0x4
#define _PWM10DCH_PWM10DC5_POSN                             0x3
#define _PWM10DCH_PWM10DC5_POSITION                         0x3
#define _PWM10DCH_PWM10DC5_SIZE                             0x1
#define _PWM10DCH_PWM10DC5_LENGTH                           0x1
#define _PWM10DCH_PWM10DC5_MASK                             0x8
#define _PWM10DCH_PWM10DC6_POSN                             0x4
#define _PWM10DCH_PWM10DC6_POSITION                         0x4
#define _PWM10DCH_PWM10DC6_SIZE                             0x1
#define _PWM10DCH_PWM10DC6_LENGTH                           0x1
#define _PWM10DCH_PWM10DC6_MASK                             0x10
#define _PWM10DCH_PWM10DC7_POSN                             0x5
#define _PWM10DCH_PWM10DC7_POSITION                         0x5
#define _PWM10DCH_PWM10DC7_SIZE                             0x1
#define _PWM10DCH_PWM10DC7_LENGTH                           0x1
#define _PWM10DCH_PWM10DC7_MASK                             0x20
#define _PWM10DCH_PWM10DC8_POSN                             0x6
#define _PWM10DCH_PWM10DC8_POSITION                         0x6
#define _PWM10DCH_PWM10DC8_SIZE                             0x1
#define _PWM10DCH_PWM10DC8_LENGTH                           0x1
#define _PWM10DCH_PWM10DC8_MASK                             0x40
#define _PWM10DCH_PWM10DC9_POSN                             0x7
#define _PWM10DCH_PWM10DC9_POSITION                         0x7
#define _PWM10DCH_PWM10DC9_SIZE                             0x1
#define _PWM10DCH_PWM10DC9_LENGTH                           0x1
#define _PWM10DCH_PWM10DC9_MASK                             0x80
#define _PWM10DCH_PWMPW2_POSN                               0x0
#define _PWM10DCH_PWMPW2_POSITION                           0x0
#define _PWM10DCH_PWMPW2_SIZE                               0x1
#define _PWM10DCH_PWMPW2_LENGTH                             0x1
#define _PWM10DCH_PWMPW2_MASK                               0x1
#define _PWM10DCH_PWMPW3_POSN                               0x1
#define _PWM10DCH_PWMPW3_POSITION                           0x1
#define _PWM10DCH_PWMPW3_SIZE                               0x1
#define _PWM10DCH_PWMPW3_LENGTH                             0x1
#define _PWM10DCH_PWMPW3_MASK                               0x2
#define _PWM10DCH_PWMPW4_POSN                               0x2
#define _PWM10DCH_PWMPW4_POSITION                           0x2
#define _PWM10DCH_PWMPW4_SIZE                               0x1
#define _PWM10DCH_PWMPW4_LENGTH                             0x1
#define _PWM10DCH_PWMPW4_MASK                               0x4
#define _PWM10DCH_PWMPW5_POSN                               0x3
#define _PWM10DCH_PWMPW5_POSITION                           0x3
#define _PWM10DCH_PWMPW5_SIZE                               0x1
#define _PWM10DCH_PWMPW5_LENGTH                             0x1
#define _PWM10DCH_PWMPW5_MASK                               0x8
#define _PWM10DCH_PWMPW6_POSN                               0x4
#define _PWM10DCH_PWMPW6_POSITION                           0x4
#define _PWM10DCH_PWMPW6_SIZE                               0x1
#define _PWM10DCH_PWMPW6_LENGTH                             0x1
#define _PWM10DCH_PWMPW6_MASK                               0x10
#define _PWM10DCH_PWMPW7_POSN                               0x5
#define _PWM10DCH_PWMPW7_POSITION                           0x5
#define _PWM10DCH_PWMPW7_SIZE                               0x1
#define _PWM10DCH_PWMPW7_LENGTH                             0x1
#define _PWM10DCH_PWMPW7_MASK                               0x20
#define _PWM10DCH_PWMPW8_POSN                               0x6
#define _PWM10DCH_PWMPW8_POSITION                           0x6
#define _PWM10DCH_PWMPW8_SIZE                               0x1
#define _PWM10DCH_PWMPW8_LENGTH                             0x1
#define _PWM10DCH_PWMPW8_MASK                               0x40
#define _PWM10DCH_PWMPW9_POSN                               0x7
#define _PWM10DCH_PWMPW9_POSITION                           0x7
#define _PWM10DCH_PWMPW9_SIZE                               0x1
#define _PWM10DCH_PWMPW9_LENGTH                             0x1
#define _PWM10DCH_PWMPW9_MASK                               0x80

