MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1779/mcu.h
extern volatile COG1ASD1bits_t COG1ASD1bits __at(0x69E);
// bitfield macros
#define _COG1ASD1_AS0E_POSN                                 0x0
#define _COG1ASD1_AS0E_POSITION                             0x0
#define _COG1ASD1_AS0E_SIZE                                 0x1
#define _COG1ASD1_AS0E_LENGTH                               0x1
#define _COG1ASD1_AS0E_MASK                                 0x1
#define _COG1ASD1_AS1E_POSN                                 0x1
#define _COG1ASD1_AS1E_POSITION                             0x1
#define _COG1ASD1_AS1E_SIZE                                 0x1
#define _COG1ASD1_AS1E_LENGTH                               0x1
#define _COG1ASD1_AS1E_MASK                                 0x2
#define _COG1ASD1_AS2E_POSN                                 0x2
#define _COG1ASD1_AS2E_POSITION                             0x2
#define _COG1ASD1_AS2E_SIZE                                 0x1
#define _COG1ASD1_AS2E_LENGTH                               0x1
#define _COG1ASD1_AS2E_MASK                                 0x4
#define _COG1ASD1_AS3E_POSN                                 0x3
#define _COG1ASD1_AS3E_POSITION                             0x3
#define _COG1ASD1_AS3E_SIZE                                 0x1
#define _COG1ASD1_AS3E_LENGTH                               0x1
#define _COG1ASD1_AS3E_MASK                                 0x8
#define _COG1ASD1_AS4E_POSN                                 0x4
#define _COG1ASD1_AS4E_POSITION                             0x4
#define _COG1ASD1_AS4E_SIZE                                 0x1
#define _COG1ASD1_AS4E_LENGTH                               0x1
#define _COG1ASD1_AS4E_MASK                                 0x10
#define _COG1ASD1_AS5E_POSN                                 0x5
#define _COG1ASD1_AS5E_POSITION                             0x5
#define _COG1ASD1_AS5E_SIZE                                 0x1
#define _COG1ASD1_AS5E_LENGTH                               0x1
#define _COG1ASD1_AS5E_MASK                                 0x20
#define _COG1ASD1_AS6E_POSN                                 0x6
#define _COG1ASD1_AS6E_POSITION                             0x6
#define _COG1ASD1_AS6E_SIZE                                 0x1
#define _COG1ASD1_AS6E_LENGTH                               0x1
#define _COG1ASD1_AS6E_MASK                                 0x40
#define _COG1ASD1_AS7E_POSN                                 0x7
#define _COG1ASD1_AS7E_POSITION                             0x7
#define _COG1ASD1_AS7E_SIZE                                 0x1
#define _COG1ASD1_AS7E_LENGTH                               0x1
#define _COG1ASD1_AS7E_MASK                                 0x80
#define _COG1ASD1_G1AS0E_POSN                               0x0
#define _COG1ASD1_G1AS0E_POSITION                           0x0
#define _COG1ASD1_G1AS0E_SIZE                               0x1
#define _COG1ASD1_G1AS0E_LENGTH                             0x1
#define _COG1ASD1_G1AS0E_MASK                               0x1
#define _COG1ASD1_G1AS1E_POSN                               0x1
#define _COG1ASD1_G1AS1E_POSITION                           0x1
#define _COG1ASD1_G1AS1E_SIZE                               0x1
#define _COG1ASD1_G1AS1E_LENGTH                             0x1
#define _COG1ASD1_G1AS1E_MASK                               0x2
#define _COG1ASD1_G1AS2E_POSN                               0x2
#define _COG1ASD1_G1AS2E_POSITION                           0x2
#define _COG1ASD1_G1AS2E_SIZE                               0x1
#define _COG1ASD1_G1AS2E_LENGTH                             0x1
#define _COG1ASD1_G1AS2E_MASK                               0x4
#define _COG1ASD1_G1AS3E_POSN                               0x3
#define _COG1ASD1_G1AS3E_POSITION                           0x3
#define _COG1ASD1_G1AS3E_SIZE                               0x1
#define _COG1ASD1_G1AS3E_LENGTH                             0x1
#define _COG1ASD1_G1AS3E_MASK                               0x8
#define _COG1ASD1_G1AS4E_POSN                               0x4
#define _COG1ASD1_G1AS4E_POSITION                           0x4
#define _COG1ASD1_G1AS4E_SIZE                               0x1
#define _COG1ASD1_G1AS4E_LENGTH                             0x1
#define _COG1ASD1_G1AS4E_MASK                               0x10
#define _COG1ASD1_G1AS5E_POSN                               0x5
#define _COG1ASD1_G1AS5E_POSITION                           0x5
#define _COG1ASD1_G1AS5E_SIZE                               0x1
#define _COG1ASD1_G1AS5E_LENGTH                             0x1
#define _COG1ASD1_G1AS5E_MASK                               0x20
#define _COG1ASD1_G1AS6E_POSN                               0x6
#define _COG1ASD1_G1AS6E_POSITION                           0x6
#define _COG1ASD1_G1AS6E_SIZE                               0x1
#define _COG1ASD1_G1AS6E_LENGTH                             0x1
#define _COG1ASD1_G1AS6E_MASK                               0x40
#define _COG1ASD1_G1AS7E_POSN                               0x7
#define _COG1ASD1_G1AS7E_POSITION                           0x7
#define _COG1ASD1_G1AS7E_SIZE                               0x1
#define _COG1ASD1_G1AS7E_LENGTH                             0x1
#define _COG1ASD1_G1AS7E_MASK                               0x80

// Register: COG1STR
#define COG1STR COG1STR
extern volatile unsigned char           COG1STR             __at(0x69F);
#ifndef _LIB_BUILD
asm("COG1STR equ 069Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STRA                   :1;
        unsigned STRB                   :1;
        unsigned STRC                   :1;
        unsigned STRD                   :1;
        unsigned SDATA                  :1;
        unsigned SDATB                  :1;
        unsigned SDATC                  :1;
        unsigned SDATD                  :1;
    };
    struct {
        unsigned G1STRA                 :1;
        unsigned G1STRB                 :1;
        unsigned G1STRC                 :1;
        unsigned G1STRD                 :1;
        unsigned G1SDATA                :1;
        unsigned G1SDATB                :1;
        unsigned G1SDATC                :1;
        unsigned G1SDATD                :1;
    };
} COG1STRbits_t;
extern volatile COG1STRbits_t COG1STRbits __at(0x69F);
// bitfield macros
#define _COG1STR_STRA_POSN                                  0x0
#define _COG1STR_STRA_POSITION                              0x0
#define _COG1STR_STRA_SIZE                                  0x1
#define _COG1STR_STRA_LENGTH                                0x1
#define _COG1STR_STRA_MASK                                  0x1
#define _COG1STR_STRB_POSN                                  0x1
#define _COG1STR_STRB_POSITION                              0x1
#define _COG1STR_STRB_SIZE                                  0x1
#define _COG1STR_STRB_LENGTH                                0x1
#define _COG1STR_STRB_MASK                                  0x2
#define _COG1STR_STRC_POSN                                  0x2
#define _COG1STR_STRC_POSITION                              0x2
#define _COG1STR_STRC_SIZE                                  0x1
#define _COG1STR_STRC_LENGTH                                0x1
#define _COG1STR_STRC_MASK                                  0x4
#define _COG1STR_STRD_POSN                                  0x3
#define _COG1STR_STRD_POSITION                              0x3
#define _COG1STR_STRD_SIZE                                  0x1
#define _COG1STR_STRD_LENGTH                                0x1
#define _COG1STR_STRD_MASK                                  0x8
#define _COG1STR_SDATA_POSN                                 0x4
#define _COG1STR_SDATA_POSITION                             0x4
#define _COG1STR_SDATA_SIZE                                 0x1
#define _COG1STR_SDATA_LENGTH                               0x1
#define _COG1STR_SDATA_MASK                                 0x10
#define _COG1STR_SDATB_POSN                                 0x5
#define _COG1STR_SDATB_POSITION                             0x5
#define _COG1STR_SDATB_SIZE                                 0x1
#define _COG1STR_SDATB_LENGTH                               0x1
#define _COG1STR_SDATB_MASK                                 0x20
#define _COG1STR_SDATC_POSN                                 0x6
#define _COG1STR_SDATC_POSITION                             0x6
#define _COG1STR_SDATC_SIZE                                 0x1
#define _COG1STR_SDATC_LENGTH                               0x1
#define _COG1STR_SDATC_MASK                                 0x40
#define _COG1STR_SDATD_POSN                                 0x7
#define _COG1STR_SDATD_POSITION                             0x7
#define _COG1STR_SDATD_SIZE                                 0x1
#define _COG1STR_SDATD_LENGTH                               0x1
#define _COG1STR_SDATD_MASK                                 0x80
#define _COG1STR_G1STRA_POSN                                0x0
#define _COG1STR_G1STRA_POSITION                            0x0
#define _COG1STR_G1STRA_SIZE                                0x1
#define _COG1STR_G1STRA_LENGTH                              0x1
#define _COG1STR_G1STRA_MASK                                0x1
#define _COG1STR_G1STRB_POSN                                0x1
#define _COG1STR_G1STRB_POSITION                            0x1
#define _COG1STR_G1STRB_SIZE                                0x1
#define _COG1STR_G1STRB_LENGTH                              0x1
#define _COG1STR_G1STRB_MASK                                0x2
#define _COG1STR_G1STRC_POSN                                0x2
#define _COG1STR_G1STRC_POSITION                            0x2
#define _COG1STR_G1STRC_SIZE                                0x1
#define _COG1STR_G1STRC_LENGTH                              0x1
#define _COG1STR_G1STRC_MASK                                0x4
#define _COG1STR_G1STRD_POSN                                0x3
#define _COG1STR_G1STRD_POSITION                            0x3
#define _COG1STR_G1STRD_SIZE                                0x1
#define _COG1STR_G1STRD_LENGTH                              0x1
#define _COG1STR_G1STRD_MASK                                0x8
#define _COG1STR_G1SDATA_POSN                               0x4
#define _COG1STR_G1SDATA_POSITION                           0x4
#define _COG1STR_G1SDATA_SIZE                               0x1
#define _COG1STR_G1SDATA_LENGTH                             0x1
#define _COG1STR_G1SDATA_MASK                               0x10
#define _COG1STR_G1SDATB_POSN                               0x5
#define _COG1STR_G1SDATB_POSITION                           0x5
#define _COG1STR_G1SDATB_SIZE                               0x1
#define _COG1STR_G1SDATB_LENGTH                             0x1
#define _COG1STR_G1SDATB_MASK                               0x20
#define _COG1STR_G1SDATC_POSN                               0x6
#define _COG1STR_G1SDATC_POSITION                           0x6
#define _COG1STR_G1SDATC_SIZE                               0x1
#define _COG1STR_G1SDATC_LENGTH                             0x1
#define _COG1STR_G1SDATC_MASK                               0x40
#define _COG1STR_G1SDATD_POSN                               0x7
#define _COG1STR_G1SDATD_POSITION                           0x7
#define _COG1STR_G1SDATD_SIZE                               0x1
#define _COG1STR_G1SDATD_LENGTH                             0x1
#define _COG1STR_G1SDATD_MASK                               0x80

// Register: COG2PHR
#define COG2PHR COG2PHR
extern volatile unsigned char           COG2PHR             __at(0x70D);
#ifndef _LIB_BUILD
asm("COG2PHR equ 070Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PHR                    :6;
    };
    struct {
        unsigned PHR0                   :1;
        unsigned PHR1                   :1;
        unsigned PHR2                   :1;
        unsigned PHR3                   :1;
        unsigned PHR4                   :1;
        unsigned PHR5                   :1;
    };
    struct {
        unsigned G2PHR0                 :1;
        unsigned G2PHR1                 :1;
        unsigned G2PHR2                 :1;
        unsigned G2PHR3                 :1;
        unsigned G2PHR4                 :1;
        unsigned G2PHR5                 :1;
    };
} COG2PHRbits_t;
extern volatile COG2PHRbits_t COG2PHRbits __at(0x70D);
// bitfield macros
#define _COG2PHR_PHR_POSN                                   0x0
#define _COG2PHR_PHR_POSITION                               0x0
#define _COG2PHR_PHR_SIZE                                   0x6
#define _COG2PHR_PHR_LENGTH                                 0x6
#define _COG2PHR_PHR_MASK                                   0x3F
#define _COG2PHR_PHR0_POSN                                  0x0
#define _COG2PHR_PHR0_POSITION                              0x0
#define _COG2PHR_PHR0_SIZE                                  0x1
#define _COG2PHR_PHR0_LENGTH                                0x1
#define _COG2PHR_PHR0_MASK                                  0x1
#define _COG2PHR_PHR1_POSN                                  0x1
#define _COG2PHR_PHR1_POSITION                              0x1
#define _COG2PHR_PHR1_SIZE                                  0x1
#define _COG2PHR_PHR1_LENGTH                                0x1
#define _COG2PHR_PHR1_MASK                                  0x2
#define _COG2PHR_PHR2_POSN                                  0x2
#define _COG2PHR_PHR2_POSITION                              0x2
#define _COG2PHR_PHR2_SIZE                                  0x1
#define _COG2PHR_PHR2_LENGTH                                0x1
#define _COG2PHR_PHR2_MASK                                  0x4
#define _COG2PHR_PHR3_POSN                                  0x3
#define _COG2PHR_PHR3_POSITION                              0x3
#define _COG2PHR_PHR3_SIZE                                  0x1
#define _COG2PHR_PHR3_LENGTH                                0x1
#define _COG2PHR_PHR3_MASK                                  0x8
#define _COG2PHR_PHR4_POSN                                  0x4
#define _COG2PHR_PHR4_POSITION                              0x4
#define _COG2PHR_PHR4_SIZE                                  0x1
#define _COG2PHR_PHR4_LENGTH                                0x1
#define _COG2PHR_PHR4_MASK                                  0x10
#define _COG2PHR_PHR5_POSN                                  0x5
#define _COG2PHR_PHR5_POSITION                              0x5
#define _COG2PHR_PHR5_SIZE                                  0x1
#define _COG2PHR_PHR5_LENGTH                                0x1
#define _COG2PHR_PHR5_MASK                                  0x20
#define _COG2PHR_G2PHR0_POSN                                0x0
#define _COG2PHR_G2PHR0_POSITION                            0x0
#define _COG2PHR_G2PHR0_SIZE                                0x1
#define _COG2PHR_G2PHR0_LENGTH                              0x1
#define _COG2PHR_G2PHR0_MASK                                0x1
#define _COG2PHR_G2PHR1_POSN                                0x1
#define _COG2PHR_G2PHR1_POSITION                            0x1
#define _COG2PHR_G2PHR1_SIZE                                0x1
#define _COG2PHR_G2PHR1_LENGTH                              0x1
#define _COG2PHR_G2PHR1_MASK                                0x2
#define _COG2PHR_G2PHR2_POSN                                0x2
#define _COG2PHR_G2PHR2_POSITION                            0x2
#define _COG2PHR_G2PHR2_SIZE                                0x1
#define _COG2PHR_G2PHR2_LENGTH                              0x1
#define _COG2PHR_G2PHR2_MASK                                0x4
#define _COG2PHR_G2PHR3_POSN                                0x3
#define _COG2PHR_G2PHR3_POSITION                            0x3
#define _COG2PHR_G2PHR3_SIZE                                0x1
#define _COG2PHR_G2PHR3_LENGTH                              0x1
#define _COG2PHR_G2PHR3_MASK                                0x8
#define _COG2PHR_G2PHR4_POSN                                0x4
#define _COG2PHR_G2PHR4_POSITION                            0x4
#define _COG2PHR_G2PHR4_SIZE                                0x1
#define _COG2PHR_G2PHR4_LENGTH                              0x1
#define _COG2PHR_G2PHR4_MASK                                0x10
#define _COG2PHR_G2PHR5_POSN                                0x5
#define _COG2PHR_G2PHR5_POSITION                            0x5
#define _COG2PHR_G2PHR5_SIZE                                0x1
#define _COG2PHR_G2PHR5_LENGTH                              0x1
#define _COG2PHR_G2PHR5_MASK                                0x20

