MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1779/mcu.h
// Register: COG2PHF
#define COG2PHF COG2PHF
extern volatile unsigned char           COG2PHF             __at(0x70E);
#ifndef _LIB_BUILD
asm("COG2PHF equ 070Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PHF                    :6;
    };
    struct {
        unsigned PHF0                   :1;
        unsigned PHF1                   :1;
        unsigned PHF2                   :1;
        unsigned PHF3                   :1;
        unsigned PHF4                   :1;
        unsigned PHF5                   :1;
    };
    struct {
        unsigned G2PHF0                 :1;
        unsigned G2PHF1                 :1;
        unsigned G2PHF2                 :1;
        unsigned G2PHF3                 :1;
        unsigned G2PHF4                 :1;
        unsigned G2PHF5                 :1;
    };
} COG2PHFbits_t;
extern volatile COG2PHFbits_t COG2PHFbits __at(0x70E);
// bitfield macros
#define _COG2PHF_PHF_POSN                                   0x0
#define _COG2PHF_PHF_POSITION                               0x0
#define _COG2PHF_PHF_SIZE                                   0x6
#define _COG2PHF_PHF_LENGTH                                 0x6
#define _COG2PHF_PHF_MASK                                   0x3F
#define _COG2PHF_PHF0_POSN                                  0x0
#define _COG2PHF_PHF0_POSITION                              0x0
#define _COG2PHF_PHF0_SIZE                                  0x1
#define _COG2PHF_PHF0_LENGTH                                0x1
#define _COG2PHF_PHF0_MASK                                  0x1
#define _COG2PHF_PHF1_POSN                                  0x1
#define _COG2PHF_PHF1_POSITION                              0x1
#define _COG2PHF_PHF1_SIZE                                  0x1
#define _COG2PHF_PHF1_LENGTH                                0x1
#define _COG2PHF_PHF1_MASK                                  0x2
#define _COG2PHF_PHF2_POSN                                  0x2
#define _COG2PHF_PHF2_POSITION                              0x2
#define _COG2PHF_PHF2_SIZE                                  0x1
#define _COG2PHF_PHF2_LENGTH                                0x1
#define _COG2PHF_PHF2_MASK                                  0x4
#define _COG2PHF_PHF3_POSN                                  0x3
#define _COG2PHF_PHF3_POSITION                              0x3
#define _COG2PHF_PHF3_SIZE                                  0x1
#define _COG2PHF_PHF3_LENGTH                                0x1
#define _COG2PHF_PHF3_MASK                                  0x8
#define _COG2PHF_PHF4_POSN                                  0x4
#define _COG2PHF_PHF4_POSITION                              0x4
#define _COG2PHF_PHF4_SIZE                                  0x1
#define _COG2PHF_PHF4_LENGTH                                0x1
#define _COG2PHF_PHF4_MASK                                  0x10
#define _COG2PHF_PHF5_POSN                                  0x5
#define _COG2PHF_PHF5_POSITION                              0x5
#define _COG2PHF_PHF5_SIZE                                  0x1
#define _COG2PHF_PHF5_LENGTH                                0x1
#define _COG2PHF_PHF5_MASK                                  0x20
#define _COG2PHF_G2PHF0_POSN                                0x0
#define _COG2PHF_G2PHF0_POSITION                            0x0
#define _COG2PHF_G2PHF0_SIZE                                0x1
#define _COG2PHF_G2PHF0_LENGTH                              0x1
#define _COG2PHF_G2PHF0_MASK                                0x1
#define _COG2PHF_G2PHF1_POSN                                0x1
#define _COG2PHF_G2PHF1_POSITION                            0x1
#define _COG2PHF_G2PHF1_SIZE                                0x1
#define _COG2PHF_G2PHF1_LENGTH                              0x1
#define _COG2PHF_G2PHF1_MASK                                0x2
#define _COG2PHF_G2PHF2_POSN                                0x2
#define _COG2PHF_G2PHF2_POSITION                            0x2
#define _COG2PHF_G2PHF2_SIZE                                0x1
#define _COG2PHF_G2PHF2_LENGTH                              0x1
#define _COG2PHF_G2PHF2_MASK                                0x4
#define _COG2PHF_G2PHF3_POSN                                0x3
#define _COG2PHF_G2PHF3_POSITION                            0x3
#define _COG2PHF_G2PHF3_SIZE                                0x1
#define _COG2PHF_G2PHF3_LENGTH                              0x1
#define _COG2PHF_G2PHF3_MASK                                0x8
#define _COG2PHF_G2PHF4_POSN                                0x4
#define _COG2PHF_G2PHF4_POSITION                            0x4
#define _COG2PHF_G2PHF4_SIZE                                0x1
#define _COG2PHF_G2PHF4_LENGTH                              0x1
#define _COG2PHF_G2PHF4_MASK                                0x10
#define _COG2PHF_G2PHF5_POSN                                0x5
#define _COG2PHF_G2PHF5_POSITION                            0x5
#define _COG2PHF_G2PHF5_SIZE                                0x1
#define _COG2PHF_G2PHF5_LENGTH                              0x1
#define _COG2PHF_G2PHF5_MASK                                0x20

// Register: COG2BLKR
#define COG2BLKR COG2BLKR
extern volatile unsigned char           COG2BLKR            __at(0x70F);
#ifndef _LIB_BUILD
asm("COG2BLKR equ 070Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BLKR                   :6;
    };
    struct {
        unsigned BLKR0                  :1;
        unsigned BLKR1                  :1;
        unsigned BLKR2                  :1;
        unsigned BLKR3                  :1;
        unsigned BLKR4                  :1;
        unsigned BLKR5                  :1;
    };
    struct {
        unsigned G2BLKR0                :1;
        unsigned G2BLKR1                :1;
        unsigned G2BLKR2                :1;
        unsigned G2BLKR3                :1;
        unsigned G2BLKR4                :1;
        unsigned G2BLKR5                :1;
    };
} COG2BLKRbits_t;
extern volatile COG2BLKRbits_t COG2BLKRbits __at(0x70F);
// bitfield macros
#define _COG2BLKR_BLKR_POSN                                 0x0
#define _COG2BLKR_BLKR_POSITION                             0x0
#define _COG2BLKR_BLKR_SIZE                                 0x6
#define _COG2BLKR_BLKR_LENGTH                               0x6
#define _COG2BLKR_BLKR_MASK                                 0x3F
#define _COG2BLKR_BLKR0_POSN                                0x0
#define _COG2BLKR_BLKR0_POSITION                            0x0
#define _COG2BLKR_BLKR0_SIZE                                0x1
#define _COG2BLKR_BLKR0_LENGTH                              0x1
#define _COG2BLKR_BLKR0_MASK                                0x1
#define _COG2BLKR_BLKR1_POSN                                0x1
#define _COG2BLKR_BLKR1_POSITION                            0x1
#define _COG2BLKR_BLKR1_SIZE                                0x1
#define _COG2BLKR_BLKR1_LENGTH                              0x1
#define _COG2BLKR_BLKR1_MASK                                0x2
#define _COG2BLKR_BLKR2_POSN                                0x2
#define _COG2BLKR_BLKR2_POSITION                            0x2
#define _COG2BLKR_BLKR2_SIZE                                0x1
#define _COG2BLKR_BLKR2_LENGTH                              0x1
#define _COG2BLKR_BLKR2_MASK                                0x4
#define _COG2BLKR_BLKR3_POSN                                0x3
#define _COG2BLKR_BLKR3_POSITION                            0x3
#define _COG2BLKR_BLKR3_SIZE                                0x1
#define _COG2BLKR_BLKR3_LENGTH                              0x1
#define _COG2BLKR_BLKR3_MASK                                0x8
#define _COG2BLKR_BLKR4_POSN                                0x4
#define _COG2BLKR_BLKR4_POSITION                            0x4
#define _COG2BLKR_BLKR4_SIZE                                0x1
#define _COG2BLKR_BLKR4_LENGTH                              0x1
#define _COG2BLKR_BLKR4_MASK                                0x10
#define _COG2BLKR_BLKR5_POSN                                0x5
#define _COG2BLKR_BLKR5_POSITION                            0x5
#define _COG2BLKR_BLKR5_SIZE                                0x1
#define _COG2BLKR_BLKR5_LENGTH                              0x1
#define _COG2BLKR_BLKR5_MASK                                0x20
#define _COG2BLKR_G2BLKR0_POSN                              0x0
#define _COG2BLKR_G2BLKR0_POSITION                          0x0
#define _COG2BLKR_G2BLKR0_SIZE                              0x1
#define _COG2BLKR_G2BLKR0_LENGTH                            0x1
#define _COG2BLKR_G2BLKR0_MASK                              0x1
#define _COG2BLKR_G2BLKR1_POSN                              0x1
#define _COG2BLKR_G2BLKR1_POSITION                          0x1
#define _COG2BLKR_G2BLKR1_SIZE                              0x1
#define _COG2BLKR_G2BLKR1_LENGTH                            0x1
#define _COG2BLKR_G2BLKR1_MASK                              0x2
#define _COG2BLKR_G2BLKR2_POSN                              0x2
#define _COG2BLKR_G2BLKR2_POSITION                          0x2
#define _COG2BLKR_G2BLKR2_SIZE                              0x1
#define _COG2BLKR_G2BLKR2_LENGTH                            0x1
#define _COG2BLKR_G2BLKR2_MASK                              0x4
#define _COG2BLKR_G2BLKR3_POSN                              0x3
#define _COG2BLKR_G2BLKR3_POSITION                          0x3
#define _COG2BLKR_G2BLKR3_SIZE                              0x1
#define _COG2BLKR_G2BLKR3_LENGTH                            0x1
#define _COG2BLKR_G2BLKR3_MASK                              0x8
#define _COG2BLKR_G2BLKR4_POSN                              0x4
#define _COG2BLKR_G2BLKR4_POSITION                          0x4
#define _COG2BLKR_G2BLKR4_SIZE                              0x1
#define _COG2BLKR_G2BLKR4_LENGTH                            0x1
#define _COG2BLKR_G2BLKR4_MASK                              0x10
#define _COG2BLKR_G2BLKR5_POSN                              0x5
#define _COG2BLKR_G2BLKR5_POSITION                          0x5
#define _COG2BLKR_G2BLKR5_SIZE                              0x1
#define _COG2BLKR_G2BLKR5_LENGTH                            0x1
#define _COG2BLKR_G2BLKR5_MASK                              0x20

// Register: COG2BLKF
#define COG2BLKF COG2BLKF
extern volatile unsigned char           COG2BLKF            __at(0x710);
#ifndef _LIB_BUILD
asm("COG2BLKF equ 0710h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BLKF                   :6;
    };
    struct {
        unsigned BLKF0                  :1;
        unsigned BLKF1                  :1;
        unsigned BLKF2                  :1;
        unsigned BLKF3                  :1;
        unsigned BLKF4                  :1;
        unsigned BLKF5                  :1;
    };
    struct {
        unsigned G2BLKF0                :1;
        unsigned G2BLKF1                :1;
        unsigned G2BLKF2                :1;
        unsigned G2BLKF3                :1;
        unsigned G2BLKF4                :1;
        unsigned G2BLKF5                :1;
    };
} COG2BLKFbits_t;
extern volatile COG2BLKFbits_t COG2BLKFbits __at(0x710);
// bitfield macros
#define _COG2BLKF_BLKF_POSN                                 0x0
#define _COG2BLKF_BLKF_POSITION                             0x0
#define _COG2BLKF_BLKF_SIZE                                 0x6
#define _COG2BLKF_BLKF_LENGTH                               0x6
#define _COG2BLKF_BLKF_MASK                                 0x3F
#define _COG2BLKF_BLKF0_POSN                                0x0
#define _COG2BLKF_BLKF0_POSITION                            0x0
#define _COG2BLKF_BLKF0_SIZE                                0x1
#define _COG2BLKF_BLKF0_LENGTH                              0x1
#define _COG2BLKF_BLKF0_MASK                                0x1
#define _COG2BLKF_BLKF1_POSN                                0x1
#define _COG2BLKF_BLKF1_POSITION                            0x1
#define _COG2BLKF_BLKF1_SIZE                                0x1
#define _COG2BLKF_BLKF1_LENGTH                              0x1
#define _COG2BLKF_BLKF1_MASK                                0x2
#define _COG2BLKF_BLKF2_POSN                                0x2
#define _COG2BLKF_BLKF2_POSITION                            0x2
#define _COG2BLKF_BLKF2_SIZE                                0x1
#define _COG2BLKF_BLKF2_LENGTH                              0x1
#define _COG2BLKF_BLKF2_MASK                                0x4
#define _COG2BLKF_BLKF3_POSN                                0x3
#define _COG2BLKF_BLKF3_POSITION                            0x3
#define _COG2BLKF_BLKF3_SIZE                                0x1
#define _COG2BLKF_BLKF3_LENGTH                              0x1
#define _COG2BLKF_BLKF3_MASK                                0x8
#define _COG2BLKF_BLKF4_POSN                                0x4
#define _COG2BLKF_BLKF4_POSITION                            0x4
#define _COG2BLKF_BLKF4_SIZE                                0x1
#define _COG2BLKF_BLKF4_LENGTH                              0x1
#define _COG2BLKF_BLKF4_MASK                                0x10
#define _COG2BLKF_BLKF5_POSN                                0x5
#define _COG2BLKF_BLKF5_POSITION                            0x5
#define _COG2BLKF_BLKF5_SIZE                                0x1
#define _COG2BLKF_BLKF5_LENGTH                              0x1
#define _COG2BLKF_BLKF5_MASK                                0x20
#define _COG2BLKF_G2BLKF0_POSN                              0x0
#define _COG2BLKF_G2BLKF0_POSITION                          0x0
#define _COG2BLKF_G2BLKF0_SIZE                              0x1
#define _COG2BLKF_G2BLKF0_LENGTH                            0x1
#define _COG2BLKF_G2BLKF0_MASK                              0x1
#define _COG2BLKF_G2BLKF1_POSN                              0x1
#define _COG2BLKF_G2BLKF1_POSITION                          0x1
#define _COG2BLKF_G2BLKF1_SIZE                              0x1
#define _COG2BLKF_G2BLKF1_LENGTH                            0x1
#define _COG2BLKF_G2BLKF1_MASK                              0x2
#define _COG2BLKF_G2BLKF2_POSN                              0x2
#define _COG2BLKF_G2BLKF2_POSITION                          0x2
#define _COG2BLKF_G2BLKF2_SIZE                              0x1
#define _COG2BLKF_G2BLKF2_LENGTH                            0x1
#define _COG2BLKF_G2BLKF2_MASK                              0x4
#define _COG2BLKF_G2BLKF3_POSN                              0x3
#define _COG2BLKF_G2BLKF3_POSITION                          0x3
#define _COG2BLKF_G2BLKF3_SIZE                              0x1
#define _COG2BLKF_G2BLKF3_LENGTH                            0x1
#define _COG2BLKF_G2BLKF3_MASK                              0x8
#define _COG2BLKF_G2BLKF4_POSN                              0x4
#define _COG2BLKF_G2BLKF4_POSITION                          0x4
#define _COG2BLKF_G2BLKF4_SIZE                              0x1
#define _COG2BLKF_G2BLKF4_LENGTH                            0x1
#define _COG2BLKF_G2BLKF4_MASK                              0x10
#define _COG2BLKF_G2BLKF5_POSN                              0x5
#define _COG2BLKF_G2BLKF5_POSITION                          0x5
#define _COG2BLKF_G2BLKF5_SIZE                              0x1
#define _COG2BLKF_G2BLKF5_LENGTH                            0x1
#define _COG2BLKF_G2BLKF5_MASK                              0x20

// Register: COG2DBR
#define COG2DBR COG2DBR
extern volatile unsigned char           COG2DBR             __at(0x711);
#ifndef _LIB_BUILD
asm("COG2DBR equ 0711h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DBR                    :6;
    };
    struct {
        unsigned DBR0                   :1;
        unsigned DBR1                   :1;
        unsigned DBR2                   :1;
        unsigned DBR3                   :1;
        unsigned DBR4                   :1;
        unsigned DBR5                   :1;
    };
    struct {
        unsigned G2DBR0                 :1;
        unsigned G2DBR1                 :1;
        unsigned G2DBR2                 :1;
        unsigned G2DBR3                 :1;
        unsigned G2DBR4                 :1;
        unsigned G2DBR5                 :1;
    };
} COG2DBRbits_t;
extern volatile COG2DBRbits_t COG2DBRbits __at(0x711);
// bitfield macros
#define _COG2DBR_DBR_POSN                                   0x0
#define _COG2DBR_DBR_POSITION                               0x0
#define _COG2DBR_DBR_SIZE                                   0x6
#define _COG2DBR_DBR_LENGTH                                 0x6
#define _COG2DBR_DBR_MASK                                   0x3F
#define _COG2DBR_DBR0_POSN                                  0x0
#define _COG2DBR_DBR0_POSITION                              0x0
#define _COG2DBR_DBR0_SIZE                                  0x1
#define _COG2DBR_DBR0_LENGTH                                0x1
#define _COG2DBR_DBR0_MASK                                  0x1
#define _COG2DBR_DBR1_POSN                                  0x1
#define _COG2DBR_DBR1_POSITION                              0x1
#define _COG2DBR_DBR1_SIZE                                  0x1
#define _COG2DBR_DBR1_LENGTH                                0x1
#define _COG2DBR_DBR1_MASK                                  0x2
#define _COG2DBR_DBR2_POSN                                  0x2
#define _COG2DBR_DBR2_POSITION                              0x2
#define _COG2DBR_DBR2_SIZE                                  0x1
#define _COG2DBR_DBR2_LENGTH                                0x1
#define _COG2DBR_DBR2_MASK                                  0x4
#define _COG2DBR_DBR3_POSN                                  0x3
#define _COG2DBR_DBR3_POSITION                              0x3
#define _COG2DBR_DBR3_SIZE                                  0x1
#define _COG2DBR_DBR3_LENGTH                                0x1
#define _COG2DBR_DBR3_MASK                                  0x8
#define _COG2DBR_DBR4_POSN                                  0x4
#define _COG2DBR_DBR4_POSITION                              0x4
#define _COG2DBR_DBR4_SIZE                                  0x1
#define _COG2DBR_DBR4_LENGTH                                0x1
#define _COG2DBR_DBR4_MASK                                  0x10
#define _COG2DBR_DBR5_POSN                                  0x5
#define _COG2DBR_DBR5_POSITION                              0x5
#define _COG2DBR_DBR5_SIZE                                  0x1
#define _COG2DBR_DBR5_LENGTH                                0x1
#define _COG2DBR_DBR5_MASK                                  0x20
#define _COG2DBR_G2DBR0_POSN                                0x0
#define _COG2DBR_G2DBR0_POSITION                            0x0
#define _COG2DBR_G2DBR0_SIZE                                0x1
#define _COG2DBR_G2DBR0_LENGTH                              0x1
#define _COG2DBR_G2DBR0_MASK                                0x1
#define _COG2DBR_G2DBR1_POSN                                0x1
#define _COG2DBR_G2DBR1_POSITION                            0x1
#define _COG2DBR_G2DBR1_SIZE                                0x1
#define _COG2DBR_G2DBR1_LENGTH                              0x1
#define _COG2DBR_G2DBR1_MASK                                0x2
#define _COG2DBR_G2DBR2_POSN                                0x2
#define _COG2DBR_G2DBR2_POSITION                            0x2
#define _COG2DBR_G2DBR2_SIZE                                0x1
#define _COG2DBR_G2DBR2_LENGTH                              0x1
#define _COG2DBR_G2DBR2_MASK                                0x4
#define _COG2DBR_G2DBR3_POSN                                0x3
#define _COG2DBR_G2DBR3_POSITION                            0x3
#define _COG2DBR_G2DBR3_SIZE                                0x1
#define _COG2DBR_G2DBR3_LENGTH                              0x1
#define _COG2DBR_G2DBR3_MASK                                0x8
#define _COG2DBR_G2DBR4_POSN                                0x4
#define _COG2DBR_G2DBR4_POSITION                            0x4
#define _COG2DBR_G2DBR4_SIZE                                0x1
#define _COG2DBR_G2DBR4_LENGTH                              0x1
#define _COG2DBR_G2DBR4_MASK                                0x10
#define _COG2DBR_G2DBR5_POSN                                0x5
#define _COG2DBR_G2DBR5_POSITION                            0x5
#define _COG2DBR_G2DBR5_SIZE                                0x1
#define _COG2DBR_G2DBR5_LENGTH                              0x1
#define _COG2DBR_G2DBR5_MASK                                0x20

// Register: COG2DBF
#define COG2DBF COG2DBF
extern volatile unsigned char           COG2DBF             __at(0x712);
#ifndef _LIB_BUILD
asm("COG2DBF equ 0712h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DBF0                   :1;
        unsigned DBF1                   :1;
        unsigned DBF2                   :1;
        unsigned DBF3                   :1;
        unsigned DBF4                   :1;
        unsigned DBF5                   :1;
    };
    struct {
        unsigned G2DBF0                 :1;
        unsigned G2DBF1                 :1;
        unsigned G2DBF2                 :1;
        unsigned G2DBF3                 :1;
        unsigned G2DBF4                 :1;
        unsigned G2DBF5                 :1;
    };
    struct {
        unsigned G2DBF                  :6;
    };
} COG2DBFbits_t;
