MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1779/mcu.h
extern volatile COG2FSIM0bits_t COG2FSIM0bits __at(0x71B);
// bitfield macros
#define _COG2FSIM0_FSIM0_POSN                               0x0
#define _COG2FSIM0_FSIM0_POSITION                           0x0
#define _COG2FSIM0_FSIM0_SIZE                               0x1
#define _COG2FSIM0_FSIM0_LENGTH                             0x1
#define _COG2FSIM0_FSIM0_MASK                               0x1
#define _COG2FSIM0_FSIM1_POSN                               0x1
#define _COG2FSIM0_FSIM1_POSITION                           0x1
#define _COG2FSIM0_FSIM1_SIZE                               0x1
#define _COG2FSIM0_FSIM1_LENGTH                             0x1
#define _COG2FSIM0_FSIM1_MASK                               0x2
#define _COG2FSIM0_FSIM2_POSN                               0x2
#define _COG2FSIM0_FSIM2_POSITION                           0x2
#define _COG2FSIM0_FSIM2_SIZE                               0x1
#define _COG2FSIM0_FSIM2_LENGTH                             0x1
#define _COG2FSIM0_FSIM2_MASK                               0x4
#define _COG2FSIM0_FSIM3_POSN                               0x3
#define _COG2FSIM0_FSIM3_POSITION                           0x3
#define _COG2FSIM0_FSIM3_SIZE                               0x1
#define _COG2FSIM0_FSIM3_LENGTH                             0x1
#define _COG2FSIM0_FSIM3_MASK                               0x8
#define _COG2FSIM0_FSIM4_POSN                               0x4
#define _COG2FSIM0_FSIM4_POSITION                           0x4
#define _COG2FSIM0_FSIM4_SIZE                               0x1
#define _COG2FSIM0_FSIM4_LENGTH                             0x1
#define _COG2FSIM0_FSIM4_MASK                               0x10
#define _COG2FSIM0_FSIM5_POSN                               0x5
#define _COG2FSIM0_FSIM5_POSITION                           0x5
#define _COG2FSIM0_FSIM5_SIZE                               0x1
#define _COG2FSIM0_FSIM5_LENGTH                             0x1
#define _COG2FSIM0_FSIM5_MASK                               0x20
#define _COG2FSIM0_FSIM6_POSN                               0x6
#define _COG2FSIM0_FSIM6_POSITION                           0x6
#define _COG2FSIM0_FSIM6_SIZE                               0x1
#define _COG2FSIM0_FSIM6_LENGTH                             0x1
#define _COG2FSIM0_FSIM6_MASK                               0x40
#define _COG2FSIM0_FSIM7_POSN                               0x7
#define _COG2FSIM0_FSIM7_POSITION                           0x7
#define _COG2FSIM0_FSIM7_SIZE                               0x1
#define _COG2FSIM0_FSIM7_LENGTH                             0x1
#define _COG2FSIM0_FSIM7_MASK                               0x80
#define _COG2FSIM0_G2FSIM0_POSN                             0x0
#define _COG2FSIM0_G2FSIM0_POSITION                         0x0
#define _COG2FSIM0_G2FSIM0_SIZE                             0x1
#define _COG2FSIM0_G2FSIM0_LENGTH                           0x1
#define _COG2FSIM0_G2FSIM0_MASK                             0x1
#define _COG2FSIM0_G2FSIM1_POSN                             0x1
#define _COG2FSIM0_G2FSIM1_POSITION                         0x1
#define _COG2FSIM0_G2FSIM1_SIZE                             0x1
#define _COG2FSIM0_G2FSIM1_LENGTH                           0x1
#define _COG2FSIM0_G2FSIM1_MASK                             0x2
#define _COG2FSIM0_G2FSIM2_POSN                             0x2
#define _COG2FSIM0_G2FSIM2_POSITION                         0x2
#define _COG2FSIM0_G2FSIM2_SIZE                             0x1
#define _COG2FSIM0_G2FSIM2_LENGTH                           0x1
#define _COG2FSIM0_G2FSIM2_MASK                             0x4
#define _COG2FSIM0_G2FSIM3_POSN                             0x3
#define _COG2FSIM0_G2FSIM3_POSITION                         0x3
#define _COG2FSIM0_G2FSIM3_SIZE                             0x1
#define _COG2FSIM0_G2FSIM3_LENGTH                           0x1
#define _COG2FSIM0_G2FSIM3_MASK                             0x8
#define _COG2FSIM0_G2FSIM4_POSN                             0x4
#define _COG2FSIM0_G2FSIM4_POSITION                         0x4
#define _COG2FSIM0_G2FSIM4_SIZE                             0x1
#define _COG2FSIM0_G2FSIM4_LENGTH                           0x1
#define _COG2FSIM0_G2FSIM4_MASK                             0x10
#define _COG2FSIM0_G2FSIM5_POSN                             0x5
#define _COG2FSIM0_G2FSIM5_POSITION                         0x5
#define _COG2FSIM0_G2FSIM5_SIZE                             0x1
#define _COG2FSIM0_G2FSIM5_LENGTH                           0x1
#define _COG2FSIM0_G2FSIM5_MASK                             0x20
#define _COG2FSIM0_G2FSIM6_POSN                             0x6
#define _COG2FSIM0_G2FSIM6_POSITION                         0x6
#define _COG2FSIM0_G2FSIM6_SIZE                             0x1
#define _COG2FSIM0_G2FSIM6_LENGTH                           0x1
#define _COG2FSIM0_G2FSIM6_MASK                             0x40
#define _COG2FSIM0_G2FSIM7_POSN                             0x7
#define _COG2FSIM0_G2FSIM7_POSITION                         0x7
#define _COG2FSIM0_G2FSIM7_SIZE                             0x1
#define _COG2FSIM0_G2FSIM7_LENGTH                           0x1
#define _COG2FSIM0_G2FSIM7_MASK                             0x80

// Register: COG2FSIM1
#define COG2FSIM1 COG2FSIM1
extern volatile unsigned char           COG2FSIM1           __at(0x71C);
#ifndef _LIB_BUILD
asm("COG2FSIM1 equ 071Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSIM8                  :1;
        unsigned FSIM9                  :1;
        unsigned FSIM10                 :1;
        unsigned FSIM11                 :1;
        unsigned FSIM12                 :1;
        unsigned FSIM13                 :1;
        unsigned FSIM14                 :1;
        unsigned FSIM15                 :1;
    };
    struct {
        unsigned G2FSIM8                :1;
        unsigned G2FSIM9                :1;
        unsigned G2FSIM10               :1;
        unsigned G2FSIM11               :1;
        unsigned G2FSIM12               :1;
        unsigned G2FSIM13               :1;
        unsigned G2FSIM14               :1;
        unsigned G2FSIM15               :1;
    };
} COG2FSIM1bits_t;
