MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1779/mcu.h
extern volatile MD4CON0bits_t MD4CON0bits __at(0xD1B);
// bitfield macros
#define _MD4CON0_BIT_POSN                                   0x0
#define _MD4CON0_BIT_POSITION                               0x0
#define _MD4CON0_BIT_SIZE                                   0x1
#define _MD4CON0_BIT_LENGTH                                 0x1
#define _MD4CON0_BIT_MASK                                   0x1
#define _MD4CON0_OPOL_POSN                                  0x4
#define _MD4CON0_OPOL_POSITION                              0x4
#define _MD4CON0_OPOL_SIZE                                  0x1
#define _MD4CON0_OPOL_LENGTH                                0x1
#define _MD4CON0_OPOL_MASK                                  0x10
#define _MD4CON0_OUT_POSN                                   0x5
#define _MD4CON0_OUT_POSITION                               0x5
#define _MD4CON0_OUT_SIZE                                   0x1
#define _MD4CON0_OUT_LENGTH                                 0x1
#define _MD4CON0_OUT_MASK                                   0x20
#define _MD4CON0_EN_POSN                                    0x7
#define _MD4CON0_EN_POSITION                                0x7
#define _MD4CON0_EN_SIZE                                    0x1
#define _MD4CON0_EN_LENGTH                                  0x1
#define _MD4CON0_EN_MASK                                    0x80
#define _MD4CON0_MD4BIT_POSN                                0x0
#define _MD4CON0_MD4BIT_POSITION                            0x0
#define _MD4CON0_MD4BIT_SIZE                                0x1
#define _MD4CON0_MD4BIT_LENGTH                              0x1
#define _MD4CON0_MD4BIT_MASK                                0x1
#define _MD4CON0_MD4OPOL_POSN                               0x4
#define _MD4CON0_MD4OPOL_POSITION                           0x4
#define _MD4CON0_MD4OPOL_SIZE                               0x1
#define _MD4CON0_MD4OPOL_LENGTH                             0x1
#define _MD4CON0_MD4OPOL_MASK                               0x10
#define _MD4CON0_MD4OUT_POSN                                0x5
#define _MD4CON0_MD4OUT_POSITION                            0x5
#define _MD4CON0_MD4OUT_SIZE                                0x1
#define _MD4CON0_MD4OUT_LENGTH                              0x1
#define _MD4CON0_MD4OUT_MASK                                0x20
#define _MD4CON0_MD4EN_POSN                                 0x7
#define _MD4CON0_MD4EN_POSITION                             0x7
#define _MD4CON0_MD4EN_SIZE                                 0x1
#define _MD4CON0_MD4EN_LENGTH                               0x1
#define _MD4CON0_MD4EN_MASK                                 0x80

// Register: MD4CON1
#define MD4CON1 MD4CON1
extern volatile unsigned char           MD4CON1             __at(0xD1C);
#ifndef _LIB_BUILD
asm("MD4CON1 equ 0D1Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLSYNC                 :1;
        unsigned CLPOL                  :1;
        unsigned                        :2;
        unsigned CHSYNC                 :1;
        unsigned CHPOL                  :1;
    };
    struct {
        unsigned MD4CLSYNC              :1;
        unsigned MD4CLPOL               :1;
        unsigned                        :2;
        unsigned MD4CHSYNC              :1;
        unsigned MD4CHPOL               :1;
    };
} MD4CON1bits_t;
extern volatile MD4CON1bits_t MD4CON1bits __at(0xD1C);
// bitfield macros
#define _MD4CON1_CLSYNC_POSN                                0x0
#define _MD4CON1_CLSYNC_POSITION                            0x0
#define _MD4CON1_CLSYNC_SIZE                                0x1
#define _MD4CON1_CLSYNC_LENGTH                              0x1
#define _MD4CON1_CLSYNC_MASK                                0x1
#define _MD4CON1_CLPOL_POSN                                 0x1
#define _MD4CON1_CLPOL_POSITION                             0x1
#define _MD4CON1_CLPOL_SIZE                                 0x1
#define _MD4CON1_CLPOL_LENGTH                               0x1
#define _MD4CON1_CLPOL_MASK                                 0x2
#define _MD4CON1_CHSYNC_POSN                                0x4
#define _MD4CON1_CHSYNC_POSITION                            0x4
#define _MD4CON1_CHSYNC_SIZE                                0x1
#define _MD4CON1_CHSYNC_LENGTH                              0x1
#define _MD4CON1_CHSYNC_MASK                                0x10
#define _MD4CON1_CHPOL_POSN                                 0x5
#define _MD4CON1_CHPOL_POSITION                             0x5
#define _MD4CON1_CHPOL_SIZE                                 0x1
#define _MD4CON1_CHPOL_LENGTH                               0x1
#define _MD4CON1_CHPOL_MASK                                 0x20
#define _MD4CON1_MD4CLSYNC_POSN                             0x0
#define _MD4CON1_MD4CLSYNC_POSITION                         0x0
#define _MD4CON1_MD4CLSYNC_SIZE                             0x1
#define _MD4CON1_MD4CLSYNC_LENGTH                           0x1
#define _MD4CON1_MD4CLSYNC_MASK                             0x1
#define _MD4CON1_MD4CLPOL_POSN                              0x1
#define _MD4CON1_MD4CLPOL_POSITION                          0x1
#define _MD4CON1_MD4CLPOL_SIZE                              0x1
#define _MD4CON1_MD4CLPOL_LENGTH                            0x1
#define _MD4CON1_MD4CLPOL_MASK                              0x2
#define _MD4CON1_MD4CHSYNC_POSN                             0x4
#define _MD4CON1_MD4CHSYNC_POSITION                         0x4
#define _MD4CON1_MD4CHSYNC_SIZE                             0x1
#define _MD4CON1_MD4CHSYNC_LENGTH                           0x1
#define _MD4CON1_MD4CHSYNC_MASK                             0x10
#define _MD4CON1_MD4CHPOL_POSN                              0x5
#define _MD4CON1_MD4CHPOL_POSITION                          0x5
#define _MD4CON1_MD4CHPOL_SIZE                              0x1
#define _MD4CON1_MD4CHPOL_LENGTH                            0x1
#define _MD4CON1_MD4CHPOL_MASK                              0x20

// Register: MD4SRC
#define MD4SRC MD4SRC
extern volatile unsigned char           MD4SRC              __at(0xD1D);
#ifndef _LIB_BUILD
asm("MD4SRC equ 0D1Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MS                     :5;
    };
    struct {
        unsigned MS0                    :1;
        unsigned MS1                    :1;
        unsigned MS2                    :1;
        unsigned MS3                    :1;
        unsigned MS4                    :1;
    };
    struct {
        unsigned MD4MS                  :5;
    };
    struct {
        unsigned MD4MS0                 :1;
        unsigned MD4MS1                 :1;
        unsigned MD4MS2                 :1;
        unsigned MD4MS3                 :1;
        unsigned MD4MS4                 :1;
    };
} MD4SRCbits_t;
extern volatile MD4SRCbits_t MD4SRCbits __at(0xD1D);
// bitfield macros
#define _MD4SRC_MS_POSN                                     0x0
#define _MD4SRC_MS_POSITION                                 0x0
#define _MD4SRC_MS_SIZE                                     0x5
#define _MD4SRC_MS_LENGTH                                   0x5
#define _MD4SRC_MS_MASK                                     0x1F
#define _MD4SRC_MS0_POSN                                    0x0
#define _MD4SRC_MS0_POSITION                                0x0
#define _MD4SRC_MS0_SIZE                                    0x1
#define _MD4SRC_MS0_LENGTH                                  0x1
#define _MD4SRC_MS0_MASK                                    0x1
#define _MD4SRC_MS1_POSN                                    0x1
#define _MD4SRC_MS1_POSITION                                0x1
#define _MD4SRC_MS1_SIZE                                    0x1
#define _MD4SRC_MS1_LENGTH                                  0x1
#define _MD4SRC_MS1_MASK                                    0x2
#define _MD4SRC_MS2_POSN                                    0x2
#define _MD4SRC_MS2_POSITION                                0x2
#define _MD4SRC_MS2_SIZE                                    0x1
#define _MD4SRC_MS2_LENGTH                                  0x1
#define _MD4SRC_MS2_MASK                                    0x4
#define _MD4SRC_MS3_POSN                                    0x3
#define _MD4SRC_MS3_POSITION                                0x3
#define _MD4SRC_MS3_SIZE                                    0x1
#define _MD4SRC_MS3_LENGTH                                  0x1
#define _MD4SRC_MS3_MASK                                    0x8
#define _MD4SRC_MS4_POSN                                    0x4
#define _MD4SRC_MS4_POSITION                                0x4
#define _MD4SRC_MS4_SIZE                                    0x1
#define _MD4SRC_MS4_LENGTH                                  0x1
#define _MD4SRC_MS4_MASK                                    0x10
#define _MD4SRC_MD4MS_POSN                                  0x0
#define _MD4SRC_MD4MS_POSITION                              0x0
#define _MD4SRC_MD4MS_SIZE                                  0x5
#define _MD4SRC_MD4MS_LENGTH                                0x5
#define _MD4SRC_MD4MS_MASK                                  0x1F
#define _MD4SRC_MD4MS0_POSN                                 0x0
#define _MD4SRC_MD4MS0_POSITION                             0x0
#define _MD4SRC_MD4MS0_SIZE                                 0x1
#define _MD4SRC_MD4MS0_LENGTH                               0x1
#define _MD4SRC_MD4MS0_MASK                                 0x1
#define _MD4SRC_MD4MS1_POSN                                 0x1
#define _MD4SRC_MD4MS1_POSITION                             0x1
#define _MD4SRC_MD4MS1_SIZE                                 0x1
#define _MD4SRC_MD4MS1_LENGTH                               0x1
#define _MD4SRC_MD4MS1_MASK                                 0x2
#define _MD4SRC_MD4MS2_POSN                                 0x2
#define _MD4SRC_MD4MS2_POSITION                             0x2
#define _MD4SRC_MD4MS2_SIZE                                 0x1
#define _MD4SRC_MD4MS2_LENGTH                               0x1
#define _MD4SRC_MD4MS2_MASK                                 0x4
#define _MD4SRC_MD4MS3_POSN                                 0x3
#define _MD4SRC_MD4MS3_POSITION                             0x3
#define _MD4SRC_MD4MS3_SIZE                                 0x1
#define _MD4SRC_MD4MS3_LENGTH                               0x1
#define _MD4SRC_MD4MS3_MASK                                 0x8
#define _MD4SRC_MD4MS4_POSN                                 0x4
#define _MD4SRC_MD4MS4_POSITION                             0x4
#define _MD4SRC_MD4MS4_SIZE                                 0x1
#define _MD4SRC_MD4MS4_LENGTH                               0x1
#define _MD4SRC_MD4MS4_MASK                                 0x10

// Register: MD4CARL
#define MD4CARL MD4CARL
extern volatile unsigned char           MD4CARL             __at(0xD1E);
#ifndef _LIB_BUILD
asm("MD4CARL equ 0D1Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CL                     :5;
    };
    struct {
        unsigned CL0                    :1;
        unsigned CL1                    :1;
        unsigned CL2                    :1;
        unsigned CL3                    :1;
        unsigned CL4                    :1;
    };
    struct {
        unsigned MD4CL                  :5;
    };
    struct {
        unsigned MD4CL0                 :1;
        unsigned MD4CL1                 :1;
        unsigned MD4CL2                 :1;
        unsigned MD4CL3                 :1;
        unsigned MD4CL4                 :1;
    };
} MD4CARLbits_t;
extern volatile MD4CARLbits_t MD4CARLbits __at(0xD1E);
// bitfield macros
#define _MD4CARL_CL_POSN                                    0x0
#define _MD4CARL_CL_POSITION                                0x0
#define _MD4CARL_CL_SIZE                                    0x5
#define _MD4CARL_CL_LENGTH                                  0x5
#define _MD4CARL_CL_MASK                                    0x1F
#define _MD4CARL_CL0_POSN                                   0x0
#define _MD4CARL_CL0_POSITION                               0x0
#define _MD4CARL_CL0_SIZE                                   0x1
#define _MD4CARL_CL0_LENGTH                                 0x1
#define _MD4CARL_CL0_MASK                                   0x1
#define _MD4CARL_CL1_POSN                                   0x1
#define _MD4CARL_CL1_POSITION                               0x1
#define _MD4CARL_CL1_SIZE                                   0x1
#define _MD4CARL_CL1_LENGTH                                 0x1
#define _MD4CARL_CL1_MASK                                   0x2
#define _MD4CARL_CL2_POSN                                   0x2
#define _MD4CARL_CL2_POSITION                               0x2
#define _MD4CARL_CL2_SIZE                                   0x1
#define _MD4CARL_CL2_LENGTH                                 0x1
#define _MD4CARL_CL2_MASK                                   0x4
#define _MD4CARL_CL3_POSN                                   0x3
#define _MD4CARL_CL3_POSITION                               0x3
#define _MD4CARL_CL3_SIZE                                   0x1
#define _MD4CARL_CL3_LENGTH                                 0x1
#define _MD4CARL_CL3_MASK                                   0x8
#define _MD4CARL_CL4_POSN                                   0x4
#define _MD4CARL_CL4_POSITION                               0x4
#define _MD4CARL_CL4_SIZE                                   0x1
#define _MD4CARL_CL4_LENGTH                                 0x1
#define _MD4CARL_CL4_MASK                                   0x10
#define _MD4CARL_MD4CL_POSN                                 0x0
#define _MD4CARL_MD4CL_POSITION                             0x0
#define _MD4CARL_MD4CL_SIZE                                 0x5
#define _MD4CARL_MD4CL_LENGTH                               0x5
#define _MD4CARL_MD4CL_MASK                                 0x1F
#define _MD4CARL_MD4CL0_POSN                                0x0
#define _MD4CARL_MD4CL0_POSITION                            0x0
#define _MD4CARL_MD4CL0_SIZE                                0x1
#define _MD4CARL_MD4CL0_LENGTH                              0x1
#define _MD4CARL_MD4CL0_MASK                                0x1
#define _MD4CARL_MD4CL1_POSN                                0x1
#define _MD4CARL_MD4CL1_POSITION                            0x1
#define _MD4CARL_MD4CL1_SIZE                                0x1
#define _MD4CARL_MD4CL1_LENGTH                              0x1
#define _MD4CARL_MD4CL1_MASK                                0x2
#define _MD4CARL_MD4CL2_POSN                                0x2
#define _MD4CARL_MD4CL2_POSITION                            0x2
#define _MD4CARL_MD4CL2_SIZE                                0x1
#define _MD4CARL_MD4CL2_LENGTH                              0x1
#define _MD4CARL_MD4CL2_MASK                                0x4
#define _MD4CARL_MD4CL3_POSN                                0x3
#define _MD4CARL_MD4CL3_POSITION                            0x3
#define _MD4CARL_MD4CL3_SIZE                                0x1
#define _MD4CARL_MD4CL3_LENGTH                              0x1
#define _MD4CARL_MD4CL3_MASK                                0x8
#define _MD4CARL_MD4CL4_POSN                                0x4
#define _MD4CARL_MD4CL4_POSITION                            0x4
#define _MD4CARL_MD4CL4_SIZE                                0x1
#define _MD4CARL_MD4CL4_LENGTH                              0x1
#define _MD4CARL_MD4CL4_MASK                                0x10

// Register: MD4CARH
#define MD4CARH MD4CARH
extern volatile unsigned char           MD4CARH             __at(0xD1F);
#ifndef _LIB_BUILD
asm("MD4CARH equ 0D1Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CH                     :5;
    };
    struct {
        unsigned CH0                    :1;
        unsigned CH1                    :1;
        unsigned CH2                    :1;
        unsigned CH3                    :1;
        unsigned CH4                    :1;
    };
    struct {
        unsigned MD4CH                  :5;
    };
    struct {
        unsigned MD4CH0                 :1;
        unsigned MD4CH1                 :1;
        unsigned MD4CH2                 :1;
        unsigned MD4CH3                 :1;
        unsigned MD4CH4                 :1;
    };
} MD4CARHbits_t;
extern volatile MD4CARHbits_t MD4CARHbits __at(0xD1F);
// bitfield macros
#define _MD4CARH_CH_POSN                                    0x0
#define _MD4CARH_CH_POSITION                                0x0
#define _MD4CARH_CH_SIZE                                    0x5
#define _MD4CARH_CH_LENGTH                                  0x5
#define _MD4CARH_CH_MASK                                    0x1F
#define _MD4CARH_CH0_POSN                                   0x0
#define _MD4CARH_CH0_POSITION                               0x0
#define _MD4CARH_CH0_SIZE                                   0x1
#define _MD4CARH_CH0_LENGTH                                 0x1
#define _MD4CARH_CH0_MASK                                   0x1
#define _MD4CARH_CH1_POSN                                   0x1
#define _MD4CARH_CH1_POSITION                               0x1
#define _MD4CARH_CH1_SIZE                                   0x1
#define _MD4CARH_CH1_LENGTH                                 0x1
#define _MD4CARH_CH1_MASK                                   0x2
#define _MD4CARH_CH2_POSN                                   0x2
#define _MD4CARH_CH2_POSITION                               0x2
#define _MD4CARH_CH2_SIZE                                   0x1
#define _MD4CARH_CH2_LENGTH                                 0x1
#define _MD4CARH_CH2_MASK                                   0x4
#define _MD4CARH_CH3_POSN                                   0x3
#define _MD4CARH_CH3_POSITION                               0x3
#define _MD4CARH_CH3_SIZE                                   0x1
#define _MD4CARH_CH3_LENGTH                                 0x1
#define _MD4CARH_CH3_MASK                                   0x8
#define _MD4CARH_CH4_POSN                                   0x4
#define _MD4CARH_CH4_POSITION                               0x4
#define _MD4CARH_CH4_SIZE                                   0x1
#define _MD4CARH_CH4_LENGTH                                 0x1
#define _MD4CARH_CH4_MASK                                   0x10
#define _MD4CARH_MD4CH_POSN                                 0x0
#define _MD4CARH_MD4CH_POSITION                             0x0
#define _MD4CARH_MD4CH_SIZE                                 0x5
#define _MD4CARH_MD4CH_LENGTH                               0x5
#define _MD4CARH_MD4CH_MASK                                 0x1F
#define _MD4CARH_MD4CH0_POSN                                0x0
#define _MD4CARH_MD4CH0_POSITION                            0x0
#define _MD4CARH_MD4CH0_SIZE                                0x1
#define _MD4CARH_MD4CH0_LENGTH                              0x1
#define _MD4CARH_MD4CH0_MASK                                0x1
#define _MD4CARH_MD4CH1_POSN                                0x1
#define _MD4CARH_MD4CH1_POSITION                            0x1
#define _MD4CARH_MD4CH1_SIZE                                0x1
#define _MD4CARH_MD4CH1_LENGTH                              0x1
#define _MD4CARH_MD4CH1_MASK                                0x2
#define _MD4CARH_MD4CH2_POSN                                0x2
#define _MD4CARH_MD4CH2_POSITION                            0x2
#define _MD4CARH_MD4CH2_SIZE                                0x1
#define _MD4CARH_MD4CH2_LENGTH                              0x1
#define _MD4CARH_MD4CH2_MASK                                0x4
#define _MD4CARH_MD4CH3_POSN                                0x3
#define _MD4CARH_MD4CH3_POSITION                            0x3
#define _MD4CARH_MD4CH3_SIZE                                0x1
#define _MD4CARH_MD4CH3_LENGTH                              0x1
#define _MD4CARH_MD4CH3_MASK                                0x8
#define _MD4CARH_MD4CH4_POSN                                0x4
#define _MD4CARH_MD4CH4_POSITION                            0x4
#define _MD4CARH_MD4CH4_SIZE                                0x1
#define _MD4CARH_MD4CH4_LENGTH                              0x1
#define _MD4CARH_MD4CH4_MASK                                0x10

// Register: PWMEN
#define PWMEN PWMEN
extern volatile unsigned char           PWMEN               __at(0xD8E);
#ifndef _LIB_BUILD
asm("PWMEN equ 0D8Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MPWM5EN                :1;
        unsigned MPWM6EN                :1;
        unsigned MPWM11EN               :1;
        unsigned MPWM12EN               :1;
    };
} PWMENbits_t;
extern volatile PWMENbits_t PWMENbits __at(0xD8E);
// bitfield macros
#define _PWMEN_MPWM5EN_POSN                                 0x0
#define _PWMEN_MPWM5EN_POSITION                             0x0
#define _PWMEN_MPWM5EN_SIZE                                 0x1
#define _PWMEN_MPWM5EN_LENGTH                               0x1
#define _PWMEN_MPWM5EN_MASK                                 0x1
#define _PWMEN_MPWM6EN_POSN                                 0x1
#define _PWMEN_MPWM6EN_POSITION                             0x1
#define _PWMEN_MPWM6EN_SIZE                                 0x1
#define _PWMEN_MPWM6EN_LENGTH                               0x1
#define _PWMEN_MPWM6EN_MASK                                 0x2
#define _PWMEN_MPWM11EN_POSN                                0x2
#define _PWMEN_MPWM11EN_POSITION                            0x2
#define _PWMEN_MPWM11EN_SIZE                                0x1
#define _PWMEN_MPWM11EN_LENGTH                              0x1
#define _PWMEN_MPWM11EN_MASK                                0x4
#define _PWMEN_MPWM12EN_POSN                                0x3
#define _PWMEN_MPWM12EN_POSITION                            0x3
#define _PWMEN_MPWM12EN_SIZE                                0x1
#define _PWMEN_MPWM12EN_LENGTH                              0x1
#define _PWMEN_MPWM12EN_MASK                                0x8

