MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1779/mcu.h
extern volatile PWM12PHLbits_t PWM12PHLbits __at(0xDC1);
// bitfield macros
#define _PWM12PHL_PH_POSN                                   0x0
#define _PWM12PHL_PH_POSITION                               0x0
#define _PWM12PHL_PH_SIZE                                   0x8
#define _PWM12PHL_PH_LENGTH                                 0x8
#define _PWM12PHL_PH_MASK                                   0xFF
#define _PWM12PHL_PWM12PHL0_POSN                            0x0
#define _PWM12PHL_PWM12PHL0_POSITION                        0x0
#define _PWM12PHL_PWM12PHL0_SIZE                            0x1
#define _PWM12PHL_PWM12PHL0_LENGTH                          0x1
#define _PWM12PHL_PWM12PHL0_MASK                            0x1
#define _PWM12PHL_PWM12PHL1_POSN                            0x1
#define _PWM12PHL_PWM12PHL1_POSITION                        0x1
#define _PWM12PHL_PWM12PHL1_SIZE                            0x1
#define _PWM12PHL_PWM12PHL1_LENGTH                          0x1
#define _PWM12PHL_PWM12PHL1_MASK                            0x2
#define _PWM12PHL_PWM12PHL2_POSN                            0x2
#define _PWM12PHL_PWM12PHL2_POSITION                        0x2
#define _PWM12PHL_PWM12PHL2_SIZE                            0x1
#define _PWM12PHL_PWM12PHL2_LENGTH                          0x1
#define _PWM12PHL_PWM12PHL2_MASK                            0x4
#define _PWM12PHL_PWM12PHL3_POSN                            0x3
#define _PWM12PHL_PWM12PHL3_POSITION                        0x3
#define _PWM12PHL_PWM12PHL3_SIZE                            0x1
#define _PWM12PHL_PWM12PHL3_LENGTH                          0x1
#define _PWM12PHL_PWM12PHL3_MASK                            0x8
#define _PWM12PHL_PWM12PHL4_POSN                            0x4
#define _PWM12PHL_PWM12PHL4_POSITION                        0x4
#define _PWM12PHL_PWM12PHL4_SIZE                            0x1
#define _PWM12PHL_PWM12PHL4_LENGTH                          0x1
#define _PWM12PHL_PWM12PHL4_MASK                            0x10
#define _PWM12PHL_PWM12PHL5_POSN                            0x5
#define _PWM12PHL_PWM12PHL5_POSITION                        0x5
#define _PWM12PHL_PWM12PHL5_SIZE                            0x1
#define _PWM12PHL_PWM12PHL5_LENGTH                          0x1
#define _PWM12PHL_PWM12PHL5_MASK                            0x20
#define _PWM12PHL_PWM12PHL6_POSN                            0x6
#define _PWM12PHL_PWM12PHL6_POSITION                        0x6
#define _PWM12PHL_PWM12PHL6_SIZE                            0x1
#define _PWM12PHL_PWM12PHL6_LENGTH                          0x1
#define _PWM12PHL_PWM12PHL6_MASK                            0x40
#define _PWM12PHL_PWM12PHL7_POSN                            0x7
#define _PWM12PHL_PWM12PHL7_POSITION                        0x7
#define _PWM12PHL_PWM12PHL7_SIZE                            0x1
#define _PWM12PHL_PWM12PHL7_LENGTH                          0x1
#define _PWM12PHL_PWM12PHL7_MASK                            0x80
#define _PWM12PHL_PWM12PHL_POSN                             0x0
#define _PWM12PHL_PWM12PHL_POSITION                         0x0
#define _PWM12PHL_PWM12PHL_SIZE                             0x8
#define _PWM12PHL_PWM12PHL_LENGTH                           0x8
#define _PWM12PHL_PWM12PHL_MASK                             0xFF

// Register: PWM12PHH
#define PWM12PHH PWM12PHH
extern volatile unsigned char           PWM12PHH            __at(0xDC2);
#ifndef _LIB_BUILD
asm("PWM12PHH equ 0DC2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PH                     :8;
    };
    struct {
        unsigned PWM12PHH0              :1;
        unsigned PWM12PHH1              :1;
        unsigned PWM12PHH2              :1;
        unsigned PWM12PHH3              :1;
        unsigned PWM12PHH4              :1;
        unsigned PWM12PHH5              :1;
        unsigned PWM12PHH6              :1;
        unsigned PWM12PHH7              :1;
    };
    struct {
        unsigned PWM12PHH               :8;
    };
} PWM12PHHbits_t;
extern volatile PWM12PHHbits_t PWM12PHHbits __at(0xDC2);
// bitfield macros
#define _PWM12PHH_PH_POSN                                   0x0
#define _PWM12PHH_PH_POSITION                               0x0
#define _PWM12PHH_PH_SIZE                                   0x8
#define _PWM12PHH_PH_LENGTH                                 0x8
#define _PWM12PHH_PH_MASK                                   0xFF
#define _PWM12PHH_PWM12PHH0_POSN                            0x0
#define _PWM12PHH_PWM12PHH0_POSITION                        0x0
#define _PWM12PHH_PWM12PHH0_SIZE                            0x1
#define _PWM12PHH_PWM12PHH0_LENGTH                          0x1
#define _PWM12PHH_PWM12PHH0_MASK                            0x1
#define _PWM12PHH_PWM12PHH1_POSN                            0x1
#define _PWM12PHH_PWM12PHH1_POSITION                        0x1
#define _PWM12PHH_PWM12PHH1_SIZE                            0x1
#define _PWM12PHH_PWM12PHH1_LENGTH                          0x1
#define _PWM12PHH_PWM12PHH1_MASK                            0x2
#define _PWM12PHH_PWM12PHH2_POSN                            0x2
#define _PWM12PHH_PWM12PHH2_POSITION                        0x2
#define _PWM12PHH_PWM12PHH2_SIZE                            0x1
#define _PWM12PHH_PWM12PHH2_LENGTH                          0x1
#define _PWM12PHH_PWM12PHH2_MASK                            0x4
#define _PWM12PHH_PWM12PHH3_POSN                            0x3
#define _PWM12PHH_PWM12PHH3_POSITION                        0x3
#define _PWM12PHH_PWM12PHH3_SIZE                            0x1
#define _PWM12PHH_PWM12PHH3_LENGTH                          0x1
#define _PWM12PHH_PWM12PHH3_MASK                            0x8
#define _PWM12PHH_PWM12PHH4_POSN                            0x4
#define _PWM12PHH_PWM12PHH4_POSITION                        0x4
#define _PWM12PHH_PWM12PHH4_SIZE                            0x1
#define _PWM12PHH_PWM12PHH4_LENGTH                          0x1
#define _PWM12PHH_PWM12PHH4_MASK                            0x10
#define _PWM12PHH_PWM12PHH5_POSN                            0x5
#define _PWM12PHH_PWM12PHH5_POSITION                        0x5
#define _PWM12PHH_PWM12PHH5_SIZE                            0x1
#define _PWM12PHH_PWM12PHH5_LENGTH                          0x1
#define _PWM12PHH_PWM12PHH5_MASK                            0x20
#define _PWM12PHH_PWM12PHH6_POSN                            0x6
#define _PWM12PHH_PWM12PHH6_POSITION                        0x6
#define _PWM12PHH_PWM12PHH6_SIZE                            0x1
#define _PWM12PHH_PWM12PHH6_LENGTH                          0x1
#define _PWM12PHH_PWM12PHH6_MASK                            0x40
#define _PWM12PHH_PWM12PHH7_POSN                            0x7
#define _PWM12PHH_PWM12PHH7_POSITION                        0x7
#define _PWM12PHH_PWM12PHH7_SIZE                            0x1
#define _PWM12PHH_PWM12PHH7_LENGTH                          0x1
#define _PWM12PHH_PWM12PHH7_MASK                            0x80
#define _PWM12PHH_PWM12PHH_POSN                             0x0
#define _PWM12PHH_PWM12PHH_POSITION                         0x0
#define _PWM12PHH_PWM12PHH_SIZE                             0x8
#define _PWM12PHH_PWM12PHH_LENGTH                           0x8
#define _PWM12PHH_PWM12PHH_MASK                             0xFF

// Register: PWM12DC
#define PWM12DC PWM12DC
extern volatile unsigned short          PWM12DC             __at(0xDC3);
#ifndef _LIB_BUILD
asm("PWM12DC equ 0DC3h");
#endif

