MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1779/mcu.h
// Register: PWM12OFL
#define PWM12OFL PWM12OFL
extern volatile unsigned char           PWM12OFL            __at(0xDC7);
#ifndef _LIB_BUILD
asm("PWM12OFL equ 0DC7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OF                     :8;
    };
    struct {
        unsigned PWM12OFL0              :1;
        unsigned PWM12OFL1              :1;
        unsigned PWM12OFL2              :1;
        unsigned PWM12OFL3              :1;
        unsigned PWM12OFL4              :1;
        unsigned PWM12OFL5              :1;
        unsigned PWM12OFL6              :1;
        unsigned PWM12OFL7              :1;
    };
    struct {
        unsigned PWM12OFL               :8;
    };
} PWM12OFLbits_t;
extern volatile PWM12OFLbits_t PWM12OFLbits __at(0xDC7);
// bitfield macros
#define _PWM12OFL_OF_POSN                                   0x0
#define _PWM12OFL_OF_POSITION                               0x0
#define _PWM12OFL_OF_SIZE                                   0x8
#define _PWM12OFL_OF_LENGTH                                 0x8
#define _PWM12OFL_OF_MASK                                   0xFF
#define _PWM12OFL_PWM12OFL0_POSN                            0x0
#define _PWM12OFL_PWM12OFL0_POSITION                        0x0
#define _PWM12OFL_PWM12OFL0_SIZE                            0x1
#define _PWM12OFL_PWM12OFL0_LENGTH                          0x1
#define _PWM12OFL_PWM12OFL0_MASK                            0x1
#define _PWM12OFL_PWM12OFL1_POSN                            0x1
#define _PWM12OFL_PWM12OFL1_POSITION                        0x1
#define _PWM12OFL_PWM12OFL1_SIZE                            0x1
#define _PWM12OFL_PWM12OFL1_LENGTH                          0x1
#define _PWM12OFL_PWM12OFL1_MASK                            0x2
#define _PWM12OFL_PWM12OFL2_POSN                            0x2
#define _PWM12OFL_PWM12OFL2_POSITION                        0x2
#define _PWM12OFL_PWM12OFL2_SIZE                            0x1
#define _PWM12OFL_PWM12OFL2_LENGTH                          0x1
#define _PWM12OFL_PWM12OFL2_MASK                            0x4
#define _PWM12OFL_PWM12OFL3_POSN                            0x3
#define _PWM12OFL_PWM12OFL3_POSITION                        0x3
#define _PWM12OFL_PWM12OFL3_SIZE                            0x1
#define _PWM12OFL_PWM12OFL3_LENGTH                          0x1
#define _PWM12OFL_PWM12OFL3_MASK                            0x8
#define _PWM12OFL_PWM12OFL4_POSN                            0x4
#define _PWM12OFL_PWM12OFL4_POSITION                        0x4
#define _PWM12OFL_PWM12OFL4_SIZE                            0x1
#define _PWM12OFL_PWM12OFL4_LENGTH                          0x1
#define _PWM12OFL_PWM12OFL4_MASK                            0x10
#define _PWM12OFL_PWM12OFL5_POSN                            0x5
#define _PWM12OFL_PWM12OFL5_POSITION                        0x5
#define _PWM12OFL_PWM12OFL5_SIZE                            0x1
#define _PWM12OFL_PWM12OFL5_LENGTH                          0x1
#define _PWM12OFL_PWM12OFL5_MASK                            0x20
#define _PWM12OFL_PWM12OFL6_POSN                            0x6
#define _PWM12OFL_PWM12OFL6_POSITION                        0x6
#define _PWM12OFL_PWM12OFL6_SIZE                            0x1
#define _PWM12OFL_PWM12OFL6_LENGTH                          0x1
#define _PWM12OFL_PWM12OFL6_MASK                            0x40
#define _PWM12OFL_PWM12OFL7_POSN                            0x7
#define _PWM12OFL_PWM12OFL7_POSITION                        0x7
#define _PWM12OFL_PWM12OFL7_SIZE                            0x1
#define _PWM12OFL_PWM12OFL7_LENGTH                          0x1
#define _PWM12OFL_PWM12OFL7_MASK                            0x80
#define _PWM12OFL_PWM12OFL_POSN                             0x0
#define _PWM12OFL_PWM12OFL_POSITION                         0x0
#define _PWM12OFL_PWM12OFL_SIZE                             0x8
#define _PWM12OFL_PWM12OFL_LENGTH                           0x8
#define _PWM12OFL_PWM12OFL_MASK                             0xFF

// Register: PWM12OFH
#define PWM12OFH PWM12OFH
extern volatile unsigned char           PWM12OFH            __at(0xDC8);
#ifndef _LIB_BUILD
asm("PWM12OFH equ 0DC8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OF                     :8;
    };
    struct {
        unsigned PWM12OFH0              :1;
        unsigned PWM12OFH1              :1;
        unsigned PWM12OFH2              :1;
        unsigned PWM12OFH3              :1;
        unsigned PWM12OFH4              :1;
        unsigned PWM12OFH5              :1;
        unsigned PWM12OFH6              :1;
        unsigned PWM12OFH7              :1;
    };
    struct {
        unsigned PWM12OFH               :8;
    };
} PWM12OFHbits_t;
extern volatile PWM12OFHbits_t PWM12OFHbits __at(0xDC8);
// bitfield macros
#define _PWM12OFH_OF_POSN                                   0x0
#define _PWM12OFH_OF_POSITION                               0x0
#define _PWM12OFH_OF_SIZE                                   0x8
#define _PWM12OFH_OF_LENGTH                                 0x8
#define _PWM12OFH_OF_MASK                                   0xFF
#define _PWM12OFH_PWM12OFH0_POSN                            0x0
#define _PWM12OFH_PWM12OFH0_POSITION                        0x0
#define _PWM12OFH_PWM12OFH0_SIZE                            0x1
#define _PWM12OFH_PWM12OFH0_LENGTH                          0x1
#define _PWM12OFH_PWM12OFH0_MASK                            0x1
#define _PWM12OFH_PWM12OFH1_POSN                            0x1
#define _PWM12OFH_PWM12OFH1_POSITION                        0x1
#define _PWM12OFH_PWM12OFH1_SIZE                            0x1
#define _PWM12OFH_PWM12OFH1_LENGTH                          0x1
#define _PWM12OFH_PWM12OFH1_MASK                            0x2
#define _PWM12OFH_PWM12OFH2_POSN                            0x2
#define _PWM12OFH_PWM12OFH2_POSITION                        0x2
#define _PWM12OFH_PWM12OFH2_SIZE                            0x1
#define _PWM12OFH_PWM12OFH2_LENGTH                          0x1
#define _PWM12OFH_PWM12OFH2_MASK                            0x4
#define _PWM12OFH_PWM12OFH3_POSN                            0x3
#define _PWM12OFH_PWM12OFH3_POSITION                        0x3
#define _PWM12OFH_PWM12OFH3_SIZE                            0x1
#define _PWM12OFH_PWM12OFH3_LENGTH                          0x1
#define _PWM12OFH_PWM12OFH3_MASK                            0x8
#define _PWM12OFH_PWM12OFH4_POSN                            0x4
#define _PWM12OFH_PWM12OFH4_POSITION                        0x4
#define _PWM12OFH_PWM12OFH4_SIZE                            0x1
#define _PWM12OFH_PWM12OFH4_LENGTH                          0x1
#define _PWM12OFH_PWM12OFH4_MASK                            0x10
#define _PWM12OFH_PWM12OFH5_POSN                            0x5
#define _PWM12OFH_PWM12OFH5_POSITION                        0x5
#define _PWM12OFH_PWM12OFH5_SIZE                            0x1
#define _PWM12OFH_PWM12OFH5_LENGTH                          0x1
#define _PWM12OFH_PWM12OFH5_MASK                            0x20
#define _PWM12OFH_PWM12OFH6_POSN                            0x6
#define _PWM12OFH_PWM12OFH6_POSITION                        0x6
#define _PWM12OFH_PWM12OFH6_SIZE                            0x1
#define _PWM12OFH_PWM12OFH6_LENGTH                          0x1
#define _PWM12OFH_PWM12OFH6_MASK                            0x40
#define _PWM12OFH_PWM12OFH7_POSN                            0x7
#define _PWM12OFH_PWM12OFH7_POSITION                        0x7
#define _PWM12OFH_PWM12OFH7_SIZE                            0x1
#define _PWM12OFH_PWM12OFH7_LENGTH                          0x1
#define _PWM12OFH_PWM12OFH7_MASK                            0x80
#define _PWM12OFH_PWM12OFH_POSN                             0x0
#define _PWM12OFH_PWM12OFH_POSITION                         0x0
#define _PWM12OFH_PWM12OFH_SIZE                             0x8
#define _PWM12OFH_PWM12OFH_LENGTH                           0x8
#define _PWM12OFH_PWM12OFH_MASK                             0xFF

// Register: PWM12TMR
#define PWM12TMR PWM12TMR
extern volatile unsigned short          PWM12TMR            __at(0xDC9);
#ifndef _LIB_BUILD
asm("PWM12TMR equ 0DC9h");
#endif

// Register: PWM12TMRL
#define PWM12TMRL PWM12TMRL
extern volatile unsigned char           PWM12TMRL           __at(0xDC9);
#ifndef _LIB_BUILD
asm("PWM12TMRL equ 0DC9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned PWM12TMRL0             :1;
        unsigned PWM12TMRL1             :1;
        unsigned PWM12TMRL2             :1;
        unsigned PWM12TMRL3             :1;
        unsigned PWM12TMRL4             :1;
        unsigned PWM12TMRL5             :1;
        unsigned PWM12TMRL6             :1;
        unsigned PWM12TMRL7             :1;
    };
    struct {
        unsigned PWM12TMRL              :8;
    };
} PWM12TMRLbits_t;
extern volatile PWM12TMRLbits_t PWM12TMRLbits __at(0xDC9);
// bitfield macros
#define _PWM12TMRL_TMR_POSN                                 0x0
#define _PWM12TMRL_TMR_POSITION                             0x0
#define _PWM12TMRL_TMR_SIZE                                 0x8
#define _PWM12TMRL_TMR_LENGTH                               0x8
#define _PWM12TMRL_TMR_MASK                                 0xFF
#define _PWM12TMRL_PWM12TMRL0_POSN                          0x0
#define _PWM12TMRL_PWM12TMRL0_POSITION                      0x0
#define _PWM12TMRL_PWM12TMRL0_SIZE                          0x1
#define _PWM12TMRL_PWM12TMRL0_LENGTH                        0x1
#define _PWM12TMRL_PWM12TMRL0_MASK                          0x1
#define _PWM12TMRL_PWM12TMRL1_POSN                          0x1
#define _PWM12TMRL_PWM12TMRL1_POSITION                      0x1
#define _PWM12TMRL_PWM12TMRL1_SIZE                          0x1
#define _PWM12TMRL_PWM12TMRL1_LENGTH                        0x1
#define _PWM12TMRL_PWM12TMRL1_MASK                          0x2
#define _PWM12TMRL_PWM12TMRL2_POSN                          0x2
#define _PWM12TMRL_PWM12TMRL2_POSITION                      0x2
#define _PWM12TMRL_PWM12TMRL2_SIZE                          0x1
#define _PWM12TMRL_PWM12TMRL2_LENGTH                        0x1
#define _PWM12TMRL_PWM12TMRL2_MASK                          0x4
#define _PWM12TMRL_PWM12TMRL3_POSN                          0x3
#define _PWM12TMRL_PWM12TMRL3_POSITION                      0x3
#define _PWM12TMRL_PWM12TMRL3_SIZE                          0x1
#define _PWM12TMRL_PWM12TMRL3_LENGTH                        0x1
#define _PWM12TMRL_PWM12TMRL3_MASK                          0x8
#define _PWM12TMRL_PWM12TMRL4_POSN                          0x4
#define _PWM12TMRL_PWM12TMRL4_POSITION                      0x4
#define _PWM12TMRL_PWM12TMRL4_SIZE                          0x1
#define _PWM12TMRL_PWM12TMRL4_LENGTH                        0x1
#define _PWM12TMRL_PWM12TMRL4_MASK                          0x10
#define _PWM12TMRL_PWM12TMRL5_POSN                          0x5
#define _PWM12TMRL_PWM12TMRL5_POSITION                      0x5
#define _PWM12TMRL_PWM12TMRL5_SIZE                          0x1
#define _PWM12TMRL_PWM12TMRL5_LENGTH                        0x1
#define _PWM12TMRL_PWM12TMRL5_MASK                          0x20
#define _PWM12TMRL_PWM12TMRL6_POSN                          0x6
#define _PWM12TMRL_PWM12TMRL6_POSITION                      0x6
#define _PWM12TMRL_PWM12TMRL6_SIZE                          0x1
#define _PWM12TMRL_PWM12TMRL6_LENGTH                        0x1
#define _PWM12TMRL_PWM12TMRL6_MASK                          0x40
#define _PWM12TMRL_PWM12TMRL7_POSN                          0x7
#define _PWM12TMRL_PWM12TMRL7_POSITION                      0x7
#define _PWM12TMRL_PWM12TMRL7_SIZE                          0x1
#define _PWM12TMRL_PWM12TMRL7_LENGTH                        0x1
#define _PWM12TMRL_PWM12TMRL7_MASK                          0x80
#define _PWM12TMRL_PWM12TMRL_POSN                           0x0
#define _PWM12TMRL_PWM12TMRL_POSITION                       0x0
#define _PWM12TMRL_PWM12TMRL_SIZE                           0x8
#define _PWM12TMRL_PWM12TMRL_LENGTH                         0x8
#define _PWM12TMRL_PWM12TMRL_MASK                           0xFF

// Register: PWM12TMRH
#define PWM12TMRH PWM12TMRH
extern volatile unsigned char           PWM12TMRH           __at(0xDCA);
#ifndef _LIB_BUILD
asm("PWM12TMRH equ 0DCAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned PWM12TMRH0             :1;
        unsigned PWM12TMRH1             :1;
        unsigned PWM12TMRH2             :1;
        unsigned PWM12TMRH3             :1;
        unsigned PWM12TMRH4             :1;
        unsigned PWM12TMRH5             :1;
        unsigned PWM12TMRH6             :1;
        unsigned PWM12TMRH7             :1;
    };
    struct {
        unsigned PWM12TMRH              :8;
    };
} PWM12TMRHbits_t;
extern volatile PWM12TMRHbits_t PWM12TMRHbits __at(0xDCA);
// bitfield macros
#define _PWM12TMRH_TMR_POSN                                 0x0
#define _PWM12TMRH_TMR_POSITION                             0x0
#define _PWM12TMRH_TMR_SIZE                                 0x8
#define _PWM12TMRH_TMR_LENGTH                               0x8
#define _PWM12TMRH_TMR_MASK                                 0xFF
#define _PWM12TMRH_PWM12TMRH0_POSN                          0x0
#define _PWM12TMRH_PWM12TMRH0_POSITION                      0x0
#define _PWM12TMRH_PWM12TMRH0_SIZE                          0x1
#define _PWM12TMRH_PWM12TMRH0_LENGTH                        0x1
#define _PWM12TMRH_PWM12TMRH0_MASK                          0x1
#define _PWM12TMRH_PWM12TMRH1_POSN                          0x1
#define _PWM12TMRH_PWM12TMRH1_POSITION                      0x1
#define _PWM12TMRH_PWM12TMRH1_SIZE                          0x1
#define _PWM12TMRH_PWM12TMRH1_LENGTH                        0x1
#define _PWM12TMRH_PWM12TMRH1_MASK                          0x2
#define _PWM12TMRH_PWM12TMRH2_POSN                          0x2
#define _PWM12TMRH_PWM12TMRH2_POSITION                      0x2
#define _PWM12TMRH_PWM12TMRH2_SIZE                          0x1
#define _PWM12TMRH_PWM12TMRH2_LENGTH                        0x1
#define _PWM12TMRH_PWM12TMRH2_MASK                          0x4
#define _PWM12TMRH_PWM12TMRH3_POSN                          0x3
#define _PWM12TMRH_PWM12TMRH3_POSITION                      0x3
#define _PWM12TMRH_PWM12TMRH3_SIZE                          0x1
#define _PWM12TMRH_PWM12TMRH3_LENGTH                        0x1
#define _PWM12TMRH_PWM12TMRH3_MASK                          0x8
#define _PWM12TMRH_PWM12TMRH4_POSN                          0x4
#define _PWM12TMRH_PWM12TMRH4_POSITION                      0x4
#define _PWM12TMRH_PWM12TMRH4_SIZE                          0x1
#define _PWM12TMRH_PWM12TMRH4_LENGTH                        0x1
#define _PWM12TMRH_PWM12TMRH4_MASK                          0x10
#define _PWM12TMRH_PWM12TMRH5_POSN                          0x5
#define _PWM12TMRH_PWM12TMRH5_POSITION                      0x5
#define _PWM12TMRH_PWM12TMRH5_SIZE                          0x1
#define _PWM12TMRH_PWM12TMRH5_LENGTH                        0x1
#define _PWM12TMRH_PWM12TMRH5_MASK                          0x20
#define _PWM12TMRH_PWM12TMRH6_POSN                          0x6
#define _PWM12TMRH_PWM12TMRH6_POSITION                      0x6
#define _PWM12TMRH_PWM12TMRH6_SIZE                          0x1
#define _PWM12TMRH_PWM12TMRH6_LENGTH                        0x1
#define _PWM12TMRH_PWM12TMRH6_MASK                          0x40
#define _PWM12TMRH_PWM12TMRH7_POSN                          0x7
#define _PWM12TMRH_PWM12TMRH7_POSITION                      0x7
#define _PWM12TMRH_PWM12TMRH7_SIZE                          0x1
#define _PWM12TMRH_PWM12TMRH7_LENGTH                        0x1
#define _PWM12TMRH_PWM12TMRH7_MASK                          0x80
#define _PWM12TMRH_PWM12TMRH_POSN                           0x0
#define _PWM12TMRH_PWM12TMRH_POSITION                       0x0
#define _PWM12TMRH_PWM12TMRH_SIZE                           0x8
#define _PWM12TMRH_PWM12TMRH_LENGTH                         0x8
#define _PWM12TMRH_PWM12TMRH_MASK                           0xFF

// Register: PWM12CON
#define PWM12CON PWM12CON
extern volatile unsigned char           PWM12CON            __at(0xDCB);
#ifndef _LIB_BUILD
asm("PWM12CON equ 0DCBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned MODE                   :2;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned PWM12MODE0             :1;
        unsigned PWM12MODE1             :1;
    };
    struct {
        unsigned                        :2;
        unsigned PWM12MODE              :2;
        unsigned PWM12POL               :1;
        unsigned PWM12OUT               :1;
        unsigned                        :1;
        unsigned PWM12EN                :1;
    };
    struct {
        unsigned                        :2;
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
    };
} PWM12CONbits_t;
