MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1779/mcu.h
extern volatile T2PPSbits_t T2PPSbits __at(0xE15);
// bitfield macros
#define _T2PPS_T2INPPS_POSN                                 0x0
#define _T2PPS_T2INPPS_POSITION                             0x0
#define _T2PPS_T2INPPS_SIZE                                 0x6
#define _T2PPS_T2INPPS_LENGTH                               0x6
#define _T2PPS_T2INPPS_MASK                                 0x3F

// Register: T4INPPS
#define T4INPPS T4INPPS
extern volatile unsigned char           T4INPPS             __at(0xE16);
#ifndef _LIB_BUILD
asm("T4INPPS equ 0E16h");
#endif
// aliases
extern volatile unsigned char           T4CKIPPS            __at(0xE16);
#ifndef _LIB_BUILD
asm("T4CKIPPS equ 0E16h");
#endif
extern volatile unsigned char           T4PPS               __at(0xE16);
#ifndef _LIB_BUILD
asm("T4PPS equ 0E16h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T4INPPS                :6;
    };
} T4INPPSbits_t;
extern volatile T4INPPSbits_t T4INPPSbits __at(0xE16);
// bitfield macros
#define _T4INPPS_T4INPPS_POSN                               0x0
#define _T4INPPS_T4INPPS_POSITION                           0x0
#define _T4INPPS_T4INPPS_SIZE                               0x6
#define _T4INPPS_T4INPPS_LENGTH                             0x6
#define _T4INPPS_T4INPPS_MASK                               0x3F
// alias bitfield definitions
typedef union {
    struct {
        unsigned T4INPPS                :6;
    };
} T4CKIPPSbits_t;
extern volatile T4CKIPPSbits_t T4CKIPPSbits __at(0xE16);
// bitfield macros
#define _T4CKIPPS_T4INPPS_POSN                              0x0
#define _T4CKIPPS_T4INPPS_POSITION                          0x0
#define _T4CKIPPS_T4INPPS_SIZE                              0x6
#define _T4CKIPPS_T4INPPS_LENGTH                            0x6
#define _T4CKIPPS_T4INPPS_MASK                              0x3F
typedef union {
    struct {
        unsigned T4INPPS                :6;
    };
} T4PPSbits_t;
extern volatile T4PPSbits_t T4PPSbits __at(0xE16);
// bitfield macros
#define _T4PPS_T4INPPS_POSN                                 0x0
#define _T4PPS_T4INPPS_POSITION                             0x0
#define _T4PPS_T4INPPS_SIZE                                 0x6
#define _T4PPS_T4INPPS_LENGTH                               0x6
#define _T4PPS_T4INPPS_MASK                                 0x3F

// Register: T6INPPS
#define T6INPPS T6INPPS
extern volatile unsigned char           T6INPPS             __at(0xE17);
#ifndef _LIB_BUILD
asm("T6INPPS equ 0E17h");
#endif
// aliases
extern volatile unsigned char           T6CKIPPS            __at(0xE17);
#ifndef _LIB_BUILD
asm("T6CKIPPS equ 0E17h");
#endif
extern volatile unsigned char           T6PPS               __at(0xE17);
#ifndef _LIB_BUILD
asm("T6PPS equ 0E17h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T6INPPS                :6;
    };
} T6INPPSbits_t;
extern volatile T6INPPSbits_t T6INPPSbits __at(0xE17);
// bitfield macros
#define _T6INPPS_T6INPPS_POSN                               0x0
#define _T6INPPS_T6INPPS_POSITION                           0x0
#define _T6INPPS_T6INPPS_SIZE                               0x6
#define _T6INPPS_T6INPPS_LENGTH                             0x6
#define _T6INPPS_T6INPPS_MASK                               0x3F
// alias bitfield definitions
typedef union {
    struct {
        unsigned T6INPPS                :6;
    };
} T6CKIPPSbits_t;
extern volatile T6CKIPPSbits_t T6CKIPPSbits __at(0xE17);
// bitfield macros
#define _T6CKIPPS_T6INPPS_POSN                              0x0
#define _T6CKIPPS_T6INPPS_POSITION                          0x0
#define _T6CKIPPS_T6INPPS_SIZE                              0x6
#define _T6CKIPPS_T6INPPS_LENGTH                            0x6
#define _T6CKIPPS_T6INPPS_MASK                              0x3F
typedef union {
    struct {
        unsigned T6INPPS                :6;
    };
} T6PPSbits_t;
extern volatile T6PPSbits_t T6PPSbits __at(0xE17);
// bitfield macros
#define _T6PPS_T6INPPS_POSN                                 0x0
#define _T6PPS_T6INPPS_POSITION                             0x0
#define _T6PPS_T6INPPS_SIZE                                 0x6
#define _T6PPS_T6INPPS_LENGTH                               0x6
#define _T6PPS_T6INPPS_MASK                                 0x3F

// Register: T8INPPS
#define T8INPPS T8INPPS
extern volatile unsigned char           T8INPPS             __at(0xE18);
#ifndef _LIB_BUILD
asm("T8INPPS equ 0E18h");
#endif
// aliases
extern volatile unsigned char           T8CKIPPS            __at(0xE18);
#ifndef _LIB_BUILD
asm("T8CKIPPS equ 0E18h");
#endif
extern volatile unsigned char           T8PPS               __at(0xE18);
#ifndef _LIB_BUILD
asm("T8PPS equ 0E18h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T8INPPS                :6;
    };
} T8INPPSbits_t;
extern volatile T8INPPSbits_t T8INPPSbits __at(0xE18);
// bitfield macros
#define _T8INPPS_T8INPPS_POSN                               0x0
#define _T8INPPS_T8INPPS_POSITION                           0x0
#define _T8INPPS_T8INPPS_SIZE                               0x6
#define _T8INPPS_T8INPPS_LENGTH                             0x6
#define _T8INPPS_T8INPPS_MASK                               0x3F
// alias bitfield definitions
typedef union {
    struct {
        unsigned T8INPPS                :6;
    };
} T8CKIPPSbits_t;
extern volatile T8CKIPPSbits_t T8CKIPPSbits __at(0xE18);
// bitfield macros
#define _T8CKIPPS_T8INPPS_POSN                              0x0
#define _T8CKIPPS_T8INPPS_POSITION                          0x0
#define _T8CKIPPS_T8INPPS_SIZE                              0x6
#define _T8CKIPPS_T8INPPS_LENGTH                            0x6
#define _T8CKIPPS_T8INPPS_MASK                              0x3F
typedef union {
    struct {
        unsigned T8INPPS                :6;
    };
} T8PPSbits_t;
extern volatile T8PPSbits_t T8PPSbits __at(0xE18);
// bitfield macros
#define _T8PPS_T8INPPS_POSN                                 0x0
#define _T8PPS_T8INPPS_POSITION                             0x0
#define _T8PPS_T8INPPS_SIZE                                 0x6
#define _T8PPS_T8INPPS_LENGTH                               0x6
#define _T8PPS_T8INPPS_MASK                                 0x3F

// Register: CCP1PPS
#define CCP1PPS CCP1PPS
extern volatile unsigned char           CCP1PPS             __at(0xE19);
#ifndef _LIB_BUILD
asm("CCP1PPS equ 0E19h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1PPS                :6;
    };
} CCP1PPSbits_t;
extern volatile CCP1PPSbits_t CCP1PPSbits __at(0xE19);
// bitfield macros
#define _CCP1PPS_CCP1PPS_POSN                               0x0
#define _CCP1PPS_CCP1PPS_POSITION                           0x0
#define _CCP1PPS_CCP1PPS_SIZE                               0x6
#define _CCP1PPS_CCP1PPS_LENGTH                             0x6
#define _CCP1PPS_CCP1PPS_MASK                               0x3F

// Register: CCP2PPS
#define CCP2PPS CCP2PPS
extern volatile unsigned char           CCP2PPS             __at(0xE1A);
#ifndef _LIB_BUILD
asm("CCP2PPS equ 0E1Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP2PPS                :6;
    };
} CCP2PPSbits_t;
extern volatile CCP2PPSbits_t CCP2PPSbits __at(0xE1A);
// bitfield macros
#define _CCP2PPS_CCP2PPS_POSN                               0x0
#define _CCP2PPS_CCP2PPS_POSITION                           0x0
#define _CCP2PPS_CCP2PPS_SIZE                               0x6
#define _CCP2PPS_CCP2PPS_LENGTH                             0x6
#define _CCP2PPS_CCP2PPS_MASK                               0x3F

// Register: CCP7PPS
#define CCP7PPS CCP7PPS
extern volatile unsigned char           CCP7PPS             __at(0xE1B);
#ifndef _LIB_BUILD
asm("CCP7PPS equ 0E1Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP7PPS                :6;
    };
} CCP7PPSbits_t;
extern volatile CCP7PPSbits_t CCP7PPSbits __at(0xE1B);
// bitfield macros
#define _CCP7PPS_CCP7PPS_POSN                               0x0
#define _CCP7PPS_CCP7PPS_POSITION                           0x0
#define _CCP7PPS_CCP7PPS_SIZE                               0x6
#define _CCP7PPS_CCP7PPS_LENGTH                             0x6
#define _CCP7PPS_CCP7PPS_MASK                               0x3F

// Register: CCP8PPS
#define CCP8PPS CCP8PPS
extern volatile unsigned char           CCP8PPS             __at(0xE1C);
#ifndef _LIB_BUILD
asm("CCP8PPS equ 0E1Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP8PPS                :6;
    };
} CCP8PPSbits_t;
extern volatile CCP8PPSbits_t CCP8PPSbits __at(0xE1C);
// bitfield macros
#define _CCP8PPS_CCP8PPS_POSN                               0x0
#define _CCP8PPS_CCP8PPS_POSITION                           0x0
#define _CCP8PPS_CCP8PPS_SIZE                               0x6
#define _CCP8PPS_CCP8PPS_LENGTH                             0x6
#define _CCP8PPS_CCP8PPS_MASK                               0x3F

// Register: COG1INPPS
#define COG1INPPS COG1INPPS
extern volatile unsigned char           COG1INPPS           __at(0xE1D);
#ifndef _LIB_BUILD
asm("COG1INPPS equ 0E1Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned COG1INPPS              :6;
    };
} COG1INPPSbits_t;
