MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1779/mcu.h
// Register: RC5PPS
#define RC5PPS RC5PPS
extern volatile unsigned char           RC5PPS              __at(0xEA5);
#ifndef _LIB_BUILD
asm("RC5PPS equ 0EA5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC5PPS                 :6;
    };
} RC5PPSbits_t;
extern volatile RC5PPSbits_t RC5PPSbits __at(0xEA5);
// bitfield macros
#define _RC5PPS_RC5PPS_POSN                                 0x0
#define _RC5PPS_RC5PPS_POSITION                             0x0
#define _RC5PPS_RC5PPS_SIZE                                 0x6
#define _RC5PPS_RC5PPS_LENGTH                               0x6
#define _RC5PPS_RC5PPS_MASK                                 0x3F

// Register: RC6PPS
#define RC6PPS RC6PPS
extern volatile unsigned char           RC6PPS              __at(0xEA6);
#ifndef _LIB_BUILD
asm("RC6PPS equ 0EA6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC6PPS                 :6;
    };
} RC6PPSbits_t;
extern volatile RC6PPSbits_t RC6PPSbits __at(0xEA6);
// bitfield macros
#define _RC6PPS_RC6PPS_POSN                                 0x0
#define _RC6PPS_RC6PPS_POSITION                             0x0
#define _RC6PPS_RC6PPS_SIZE                                 0x6
#define _RC6PPS_RC6PPS_LENGTH                               0x6
#define _RC6PPS_RC6PPS_MASK                                 0x3F

// Register: RC7PPS
#define RC7PPS RC7PPS
extern volatile unsigned char           RC7PPS              __at(0xEA7);
#ifndef _LIB_BUILD
asm("RC7PPS equ 0EA7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC7PPS                 :6;
    };
} RC7PPSbits_t;
extern volatile RC7PPSbits_t RC7PPSbits __at(0xEA7);
// bitfield macros
#define _RC7PPS_RC7PPS_POSN                                 0x0
#define _RC7PPS_RC7PPS_POSITION                             0x0
#define _RC7PPS_RC7PPS_SIZE                                 0x6
#define _RC7PPS_RC7PPS_LENGTH                               0x6
#define _RC7PPS_RC7PPS_MASK                                 0x3F

// Register: RD0PPS
#define RD0PPS RD0PPS
extern volatile unsigned char           RD0PPS              __at(0xEA8);
#ifndef _LIB_BUILD
asm("RD0PPS equ 0EA8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD0PPS                 :6;
    };
} RD0PPSbits_t;
extern volatile RD0PPSbits_t RD0PPSbits __at(0xEA8);
// bitfield macros
#define _RD0PPS_RD0PPS_POSN                                 0x0
#define _RD0PPS_RD0PPS_POSITION                             0x0
#define _RD0PPS_RD0PPS_SIZE                                 0x6
#define _RD0PPS_RD0PPS_LENGTH                               0x6
#define _RD0PPS_RD0PPS_MASK                                 0x3F

// Register: RD1PPS
#define RD1PPS RD1PPS
extern volatile unsigned char           RD1PPS              __at(0xEA9);
#ifndef _LIB_BUILD
asm("RD1PPS equ 0EA9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD1PPS                 :6;
    };
} RD1PPSbits_t;
extern volatile RD1PPSbits_t RD1PPSbits __at(0xEA9);
// bitfield macros
#define _RD1PPS_RD1PPS_POSN                                 0x0
#define _RD1PPS_RD1PPS_POSITION                             0x0
#define _RD1PPS_RD1PPS_SIZE                                 0x6
#define _RD1PPS_RD1PPS_LENGTH                               0x6
#define _RD1PPS_RD1PPS_MASK                                 0x3F

// Register: RD2PPS
#define RD2PPS RD2PPS
extern volatile unsigned char           RD2PPS              __at(0xEAA);
#ifndef _LIB_BUILD
asm("RD2PPS equ 0EAAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD2PPS                 :6;
    };
} RD2PPSbits_t;
extern volatile RD2PPSbits_t RD2PPSbits __at(0xEAA);
// bitfield macros
#define _RD2PPS_RD2PPS_POSN                                 0x0
#define _RD2PPS_RD2PPS_POSITION                             0x0
#define _RD2PPS_RD2PPS_SIZE                                 0x6
#define _RD2PPS_RD2PPS_LENGTH                               0x6
#define _RD2PPS_RD2PPS_MASK                                 0x3F

// Register: RD3PPS
#define RD3PPS RD3PPS
extern volatile unsigned char           RD3PPS              __at(0xEAB);
#ifndef _LIB_BUILD
asm("RD3PPS equ 0EABh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD3PPS                 :6;
    };
} RD3PPSbits_t;
extern volatile RD3PPSbits_t RD3PPSbits __at(0xEAB);
// bitfield macros
#define _RD3PPS_RD3PPS_POSN                                 0x0
#define _RD3PPS_RD3PPS_POSITION                             0x0
#define _RD3PPS_RD3PPS_SIZE                                 0x6
#define _RD3PPS_RD3PPS_LENGTH                               0x6
#define _RD3PPS_RD3PPS_MASK                                 0x3F

// Register: RD4PPS
#define RD4PPS RD4PPS
extern volatile unsigned char           RD4PPS              __at(0xEAC);
#ifndef _LIB_BUILD
asm("RD4PPS equ 0EACh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD4PPS                 :6;
    };
} RD4PPSbits_t;
extern volatile RD4PPSbits_t RD4PPSbits __at(0xEAC);
// bitfield macros
#define _RD4PPS_RD4PPS_POSN                                 0x0
#define _RD4PPS_RD4PPS_POSITION                             0x0
#define _RD4PPS_RD4PPS_SIZE                                 0x6
#define _RD4PPS_RD4PPS_LENGTH                               0x6
#define _RD4PPS_RD4PPS_MASK                                 0x3F

// Register: RD5PPS
#define RD5PPS RD5PPS
extern volatile unsigned char           RD5PPS              __at(0xEAD);
#ifndef _LIB_BUILD
asm("RD5PPS equ 0EADh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD5PPS                 :6;
    };
} RD5PPSbits_t;
extern volatile RD5PPSbits_t RD5PPSbits __at(0xEAD);
// bitfield macros
#define _RD5PPS_RD5PPS_POSN                                 0x0
#define _RD5PPS_RD5PPS_POSITION                             0x0
#define _RD5PPS_RD5PPS_SIZE                                 0x6
#define _RD5PPS_RD5PPS_LENGTH                               0x6
#define _RD5PPS_RD5PPS_MASK                                 0x3F

// Register: RD6PPS
#define RD6PPS RD6PPS
extern volatile unsigned char           RD6PPS              __at(0xEAE);
#ifndef _LIB_BUILD
asm("RD6PPS equ 0EAEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD6PPS                 :6;
    };
} RD6PPSbits_t;
extern volatile RD6PPSbits_t RD6PPSbits __at(0xEAE);
// bitfield macros
#define _RD6PPS_RD6PPS_POSN                                 0x0
#define _RD6PPS_RD6PPS_POSITION                             0x0
#define _RD6PPS_RD6PPS_SIZE                                 0x6
#define _RD6PPS_RD6PPS_LENGTH                               0x6
#define _RD6PPS_RD6PPS_MASK                                 0x3F

// Register: RD7PPS
#define RD7PPS RD7PPS
extern volatile unsigned char           RD7PPS              __at(0xEAF);
#ifndef _LIB_BUILD
asm("RD7PPS equ 0EAFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD7PPS                 :6;
    };
} RD7PPSbits_t;
extern volatile RD7PPSbits_t RD7PPSbits __at(0xEAF);
// bitfield macros
#define _RD7PPS_RD7PPS_POSN                                 0x0
#define _RD7PPS_RD7PPS_POSITION                             0x0
#define _RD7PPS_RD7PPS_SIZE                                 0x6
#define _RD7PPS_RD7PPS_LENGTH                               0x6
#define _RD7PPS_RD7PPS_MASK                                 0x3F

// Register: RE0PPS
#define RE0PPS RE0PPS
extern volatile unsigned char           RE0PPS              __at(0xEB0);
#ifndef _LIB_BUILD
asm("RE0PPS equ 0EB0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE0PPS                 :6;
    };
} RE0PPSbits_t;
