MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1779/mcu.h
extern volatile __bit                   DAC2REF10           __at(0x2C9A);	// @ (0x593 * 8 + 2)
#define                                 DAC2REF10_bit       _BIT_ACCESS(DAC2REFH,2)
// DAC2REFH<DAC2REF11>
extern volatile __bit                   DAC2REF11           __at(0x2C9B);	// @ (0x593 * 8 + 3)
#define                                 DAC2REF11_bit       _BIT_ACCESS(DAC2REFH,3)
// DAC2REFH<DAC2REF12>
extern volatile __bit                   DAC2REF12           __at(0x2C9C);	// @ (0x593 * 8 + 4)
#define                                 DAC2REF12_bit       _BIT_ACCESS(DAC2REFH,4)
// DAC2REFH<DAC2REF13>
extern volatile __bit                   DAC2REF13           __at(0x2C9D);	// @ (0x593 * 8 + 5)
#define                                 DAC2REF13_bit       _BIT_ACCESS(DAC2REFH,5)
// DAC2REFH<DAC2REF14>
extern volatile __bit                   DAC2REF14           __at(0x2C9E);	// @ (0x593 * 8 + 6)
#define                                 DAC2REF14_bit       _BIT_ACCESS(DAC2REFH,6)
// DAC2REFH<DAC2REF15>
extern volatile __bit                   DAC2REF15           __at(0x2C9F);	// @ (0x593 * 8 + 7)
#define                                 DAC2REF15_bit       _BIT_ACCESS(DAC2REFH,7)
// DAC2REFL<DAC2REF2>
extern volatile __bit                   DAC2REF2            __at(0x2C92);	// @ (0x592 * 8 + 2)
#define                                 DAC2REF2_bit        _BIT_ACCESS(DAC2REFL,2)
// DAC2REFL<DAC2REF3>
extern volatile __bit                   DAC2REF3            __at(0x2C93);	// @ (0x592 * 8 + 3)
#define                                 DAC2REF3_bit        _BIT_ACCESS(DAC2REFL,3)
// DAC2REFL<DAC2REF4>
extern volatile __bit                   DAC2REF4            __at(0x2C94);	// @ (0x592 * 8 + 4)
#define                                 DAC2REF4_bit        _BIT_ACCESS(DAC2REFL,4)
// DAC2REFL<DAC2REF5>
extern volatile __bit                   DAC2REF5            __at(0x2C95);	// @ (0x592 * 8 + 5)
#define                                 DAC2REF5_bit        _BIT_ACCESS(DAC2REFL,5)
// DAC2REFL<DAC2REF6>
extern volatile __bit                   DAC2REF6            __at(0x2C96);	// @ (0x592 * 8 + 6)
#define                                 DAC2REF6_bit        _BIT_ACCESS(DAC2REFL,6)
// DAC2REFL<DAC2REF7>
extern volatile __bit                   DAC2REF7            __at(0x2C97);	// @ (0x592 * 8 + 7)
#define                                 DAC2REF7_bit        _BIT_ACCESS(DAC2REFL,7)
// DAC2REFH<DAC2REF8>
extern volatile __bit                   DAC2REF8            __at(0x2C98);	// @ (0x593 * 8 + 0)
#define                                 DAC2REF8_bit        _BIT_ACCESS(DAC2REFH,0)
// DAC2REFH<DAC2REF9>
extern volatile __bit                   DAC2REF9            __at(0x2C99);	// @ (0x593 * 8 + 1)
#define                                 DAC2REF9_bit        _BIT_ACCESS(DAC2REFH,1)
// DAC3CON0<DAC3EN>
extern volatile __bit                   DAC3EN              __at(0x2CA7);	// @ (0x594 * 8 + 7)
#define                                 DAC3EN_bit          _BIT_ACCESS(DAC3CON0,7)
// DAC3CON0<DAC3NSS0>
extern volatile __bit                   DAC3NSS0            __at(0x2CA0);	// @ (0x594 * 8 + 0)
#define                                 DAC3NSS0_bit        _BIT_ACCESS(DAC3CON0,0)
// DAC3CON0<DAC3NSS1>
extern volatile __bit                   DAC3NSS1            __at(0x2CA1);	// @ (0x594 * 8 + 1)
#define                                 DAC3NSS1_bit        _BIT_ACCESS(DAC3CON0,1)
// DAC3CON0<DAC3OE1>
extern volatile __bit                   DAC3OE1             __at(0x2CA5);	// @ (0x594 * 8 + 5)
#define                                 DAC3OE1_bit         _BIT_ACCESS(DAC3CON0,5)
// DAC3CON0<DAC3OE2>
extern volatile __bit                   DAC3OE2             __at(0x2CA4);	// @ (0x594 * 8 + 4)
#define                                 DAC3OE2_bit         _BIT_ACCESS(DAC3CON0,4)
// DAC3CON0<DAC3PSS0>
extern volatile __bit                   DAC3PSS0            __at(0x2CA2);	// @ (0x594 * 8 + 2)
#define                                 DAC3PSS0_bit        _BIT_ACCESS(DAC3CON0,2)
// DAC3CON0<DAC3PSS1>
extern volatile __bit                   DAC3PSS1            __at(0x2CA3);	// @ (0x594 * 8 + 3)
#define                                 DAC3PSS1_bit        _BIT_ACCESS(DAC3CON0,3)
// DAC3REF<DAC3R0>
extern volatile __bit                   DAC3R0              __at(0x2CA8);	// @ (0x595 * 8 + 0)
#define                                 DAC3R0_bit          _BIT_ACCESS(DAC3REF,0)
// DAC3REF<DAC3R1>
extern volatile __bit                   DAC3R1              __at(0x2CA9);	// @ (0x595 * 8 + 1)
#define                                 DAC3R1_bit          _BIT_ACCESS(DAC3REF,1)
// DAC3REF<DAC3R2>
extern volatile __bit                   DAC3R2              __at(0x2CAA);	// @ (0x595 * 8 + 2)
#define                                 DAC3R2_bit          _BIT_ACCESS(DAC3REF,2)
// DAC3REF<DAC3R3>
extern volatile __bit                   DAC3R3              __at(0x2CAB);	// @ (0x595 * 8 + 3)
#define                                 DAC3R3_bit          _BIT_ACCESS(DAC3REF,3)
// DAC3REF<DAC3R4>
extern volatile __bit                   DAC3R4              __at(0x2CAC);	// @ (0x595 * 8 + 4)
#define                                 DAC3R4_bit          _BIT_ACCESS(DAC3REF,4)
// DAC3REF<DAC3REF0>
extern volatile __bit                   DAC3REF0            __at(0x2CA8);	// @ (0x595 * 8 + 0)
#define                                 DAC3REF0_bit        _BIT_ACCESS(DAC3REF,0)
// DAC3REF<DAC3REF1>
extern volatile __bit                   DAC3REF1            __at(0x2CA9);	// @ (0x595 * 8 + 1)
#define                                 DAC3REF1_bit        _BIT_ACCESS(DAC3REF,1)
// DAC3REF<DAC3REF2>
extern volatile __bit                   DAC3REF2            __at(0x2CAA);	// @ (0x595 * 8 + 2)
#define                                 DAC3REF2_bit        _BIT_ACCESS(DAC3REF,2)
// DAC3REF<DAC3REF3>
extern volatile __bit                   DAC3REF3            __at(0x2CAB);	// @ (0x595 * 8 + 3)
#define                                 DAC3REF3_bit        _BIT_ACCESS(DAC3REF,3)
// DAC3REF<DAC3REF4>
extern volatile __bit                   DAC3REF4            __at(0x2CAC);	// @ (0x595 * 8 + 4)
#define                                 DAC3REF4_bit        _BIT_ACCESS(DAC3REF,4)
// DAC4CON0<DAC4EN>
extern volatile __bit                   DAC4EN              __at(0x2CB7);	// @ (0x596 * 8 + 7)
#define                                 DAC4EN_bit          _BIT_ACCESS(DAC4CON0,7)
// DAC4CON0<DAC4NSS0>
extern volatile __bit                   DAC4NSS0            __at(0x2CB0);	// @ (0x596 * 8 + 0)
#define                                 DAC4NSS0_bit        _BIT_ACCESS(DAC4CON0,0)
// DAC4CON0<DAC4NSS1>
extern volatile __bit                   DAC4NSS1            __at(0x2CB1);	// @ (0x596 * 8 + 1)
#define                                 DAC4NSS1_bit        _BIT_ACCESS(DAC4CON0,1)
// DAC4CON0<DAC4OE1>
extern volatile __bit                   DAC4OE1             __at(0x2CB5);	// @ (0x596 * 8 + 5)
#define                                 DAC4OE1_bit         _BIT_ACCESS(DAC4CON0,5)
// DAC4CON0<DAC4OE2>
extern volatile __bit                   DAC4OE2             __at(0x2CB4);	// @ (0x596 * 8 + 4)
#define                                 DAC4OE2_bit         _BIT_ACCESS(DAC4CON0,4)
// DAC4CON0<DAC4PSS0>
extern volatile __bit                   DAC4PSS0            __at(0x2CB2);	// @ (0x596 * 8 + 2)
#define                                 DAC4PSS0_bit        _BIT_ACCESS(DAC4CON0,2)
// DAC4CON0<DAC4PSS1>
extern volatile __bit                   DAC4PSS1            __at(0x2CB3);	// @ (0x596 * 8 + 3)
#define                                 DAC4PSS1_bit        _BIT_ACCESS(DAC4CON0,3)
// DAC4REF<DAC4R0>
extern volatile __bit                   DAC4R0              __at(0x2CB8);	// @ (0x597 * 8 + 0)
#define                                 DAC4R0_bit          _BIT_ACCESS(DAC4REF,0)
// DAC4REF<DAC4R1>
extern volatile __bit                   DAC4R1              __at(0x2CB9);	// @ (0x597 * 8 + 1)
#define                                 DAC4R1_bit          _BIT_ACCESS(DAC4REF,1)
// DAC4REF<DAC4R2>
extern volatile __bit                   DAC4R2              __at(0x2CBA);	// @ (0x597 * 8 + 2)
#define                                 DAC4R2_bit          _BIT_ACCESS(DAC4REF,2)
// DAC4REF<DAC4R3>
extern volatile __bit                   DAC4R3              __at(0x2CBB);	// @ (0x597 * 8 + 3)
#define                                 DAC4R3_bit          _BIT_ACCESS(DAC4REF,3)
// DAC4REF<DAC4R4>
extern volatile __bit                   DAC4R4              __at(0x2CBC);	// @ (0x597 * 8 + 4)
#define                                 DAC4R4_bit          _BIT_ACCESS(DAC4REF,4)
// DAC4REF<DAC4REF0>
extern volatile __bit                   DAC4REF0            __at(0x2CB8);	// @ (0x597 * 8 + 0)
#define                                 DAC4REF0_bit        _BIT_ACCESS(DAC4REF,0)
// DAC4REF<DAC4REF1>
extern volatile __bit                   DAC4REF1            __at(0x2CB9);	// @ (0x597 * 8 + 1)
#define                                 DAC4REF1_bit        _BIT_ACCESS(DAC4REF,1)
// DAC4REF<DAC4REF2>
extern volatile __bit                   DAC4REF2            __at(0x2CBA);	// @ (0x597 * 8 + 2)
#define                                 DAC4REF2_bit        _BIT_ACCESS(DAC4REF,2)
// DAC4REF<DAC4REF3>
extern volatile __bit                   DAC4REF3            __at(0x2CBB);	// @ (0x597 * 8 + 3)
#define                                 DAC4REF3_bit        _BIT_ACCESS(DAC4REF,3)
// DAC4REF<DAC4REF4>
extern volatile __bit                   DAC4REF4            __at(0x2CBC);	// @ (0x597 * 8 + 4)
#define                                 DAC4REF4_bit        _BIT_ACCESS(DAC4REF,4)
// DAC5CON0<DAC5EN>
extern volatile __bit                   DAC5EN              __at(0x2CC7);	// @ (0x598 * 8 + 7)
#define                                 DAC5EN_bit          _BIT_ACCESS(DAC5CON0,7)
// DAC5CON0<DAC5FM>
extern volatile __bit                   DAC5FM              __at(0x2CC6);	// @ (0x598 * 8 + 6)
#define                                 DAC5FM_bit          _BIT_ACCESS(DAC5CON0,6)
// DACLD<DAC5LD>
extern volatile __bit                   DAC5LD              __at(0x2C6C);	// @ (0x58D * 8 + 4)
#define                                 DAC5LD_bit          _BIT_ACCESS(DACLD,4)
// DAC5CON0<DAC5NSS0>
extern volatile __bit                   DAC5NSS0            __at(0x2CC0);	// @ (0x598 * 8 + 0)
#define                                 DAC5NSS0_bit        _BIT_ACCESS(DAC5CON0,0)
// DAC5CON0<DAC5NSS1>
extern volatile __bit                   DAC5NSS1            __at(0x2CC1);	// @ (0x598 * 8 + 1)
#define                                 DAC5NSS1_bit        _BIT_ACCESS(DAC5CON0,1)
// DAC5CON0<DAC5OE1>
extern volatile __bit                   DAC5OE1             __at(0x2CC5);	// @ (0x598 * 8 + 5)
#define                                 DAC5OE1_bit         _BIT_ACCESS(DAC5CON0,5)
// DAC5CON0<DAC5OE2>
extern volatile __bit                   DAC5OE2             __at(0x2CC4);	// @ (0x598 * 8 + 4)
#define                                 DAC5OE2_bit         _BIT_ACCESS(DAC5CON0,4)
// DAC5CON0<DAC5PSS0>
extern volatile __bit                   DAC5PSS0            __at(0x2CC2);	// @ (0x598 * 8 + 2)
#define                                 DAC5PSS0_bit        _BIT_ACCESS(DAC5CON0,2)
// DAC5CON0<DAC5PSS1>
extern volatile __bit                   DAC5PSS1            __at(0x2CC3);	// @ (0x598 * 8 + 3)
#define                                 DAC5PSS1_bit        _BIT_ACCESS(DAC5CON0,3)
// DAC5REFL<DAC5R0>
extern volatile __bit                   DAC5R0              __at(0x2CC8);	// @ (0x599 * 8 + 0)
#define                                 DAC5R0_bit          _BIT_ACCESS(DAC5REFL,0)
// DAC5REFL<DAC5R1>
extern volatile __bit                   DAC5R1              __at(0x2CC9);	// @ (0x599 * 8 + 1)
#define                                 DAC5R1_bit          _BIT_ACCESS(DAC5REFL,1)
// DAC5REFH<DAC5R10>
extern volatile __bit                   DAC5R10             __at(0x2CD2);	// @ (0x59A * 8 + 2)
#define                                 DAC5R10_bit         _BIT_ACCESS(DAC5REFH,2)
// DAC5REFH<DAC5R11>
extern volatile __bit                   DAC5R11             __at(0x2CD3);	// @ (0x59A * 8 + 3)
#define                                 DAC5R11_bit         _BIT_ACCESS(DAC5REFH,3)
// DAC5REFH<DAC5R12>
extern volatile __bit                   DAC5R12             __at(0x2CD4);	// @ (0x59A * 8 + 4)
#define                                 DAC5R12_bit         _BIT_ACCESS(DAC5REFH,4)
// DAC5REFH<DAC5R13>
extern volatile __bit                   DAC5R13             __at(0x2CD5);	// @ (0x59A * 8 + 5)
#define                                 DAC5R13_bit         _BIT_ACCESS(DAC5REFH,5)
// DAC5REFH<DAC5R14>
extern volatile __bit                   DAC5R14             __at(0x2CD6);	// @ (0x59A * 8 + 6)
#define                                 DAC5R14_bit         _BIT_ACCESS(DAC5REFH,6)
// DAC5REFH<DAC5R15>
extern volatile __bit                   DAC5R15             __at(0x2CD7);	// @ (0x59A * 8 + 7)
#define                                 DAC5R15_bit         _BIT_ACCESS(DAC5REFH,7)
// DAC5REFL<DAC5R2>
extern volatile __bit                   DAC5R2              __at(0x2CCA);	// @ (0x599 * 8 + 2)
#define                                 DAC5R2_bit          _BIT_ACCESS(DAC5REFL,2)
// DAC5REFL<DAC5R3>
extern volatile __bit                   DAC5R3              __at(0x2CCB);	// @ (0x599 * 8 + 3)
#define                                 DAC5R3_bit          _BIT_ACCESS(DAC5REFL,3)
// DAC5REFL<DAC5R4>
extern volatile __bit                   DAC5R4              __at(0x2CCC);	// @ (0x599 * 8 + 4)
#define                                 DAC5R4_bit          _BIT_ACCESS(DAC5REFL,4)
// DAC5REFL<DAC5R5>
extern volatile __bit                   DAC5R5              __at(0x2CCD);	// @ (0x599 * 8 + 5)
#define                                 DAC5R5_bit          _BIT_ACCESS(DAC5REFL,5)
// DAC5REFL<DAC5R6>
extern volatile __bit                   DAC5R6              __at(0x2CCE);	// @ (0x599 * 8 + 6)
#define                                 DAC5R6_bit          _BIT_ACCESS(DAC5REFL,6)
// DAC5REFL<DAC5R7>
extern volatile __bit                   DAC5R7              __at(0x2CCF);	// @ (0x599 * 8 + 7)
#define                                 DAC5R7_bit          _BIT_ACCESS(DAC5REFL,7)
// DAC5REFH<DAC5R8>
extern volatile __bit                   DAC5R8              __at(0x2CD0);	// @ (0x59A * 8 + 0)
#define                                 DAC5R8_bit          _BIT_ACCESS(DAC5REFH,0)
// DAC5REFH<DAC5R9>
extern volatile __bit                   DAC5R9              __at(0x2CD1);	// @ (0x59A * 8 + 1)
#define                                 DAC5R9_bit          _BIT_ACCESS(DAC5REFH,1)
// DAC5REFL<DAC5REF0>
extern volatile __bit                   DAC5REF0            __at(0x2CC8);	// @ (0x599 * 8 + 0)
#define                                 DAC5REF0_bit        _BIT_ACCESS(DAC5REFL,0)
// DAC5REFL<DAC5REF1>
extern volatile __bit                   DAC5REF1            __at(0x2CC9);	// @ (0x599 * 8 + 1)
#define                                 DAC5REF1_bit        _BIT_ACCESS(DAC5REFL,1)
// DAC5REFH<DAC5REF10>
extern volatile __bit                   DAC5REF10           __at(0x2CD2);	// @ (0x59A * 8 + 2)
#define                                 DAC5REF10_bit       _BIT_ACCESS(DAC5REFH,2)
// DAC5REFH<DAC5REF11>
extern volatile __bit                   DAC5REF11           __at(0x2CD3);	// @ (0x59A * 8 + 3)
#define                                 DAC5REF11_bit       _BIT_ACCESS(DAC5REFH,3)
// DAC5REFH<DAC5REF12>
extern volatile __bit                   DAC5REF12           __at(0x2CD4);	// @ (0x59A * 8 + 4)
#define                                 DAC5REF12_bit       _BIT_ACCESS(DAC5REFH,4)
// DAC5REFH<DAC5REF13>
extern volatile __bit                   DAC5REF13           __at(0x2CD5);	// @ (0x59A * 8 + 5)
#define                                 DAC5REF13_bit       _BIT_ACCESS(DAC5REFH,5)
// DAC5REFH<DAC5REF14>
extern volatile __bit                   DAC5REF14           __at(0x2CD6);	// @ (0x59A * 8 + 6)
#define                                 DAC5REF14_bit       _BIT_ACCESS(DAC5REFH,6)
// DAC5REFH<DAC5REF15>
extern volatile __bit                   DAC5REF15           __at(0x2CD7);	// @ (0x59A * 8 + 7)
#define                                 DAC5REF15_bit       _BIT_ACCESS(DAC5REFH,7)
// DAC5REFL<DAC5REF2>
extern volatile __bit                   DAC5REF2            __at(0x2CCA);	// @ (0x599 * 8 + 2)
#define                                 DAC5REF2_bit        _BIT_ACCESS(DAC5REFL,2)
// DAC5REFL<DAC5REF3>
extern volatile __bit                   DAC5REF3            __at(0x2CCB);	// @ (0x599 * 8 + 3)
#define                                 DAC5REF3_bit        _BIT_ACCESS(DAC5REFL,3)
// DAC5REFL<DAC5REF4>
extern volatile __bit                   DAC5REF4            __at(0x2CCC);	// @ (0x599 * 8 + 4)
#define                                 DAC5REF4_bit        _BIT_ACCESS(DAC5REFL,4)
// DAC5REFL<DAC5REF5>
extern volatile __bit                   DAC5REF5            __at(0x2CCD);	// @ (0x599 * 8 + 5)
#define                                 DAC5REF5_bit        _BIT_ACCESS(DAC5REFL,5)
// DAC5REFL<DAC5REF6>
extern volatile __bit                   DAC5REF6            __at(0x2CCE);	// @ (0x599 * 8 + 6)
#define                                 DAC5REF6_bit        _BIT_ACCESS(DAC5REFL,6)
// DAC5REFL<DAC5REF7>
extern volatile __bit                   DAC5REF7            __at(0x2CCF);	// @ (0x599 * 8 + 7)
#define                                 DAC5REF7_bit        _BIT_ACCESS(DAC5REFL,7)
// DAC5REFH<DAC5REF8>
extern volatile __bit                   DAC5REF8            __at(0x2CD0);	// @ (0x59A * 8 + 0)
#define                                 DAC5REF8_bit        _BIT_ACCESS(DAC5REFH,0)
// DAC5REFH<DAC5REF9>
extern volatile __bit                   DAC5REF9            __at(0x2CD1);	// @ (0x59A * 8 + 1)
#define                                 DAC5REF9_bit        _BIT_ACCESS(DAC5REFH,1)
// DAC6CON0<DAC6EN>
extern volatile __bit                   DAC6EN              __at(0x2CDF);	// @ (0x59B * 8 + 7)
#define                                 DAC6EN_bit          _BIT_ACCESS(DAC6CON0,7)
// DAC6CON0<DAC6FM>
extern volatile __bit                   DAC6FM              __at(0x2CDE);	// @ (0x59B * 8 + 6)
#define                                 DAC6FM_bit          _BIT_ACCESS(DAC6CON0,6)
// DACLD<DAC6LD>
extern volatile __bit                   DAC6LD              __at(0x2C6D);	// @ (0x58D * 8 + 5)
#define                                 DAC6LD_bit          _BIT_ACCESS(DACLD,5)
// DAC6CON0<DAC6NSS0>
extern volatile __bit                   DAC6NSS0            __at(0x2CD8);	// @ (0x59B * 8 + 0)
#define                                 DAC6NSS0_bit        _BIT_ACCESS(DAC6CON0,0)
// DAC6CON0<DAC6NSS1>
extern volatile __bit                   DAC6NSS1            __at(0x2CD9);	// @ (0x59B * 8 + 1)
#define                                 DAC6NSS1_bit        _BIT_ACCESS(DAC6CON0,1)
// DAC6CON0<DAC6OE1>
extern volatile __bit                   DAC6OE1             __at(0x2CDD);	// @ (0x59B * 8 + 5)
#define                                 DAC6OE1_bit         _BIT_ACCESS(DAC6CON0,5)
// DAC6CON0<DAC6OE2>
extern volatile __bit                   DAC6OE2             __at(0x2CDC);	// @ (0x59B * 8 + 4)
#define                                 DAC6OE2_bit         _BIT_ACCESS(DAC6CON0,4)
// DAC6CON0<DAC6PSS0>
extern volatile __bit                   DAC6PSS0            __at(0x2CDA);	// @ (0x59B * 8 + 2)
#define                                 DAC6PSS0_bit        _BIT_ACCESS(DAC6CON0,2)
// DAC6CON0<DAC6PSS1>
extern volatile __bit                   DAC6PSS1            __at(0x2CDB);	// @ (0x59B * 8 + 3)
#define                                 DAC6PSS1_bit        _BIT_ACCESS(DAC6CON0,3)
// DAC6REFL<DAC6R0>
extern volatile __bit                   DAC6R0              __at(0x2CE0);	// @ (0x59C * 8 + 0)
#define                                 DAC6R0_bit          _BIT_ACCESS(DAC6REFL,0)
// DAC6REFL<DAC6R1>
extern volatile __bit                   DAC6R1              __at(0x2CE1);	// @ (0x59C * 8 + 1)
#define                                 DAC6R1_bit          _BIT_ACCESS(DAC6REFL,1)
// DAC6REFH<DAC6R10>
extern volatile __bit                   DAC6R10             __at(0x2CEA);	// @ (0x59D * 8 + 2)
#define                                 DAC6R10_bit         _BIT_ACCESS(DAC6REFH,2)
// DAC6REFH<DAC6R11>
extern volatile __bit                   DAC6R11             __at(0x2CEB);	// @ (0x59D * 8 + 3)
#define                                 DAC6R11_bit         _BIT_ACCESS(DAC6REFH,3)
// DAC6REFH<DAC6R12>
extern volatile __bit                   DAC6R12             __at(0x2CEC);	// @ (0x59D * 8 + 4)
#define                                 DAC6R12_bit         _BIT_ACCESS(DAC6REFH,4)
// DAC6REFH<DAC6R13>
extern volatile __bit                   DAC6R13             __at(0x2CED);	// @ (0x59D * 8 + 5)
#define                                 DAC6R13_bit         _BIT_ACCESS(DAC6REFH,5)
// DAC6REFH<DAC6R14>
extern volatile __bit                   DAC6R14             __at(0x2CEE);	// @ (0x59D * 8 + 6)
#define                                 DAC6R14_bit         _BIT_ACCESS(DAC6REFH,6)
// DAC6REFH<DAC6R15>
extern volatile __bit                   DAC6R15             __at(0x2CEF);	// @ (0x59D * 8 + 7)
#define                                 DAC6R15_bit         _BIT_ACCESS(DAC6REFH,7)
// DAC6REFL<DAC6R2>
extern volatile __bit                   DAC6R2              __at(0x2CE2);	// @ (0x59C * 8 + 2)
#define                                 DAC6R2_bit          _BIT_ACCESS(DAC6REFL,2)
// DAC6REFL<DAC6R3>
extern volatile __bit                   DAC6R3              __at(0x2CE3);	// @ (0x59C * 8 + 3)
#define                                 DAC6R3_bit          _BIT_ACCESS(DAC6REFL,3)
// DAC6REFL<DAC6R4>
extern volatile __bit                   DAC6R4              __at(0x2CE4);	// @ (0x59C * 8 + 4)
#define                                 DAC6R4_bit          _BIT_ACCESS(DAC6REFL,4)
// DAC6REFL<DAC6R5>
extern volatile __bit                   DAC6R5              __at(0x2CE5);	// @ (0x59C * 8 + 5)
#define                                 DAC6R5_bit          _BIT_ACCESS(DAC6REFL,5)
// DAC6REFL<DAC6R6>
extern volatile __bit                   DAC6R6              __at(0x2CE6);	// @ (0x59C * 8 + 6)
#define                                 DAC6R6_bit          _BIT_ACCESS(DAC6REFL,6)
// DAC6REFL<DAC6R7>
extern volatile __bit                   DAC6R7              __at(0x2CE7);	// @ (0x59C * 8 + 7)
#define                                 DAC6R7_bit          _BIT_ACCESS(DAC6REFL,7)
// DAC6REFH<DAC6R8>
extern volatile __bit                   DAC6R8              __at(0x2CE8);	// @ (0x59D * 8 + 0)
#define                                 DAC6R8_bit          _BIT_ACCESS(DAC6REFH,0)
// DAC6REFH<DAC6R9>
extern volatile __bit                   DAC6R9              __at(0x2CE9);	// @ (0x59D * 8 + 1)
#define                                 DAC6R9_bit          _BIT_ACCESS(DAC6REFH,1)
// DAC6REFL<DAC6REF0>
extern volatile __bit                   DAC6REF0            __at(0x2CE0);	// @ (0x59C * 8 + 0)
#define                                 DAC6REF0_bit        _BIT_ACCESS(DAC6REFL,0)
// DAC6REFL<DAC6REF1>
extern volatile __bit                   DAC6REF1            __at(0x2CE1);	// @ (0x59C * 8 + 1)
#define                                 DAC6REF1_bit        _BIT_ACCESS(DAC6REFL,1)
// DAC6REFH<DAC6REF10>
extern volatile __bit                   DAC6REF10           __at(0x2CEA);	// @ (0x59D * 8 + 2)
#define                                 DAC6REF10_bit       _BIT_ACCESS(DAC6REFH,2)
// DAC6REFH<DAC6REF11>
extern volatile __bit                   DAC6REF11           __at(0x2CEB);	// @ (0x59D * 8 + 3)
#define                                 DAC6REF11_bit       _BIT_ACCESS(DAC6REFH,3)
// DAC6REFH<DAC6REF12>
extern volatile __bit                   DAC6REF12           __at(0x2CEC);	// @ (0x59D * 8 + 4)
#define                                 DAC6REF12_bit       _BIT_ACCESS(DAC6REFH,4)
// DAC6REFH<DAC6REF13>
extern volatile __bit                   DAC6REF13           __at(0x2CED);	// @ (0x59D * 8 + 5)
#define                                 DAC6REF13_bit       _BIT_ACCESS(DAC6REFH,5)
// DAC6REFH<DAC6REF14>
