MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1779/mcu.h
#define                                 G1FSIM3_bit         _BIT_ACCESS(COG1FSIM0,3)
// COG1FSIM0<G1FSIM4>
extern volatile __bit                   G1FSIM4             __at(0x34DC);	// @ (0x69B * 8 + 4)
#define                                 G1FSIM4_bit         _BIT_ACCESS(COG1FSIM0,4)
// COG1FSIM0<G1FSIM5>
extern volatile __bit                   G1FSIM5             __at(0x34DD);	// @ (0x69B * 8 + 5)
#define                                 G1FSIM5_bit         _BIT_ACCESS(COG1FSIM0,5)
// COG1FSIM0<G1FSIM6>
extern volatile __bit                   G1FSIM6             __at(0x34DE);	// @ (0x69B * 8 + 6)
#define                                 G1FSIM6_bit         _BIT_ACCESS(COG1FSIM0,6)
// COG1FSIM0<G1FSIM7>
extern volatile __bit                   G1FSIM7             __at(0x34DF);	// @ (0x69B * 8 + 7)
#define                                 G1FSIM7_bit         _BIT_ACCESS(COG1FSIM0,7)
// COG1FSIM1<G1FSIM8>
extern volatile __bit                   G1FSIM8             __at(0x34E0);	// @ (0x69C * 8 + 0)
#define                                 G1FSIM8_bit         _BIT_ACCESS(COG1FSIM1,0)
// COG1FSIM1<G1FSIM9>
extern volatile __bit                   G1FSIM9             __at(0x34E1);	// @ (0x69C * 8 + 1)
#define                                 G1FSIM9_bit         _BIT_ACCESS(COG1FSIM1,1)
// COG1CON0<G1LD>
extern volatile __bit                   G1LD                __at(0x349E);	// @ (0x693 * 8 + 6)
#define                                 G1LD_bit            _BIT_ACCESS(COG1CON0,6)
// COG1CON0<G1MD0>
extern volatile __bit                   G1MD0               __at(0x3498);	// @ (0x693 * 8 + 0)
#define                                 G1MD0_bit           _BIT_ACCESS(COG1CON0,0)
// COG1CON0<G1MD1>
extern volatile __bit                   G1MD1               __at(0x3499);	// @ (0x693 * 8 + 1)
#define                                 G1MD1_bit           _BIT_ACCESS(COG1CON0,1)
// COG1CON0<G1MD2>
extern volatile __bit                   G1MD2               __at(0x349A);	// @ (0x693 * 8 + 2)
#define                                 G1MD2_bit           _BIT_ACCESS(COG1CON0,2)
// COG1PHF<G1PHF0>
extern volatile __bit                   G1PHF0              __at(0x3470);	// @ (0x68E * 8 + 0)
#define                                 G1PHF0_bit          _BIT_ACCESS(COG1PHF,0)
// COG1PHF<G1PHF1>
extern volatile __bit                   G1PHF1              __at(0x3471);	// @ (0x68E * 8 + 1)
#define                                 G1PHF1_bit          _BIT_ACCESS(COG1PHF,1)
// COG1PHF<G1PHF2>
extern volatile __bit                   G1PHF2              __at(0x3472);	// @ (0x68E * 8 + 2)
#define                                 G1PHF2_bit          _BIT_ACCESS(COG1PHF,2)
// COG1PHF<G1PHF3>
extern volatile __bit                   G1PHF3              __at(0x3473);	// @ (0x68E * 8 + 3)
#define                                 G1PHF3_bit          _BIT_ACCESS(COG1PHF,3)
// COG1PHF<G1PHF4>
extern volatile __bit                   G1PHF4              __at(0x3474);	// @ (0x68E * 8 + 4)
#define                                 G1PHF4_bit          _BIT_ACCESS(COG1PHF,4)
// COG1PHF<G1PHF5>
extern volatile __bit                   G1PHF5              __at(0x3475);	// @ (0x68E * 8 + 5)
#define                                 G1PHF5_bit          _BIT_ACCESS(COG1PHF,5)
// COG1PHR<G1PHR0>
extern volatile __bit                   G1PHR0              __at(0x3468);	// @ (0x68D * 8 + 0)
#define                                 G1PHR0_bit          _BIT_ACCESS(COG1PHR,0)
// COG1PHR<G1PHR1>
extern volatile __bit                   G1PHR1              __at(0x3469);	// @ (0x68D * 8 + 1)
#define                                 G1PHR1_bit          _BIT_ACCESS(COG1PHR,1)
// COG1PHR<G1PHR2>
extern volatile __bit                   G1PHR2              __at(0x346A);	// @ (0x68D * 8 + 2)
#define                                 G1PHR2_bit          _BIT_ACCESS(COG1PHR,2)
// COG1PHR<G1PHR3>
extern volatile __bit                   G1PHR3              __at(0x346B);	// @ (0x68D * 8 + 3)
#define                                 G1PHR3_bit          _BIT_ACCESS(COG1PHR,3)
// COG1PHR<G1PHR4>
extern volatile __bit                   G1PHR4              __at(0x346C);	// @ (0x68D * 8 + 4)
#define                                 G1PHR4_bit          _BIT_ACCESS(COG1PHR,4)
// COG1PHR<G1PHR5>
extern volatile __bit                   G1PHR5              __at(0x346D);	// @ (0x68D * 8 + 5)
#define                                 G1PHR5_bit          _BIT_ACCESS(COG1PHR,5)
// COG1CON1<G1POLA>
extern volatile __bit                   G1POLA              __at(0x34A0);	// @ (0x694 * 8 + 0)
#define                                 G1POLA_bit          _BIT_ACCESS(COG1CON1,0)
// COG1CON1<G1POLB>
extern volatile __bit                   G1POLB              __at(0x34A1);	// @ (0x694 * 8 + 1)
#define                                 G1POLB_bit          _BIT_ACCESS(COG1CON1,1)
// COG1CON1<G1POLC>
extern volatile __bit                   G1POLC              __at(0x34A2);	// @ (0x694 * 8 + 2)
#define                                 G1POLC_bit          _BIT_ACCESS(COG1CON1,2)
// COG1CON1<G1POLD>
extern volatile __bit                   G1POLD              __at(0x34A3);	// @ (0x694 * 8 + 3)
#define                                 G1POLD_bit          _BIT_ACCESS(COG1CON1,3)
// COG1CON1<G1RDBS>
extern volatile __bit                   G1RDBS              __at(0x34A7);	// @ (0x694 * 8 + 7)
#define                                 G1RDBS_bit          _BIT_ACCESS(COG1CON1,7)
// COG1RIS0<G1RIS0>
extern volatile __bit                   G1RIS0              __at(0x34A8);	// @ (0x695 * 8 + 0)
#define                                 G1RIS0_bit          _BIT_ACCESS(COG1RIS0,0)
// COG1RIS0<G1RIS1>
extern volatile __bit                   G1RIS1              __at(0x34A9);	// @ (0x695 * 8 + 1)
#define                                 G1RIS1_bit          _BIT_ACCESS(COG1RIS0,1)
// COG1RIS1<G1RIS10>
extern volatile __bit                   G1RIS10             __at(0x34B2);	// @ (0x696 * 8 + 2)
#define                                 G1RIS10_bit         _BIT_ACCESS(COG1RIS1,2)
// COG1RIS1<G1RIS11>
extern volatile __bit                   G1RIS11             __at(0x34B3);	// @ (0x696 * 8 + 3)
#define                                 G1RIS11_bit         _BIT_ACCESS(COG1RIS1,3)
// COG1RIS1<G1RIS12>
extern volatile __bit                   G1RIS12             __at(0x34B4);	// @ (0x696 * 8 + 4)
#define                                 G1RIS12_bit         _BIT_ACCESS(COG1RIS1,4)
// COG1RIS1<G1RIS13>
extern volatile __bit                   G1RIS13             __at(0x34B5);	// @ (0x696 * 8 + 5)
#define                                 G1RIS13_bit         _BIT_ACCESS(COG1RIS1,5)
// COG1RIS1<G1RIS14>
extern volatile __bit                   G1RIS14             __at(0x34B6);	// @ (0x696 * 8 + 6)
#define                                 G1RIS14_bit         _BIT_ACCESS(COG1RIS1,6)
// COG1RIS1<G1RIS15>
extern volatile __bit                   G1RIS15             __at(0x34B7);	// @ (0x696 * 8 + 7)
#define                                 G1RIS15_bit         _BIT_ACCESS(COG1RIS1,7)
// COG1RIS0<G1RIS2>
extern volatile __bit                   G1RIS2              __at(0x34AA);	// @ (0x695 * 8 + 2)
#define                                 G1RIS2_bit          _BIT_ACCESS(COG1RIS0,2)
// COG1RIS0<G1RIS3>
extern volatile __bit                   G1RIS3              __at(0x34AB);	// @ (0x695 * 8 + 3)
#define                                 G1RIS3_bit          _BIT_ACCESS(COG1RIS0,3)
// COG1RIS0<G1RIS4>
extern volatile __bit                   G1RIS4              __at(0x34AC);	// @ (0x695 * 8 + 4)
#define                                 G1RIS4_bit          _BIT_ACCESS(COG1RIS0,4)
// COG1RIS0<G1RIS5>
extern volatile __bit                   G1RIS5              __at(0x34AD);	// @ (0x695 * 8 + 5)
#define                                 G1RIS5_bit          _BIT_ACCESS(COG1RIS0,5)
// COG1RIS0<G1RIS6>
extern volatile __bit                   G1RIS6              __at(0x34AE);	// @ (0x695 * 8 + 6)
#define                                 G1RIS6_bit          _BIT_ACCESS(COG1RIS0,6)
// COG1RIS0<G1RIS7>
extern volatile __bit                   G1RIS7              __at(0x34AF);	// @ (0x695 * 8 + 7)
#define                                 G1RIS7_bit          _BIT_ACCESS(COG1RIS0,7)
// COG1RIS1<G1RIS8>
extern volatile __bit                   G1RIS8              __at(0x34B0);	// @ (0x696 * 8 + 0)
#define                                 G1RIS8_bit          _BIT_ACCESS(COG1RIS1,0)
// COG1RIS1<G1RIS9>
extern volatile __bit                   G1RIS9              __at(0x34B1);	// @ (0x696 * 8 + 1)
#define                                 G1RIS9_bit          _BIT_ACCESS(COG1RIS1,1)
// COG1RSIM0<G1RSIM0>
extern volatile __bit                   G1RSIM0             __at(0x34B8);	// @ (0x697 * 8 + 0)
#define                                 G1RSIM0_bit         _BIT_ACCESS(COG1RSIM0,0)
// COG1RSIM0<G1RSIM1>
extern volatile __bit                   G1RSIM1             __at(0x34B9);	// @ (0x697 * 8 + 1)
#define                                 G1RSIM1_bit         _BIT_ACCESS(COG1RSIM0,1)
// COG1RSIM1<G1RSIM10>
extern volatile __bit                   G1RSIM10            __at(0x34C2);	// @ (0x698 * 8 + 2)
#define                                 G1RSIM10_bit        _BIT_ACCESS(COG1RSIM1,2)
// COG1RSIM1<G1RSIM11>
extern volatile __bit                   G1RSIM11            __at(0x34C3);	// @ (0x698 * 8 + 3)
#define                                 G1RSIM11_bit        _BIT_ACCESS(COG1RSIM1,3)
// COG1RSIM1<G1RSIM12>
extern volatile __bit                   G1RSIM12            __at(0x34C4);	// @ (0x698 * 8 + 4)
#define                                 G1RSIM12_bit        _BIT_ACCESS(COG1RSIM1,4)
// COG1RSIM1<G1RSIM13>
extern volatile __bit                   G1RSIM13            __at(0x34C5);	// @ (0x698 * 8 + 5)
#define                                 G1RSIM13_bit        _BIT_ACCESS(COG1RSIM1,5)
// COG1RSIM1<G1RSIM14>
extern volatile __bit                   G1RSIM14            __at(0x34C6);	// @ (0x698 * 8 + 6)
#define                                 G1RSIM14_bit        _BIT_ACCESS(COG1RSIM1,6)
// COG1RSIM1<G1RSIM15>
extern volatile __bit                   G1RSIM15            __at(0x34C7);	// @ (0x698 * 8 + 7)
#define                                 G1RSIM15_bit        _BIT_ACCESS(COG1RSIM1,7)
// COG1RSIM0<G1RSIM2>
extern volatile __bit                   G1RSIM2             __at(0x34BA);	// @ (0x697 * 8 + 2)
#define                                 G1RSIM2_bit         _BIT_ACCESS(COG1RSIM0,2)
// COG1RSIM0<G1RSIM3>
extern volatile __bit                   G1RSIM3             __at(0x34BB);	// @ (0x697 * 8 + 3)
#define                                 G1RSIM3_bit         _BIT_ACCESS(COG1RSIM0,3)
// COG1RSIM0<G1RSIM4>
extern volatile __bit                   G1RSIM4             __at(0x34BC);	// @ (0x697 * 8 + 4)
#define                                 G1RSIM4_bit         _BIT_ACCESS(COG1RSIM0,4)
// COG1RSIM0<G1RSIM5>
extern volatile __bit                   G1RSIM5             __at(0x34BD);	// @ (0x697 * 8 + 5)
#define                                 G1RSIM5_bit         _BIT_ACCESS(COG1RSIM0,5)
// COG1RSIM0<G1RSIM6>
extern volatile __bit                   G1RSIM6             __at(0x34BE);	// @ (0x697 * 8 + 6)
#define                                 G1RSIM6_bit         _BIT_ACCESS(COG1RSIM0,6)
// COG1RSIM0<G1RSIM7>
extern volatile __bit                   G1RSIM7             __at(0x34BF);	// @ (0x697 * 8 + 7)
#define                                 G1RSIM7_bit         _BIT_ACCESS(COG1RSIM0,7)
// COG1RSIM1<G1RSIM8>
extern volatile __bit                   G1RSIM8             __at(0x34C0);	// @ (0x698 * 8 + 0)
#define                                 G1RSIM8_bit         _BIT_ACCESS(COG1RSIM1,0)
// COG1RSIM1<G1RSIM9>
extern volatile __bit                   G1RSIM9             __at(0x34C1);	// @ (0x698 * 8 + 1)
#define                                 G1RSIM9_bit         _BIT_ACCESS(COG1RSIM1,1)
// COG1STR<G1SDATA>
extern volatile __bit                   G1SDATA             __at(0x34FC);	// @ (0x69F * 8 + 4)
#define                                 G1SDATA_bit         _BIT_ACCESS(COG1STR,4)
// COG1STR<G1SDATB>
extern volatile __bit                   G1SDATB             __at(0x34FD);	// @ (0x69F * 8 + 5)
#define                                 G1SDATB_bit         _BIT_ACCESS(COG1STR,5)
// COG1STR<G1SDATC>
extern volatile __bit                   G1SDATC             __at(0x34FE);	// @ (0x69F * 8 + 6)
#define                                 G1SDATC_bit         _BIT_ACCESS(COG1STR,6)
// COG1STR<G1SDATD>
extern volatile __bit                   G1SDATD             __at(0x34FF);	// @ (0x69F * 8 + 7)
#define                                 G1SDATD_bit         _BIT_ACCESS(COG1STR,7)
// COG1STR<G1STRA>
extern volatile __bit                   G1STRA              __at(0x34F8);	// @ (0x69F * 8 + 0)
#define                                 G1STRA_bit          _BIT_ACCESS(COG1STR,0)
// COG1STR<G1STRB>
extern volatile __bit                   G1STRB              __at(0x34F9);	// @ (0x69F * 8 + 1)
#define                                 G1STRB_bit          _BIT_ACCESS(COG1STR,1)
// COG1STR<G1STRC>
extern volatile __bit                   G1STRC              __at(0x34FA);	// @ (0x69F * 8 + 2)
#define                                 G1STRC_bit          _BIT_ACCESS(COG1STR,2)
// COG1STR<G1STRD>
extern volatile __bit                   G1STRD              __at(0x34FB);	// @ (0x69F * 8 + 3)
#define                                 G1STRD_bit          _BIT_ACCESS(COG1STR,3)
// COG2ASD0<G2ARSEN>
extern volatile __bit                   G2ARSEN             __at(0x38EE);	// @ (0x71D * 8 + 6)
#define                                 G2ARSEN_bit         _BIT_ACCESS(COG2ASD0,6)
// COG2ASD1<G2AS0E>
extern volatile __bit                   G2AS0E              __at(0x38F0);	// @ (0x71E * 8 + 0)
#define                                 G2AS0E_bit          _BIT_ACCESS(COG2ASD1,0)
// COG2ASD1<G2AS1E>
extern volatile __bit                   G2AS1E              __at(0x38F1);	// @ (0x71E * 8 + 1)
#define                                 G2AS1E_bit          _BIT_ACCESS(COG2ASD1,1)
// COG2ASD1<G2AS2E>
extern volatile __bit                   G2AS2E              __at(0x38F2);	// @ (0x71E * 8 + 2)
#define                                 G2AS2E_bit          _BIT_ACCESS(COG2ASD1,2)
// COG2ASD1<G2AS3E>
extern volatile __bit                   G2AS3E              __at(0x38F3);	// @ (0x71E * 8 + 3)
#define                                 G2AS3E_bit          _BIT_ACCESS(COG2ASD1,3)
// COG2ASD1<G2AS4E>
extern volatile __bit                   G2AS4E              __at(0x38F4);	// @ (0x71E * 8 + 4)
#define                                 G2AS4E_bit          _BIT_ACCESS(COG2ASD1,4)
// COG2ASD1<G2AS5E>
extern volatile __bit                   G2AS5E              __at(0x38F5);	// @ (0x71E * 8 + 5)
#define                                 G2AS5E_bit          _BIT_ACCESS(COG2ASD1,5)
// COG2ASD1<G2AS6E>
extern volatile __bit                   G2AS6E              __at(0x38F6);	// @ (0x71E * 8 + 6)
#define                                 G2AS6E_bit          _BIT_ACCESS(COG2ASD1,6)
// COG2ASD1<G2AS7E>
extern volatile __bit                   G2AS7E              __at(0x38F7);	// @ (0x71E * 8 + 7)
#define                                 G2AS7E_bit          _BIT_ACCESS(COG2ASD1,7)
// COG2ASD0<G2ASDAC0>
extern volatile __bit                   G2ASDAC0            __at(0x38EA);	// @ (0x71D * 8 + 2)
#define                                 G2ASDAC0_bit        _BIT_ACCESS(COG2ASD0,2)
// COG2ASD0<G2ASDAC1>
extern volatile __bit                   G2ASDAC1            __at(0x38EB);	// @ (0x71D * 8 + 3)
#define                                 G2ASDAC1_bit        _BIT_ACCESS(COG2ASD0,3)
// COG2ASD0<G2ASDBD0>
extern volatile __bit                   G2ASDBD0            __at(0x38EC);	// @ (0x71D * 8 + 4)
#define                                 G2ASDBD0_bit        _BIT_ACCESS(COG2ASD0,4)
// COG2ASD0<G2ASDBD1>
extern volatile __bit                   G2ASDBD1            __at(0x38ED);	// @ (0x71D * 8 + 5)
#define                                 G2ASDBD1_bit        _BIT_ACCESS(COG2ASD0,5)
// COG2ASD0<G2ASE>
extern volatile __bit                   G2ASE               __at(0x38EF);	// @ (0x71D * 8 + 7)
#define                                 G2ASE_bit           _BIT_ACCESS(COG2ASD0,7)
// COG2ASD0<G2ASREN>
extern volatile __bit                   G2ASREN             __at(0x38EE);	// @ (0x71D * 8 + 6)
#define                                 G2ASREN_bit         _BIT_ACCESS(COG2ASD0,6)
// COG2BLKF<G2BLKF0>
extern volatile __bit                   G2BLKF0             __at(0x3880);	// @ (0x710 * 8 + 0)
#define                                 G2BLKF0_bit         _BIT_ACCESS(COG2BLKF,0)
// COG2BLKF<G2BLKF1>
extern volatile __bit                   G2BLKF1             __at(0x3881);	// @ (0x710 * 8 + 1)
#define                                 G2BLKF1_bit         _BIT_ACCESS(COG2BLKF,1)
// COG2BLKF<G2BLKF2>
extern volatile __bit                   G2BLKF2             __at(0x3882);	// @ (0x710 * 8 + 2)
#define                                 G2BLKF2_bit         _BIT_ACCESS(COG2BLKF,2)
// COG2BLKF<G2BLKF3>
extern volatile __bit                   G2BLKF3             __at(0x3883);	// @ (0x710 * 8 + 3)
#define                                 G2BLKF3_bit         _BIT_ACCESS(COG2BLKF,3)
// COG2BLKF<G2BLKF4>
extern volatile __bit                   G2BLKF4             __at(0x3884);	// @ (0x710 * 8 + 4)
#define                                 G2BLKF4_bit         _BIT_ACCESS(COG2BLKF,4)
// COG2BLKF<G2BLKF5>
extern volatile __bit                   G2BLKF5             __at(0x3885);	// @ (0x710 * 8 + 5)
#define                                 G2BLKF5_bit         _BIT_ACCESS(COG2BLKF,5)
// COG2BLKR<G2BLKR0>
extern volatile __bit                   G2BLKR0             __at(0x3878);	// @ (0x70F * 8 + 0)
#define                                 G2BLKR0_bit         _BIT_ACCESS(COG2BLKR,0)
// COG2BLKR<G2BLKR1>
extern volatile __bit                   G2BLKR1             __at(0x3879);	// @ (0x70F * 8 + 1)
#define                                 G2BLKR1_bit         _BIT_ACCESS(COG2BLKR,1)
// COG2BLKR<G2BLKR2>
extern volatile __bit                   G2BLKR2             __at(0x387A);	// @ (0x70F * 8 + 2)
#define                                 G2BLKR2_bit         _BIT_ACCESS(COG2BLKR,2)
// COG2BLKR<G2BLKR3>
extern volatile __bit                   G2BLKR3             __at(0x387B);	// @ (0x70F * 8 + 3)
#define                                 G2BLKR3_bit         _BIT_ACCESS(COG2BLKR,3)
// COG2BLKR<G2BLKR4>
extern volatile __bit                   G2BLKR4             __at(0x387C);	// @ (0x70F * 8 + 4)
#define                                 G2BLKR4_bit         _BIT_ACCESS(COG2BLKR,4)
// COG2BLKR<G2BLKR5>
extern volatile __bit                   G2BLKR5             __at(0x387D);	// @ (0x70F * 8 + 5)
#define                                 G2BLKR5_bit         _BIT_ACCESS(COG2BLKR,5)
// COG2CON0<G2CS0>
extern volatile __bit                   G2CS0               __at(0x389B);	// @ (0x713 * 8 + 3)
#define                                 G2CS0_bit           _BIT_ACCESS(COG2CON0,3)
// COG2CON0<G2CS1>
extern volatile __bit                   G2CS1               __at(0x389C);	// @ (0x713 * 8 + 4)
#define                                 G2CS1_bit           _BIT_ACCESS(COG2CON0,4)
// COG2DBF<G2DBF0>
extern volatile __bit                   G2DBF0              __at(0x3890);	// @ (0x712 * 8 + 0)
#define                                 G2DBF0_bit          _BIT_ACCESS(COG2DBF,0)
// COG2DBF<G2DBF1>
extern volatile __bit                   G2DBF1              __at(0x3891);	// @ (0x712 * 8 + 1)
#define                                 G2DBF1_bit          _BIT_ACCESS(COG2DBF,1)
// COG2DBF<G2DBF2>
extern volatile __bit                   G2DBF2              __at(0x3892);	// @ (0x712 * 8 + 2)
#define                                 G2DBF2_bit          _BIT_ACCESS(COG2DBF,2)
// COG2DBF<G2DBF3>
extern volatile __bit                   G2DBF3              __at(0x3893);	// @ (0x712 * 8 + 3)
#define                                 G2DBF3_bit          _BIT_ACCESS(COG2DBF,3)
// COG2DBF<G2DBF4>
extern volatile __bit                   G2DBF4              __at(0x3894);	// @ (0x712 * 8 + 4)
#define                                 G2DBF4_bit          _BIT_ACCESS(COG2DBF,4)
// COG2DBF<G2DBF5>
extern volatile __bit                   G2DBF5              __at(0x3895);	// @ (0x712 * 8 + 5)
#define                                 G2DBF5_bit          _BIT_ACCESS(COG2DBF,5)
// COG2DBR<G2DBR0>
extern volatile __bit                   G2DBR0              __at(0x3888);	// @ (0x711 * 8 + 0)
#define                                 G2DBR0_bit          _BIT_ACCESS(COG2DBR,0)
// COG2DBR<G2DBR1>
extern volatile __bit                   G2DBR1              __at(0x3889);	// @ (0x711 * 8 + 1)
#define                                 G2DBR1_bit          _BIT_ACCESS(COG2DBR,1)
// COG2DBR<G2DBR2>
extern volatile __bit                   G2DBR2              __at(0x388A);	// @ (0x711 * 8 + 2)
#define                                 G2DBR2_bit          _BIT_ACCESS(COG2DBR,2)
// COG2DBR<G2DBR3>
extern volatile __bit                   G2DBR3              __at(0x388B);	// @ (0x711 * 8 + 3)
#define                                 G2DBR3_bit          _BIT_ACCESS(COG2DBR,3)
// COG2DBR<G2DBR4>
extern volatile __bit                   G2DBR4              __at(0x388C);	// @ (0x711 * 8 + 4)
#define                                 G2DBR4_bit          _BIT_ACCESS(COG2DBR,4)
// COG2DBR<G2DBR5>
extern volatile __bit                   G2DBR5              __at(0x388D);	// @ (0x711 * 8 + 5)
#define                                 G2DBR5_bit          _BIT_ACCESS(COG2DBR,5)
// COG2CON0<G2EN>
extern volatile __bit                   G2EN                __at(0x389F);	// @ (0x713 * 8 + 7)
#define                                 G2EN_bit            _BIT_ACCESS(COG2CON0,7)
// COG2CON1<G2FDBS>
extern volatile __bit                   G2FDBS              __at(0x38A6);	// @ (0x714 * 8 + 6)
#define                                 G2FDBS_bit          _BIT_ACCESS(COG2CON1,6)
// COG2FIS0<G2FIS0>
extern volatile __bit                   G2FIS0              __at(0x38C8);	// @ (0x719 * 8 + 0)
#define                                 G2FIS0_bit          _BIT_ACCESS(COG2FIS0,0)
// COG2FIS0<G2FIS1>
extern volatile __bit                   G2FIS1              __at(0x38C9);	// @ (0x719 * 8 + 1)
#define                                 G2FIS1_bit          _BIT_ACCESS(COG2FIS0,1)
// COG2FIS1<G2FIS10>
extern volatile __bit                   G2FIS10             __at(0x38D2);	// @ (0x71A * 8 + 2)
#define                                 G2FIS10_bit         _BIT_ACCESS(COG2FIS1,2)
// COG2FIS1<G2FIS11>
extern volatile __bit                   G2FIS11             __at(0x38D3);	// @ (0x71A * 8 + 3)
#define                                 G2FIS11_bit         _BIT_ACCESS(COG2FIS1,3)
// COG2FIS1<G2FIS12>
extern volatile __bit                   G2FIS12             __at(0x38D4);	// @ (0x71A * 8 + 4)
#define                                 G2FIS12_bit         _BIT_ACCESS(COG2FIS1,4)
// COG2FIS1<G2FIS13>
extern volatile __bit                   G2FIS13             __at(0x38D5);	// @ (0x71A * 8 + 5)
#define                                 G2FIS13_bit         _BIT_ACCESS(COG2FIS1,5)
// COG2FIS1<G2FIS14>
extern volatile __bit                   G2FIS14             __at(0x38D6);	// @ (0x71A * 8 + 6)
#define                                 G2FIS14_bit         _BIT_ACCESS(COG2FIS1,6)
// COG2FIS1<G2FIS15>
extern volatile __bit                   G2FIS15             __at(0x38D7);	// @ (0x71A * 8 + 7)
#define                                 G2FIS15_bit         _BIT_ACCESS(COG2FIS1,7)
// COG2FIS0<G2FIS2>
extern volatile __bit                   G2FIS2              __at(0x38CA);	// @ (0x719 * 8 + 2)
#define                                 G2FIS2_bit          _BIT_ACCESS(COG2FIS0,2)
// COG2FIS0<G2FIS3>
extern volatile __bit                   G2FIS3              __at(0x38CB);	// @ (0x719 * 8 + 3)
