MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1779/mcu.h
#define                                 G4CS1_bit           _BIT_ACCESS(COG4CON0,4)
// COG4DBF<G4DBF0>
extern volatile __bit                   G4DBF0              __at(0x4490);	// @ (0x892 * 8 + 0)
#define                                 G4DBF0_bit          _BIT_ACCESS(COG4DBF,0)
// COG4DBF<G4DBF1>
extern volatile __bit                   G4DBF1              __at(0x4491);	// @ (0x892 * 8 + 1)
#define                                 G4DBF1_bit          _BIT_ACCESS(COG4DBF,1)
// COG4DBF<G4DBF2>
extern volatile __bit                   G4DBF2              __at(0x4492);	// @ (0x892 * 8 + 2)
#define                                 G4DBF2_bit          _BIT_ACCESS(COG4DBF,2)
// COG4DBF<G4DBF3>
extern volatile __bit                   G4DBF3              __at(0x4493);	// @ (0x892 * 8 + 3)
#define                                 G4DBF3_bit          _BIT_ACCESS(COG4DBF,3)
// COG4DBF<G4DBF4>
extern volatile __bit                   G4DBF4              __at(0x4494);	// @ (0x892 * 8 + 4)
#define                                 G4DBF4_bit          _BIT_ACCESS(COG4DBF,4)
// COG4DBF<G4DBF5>
extern volatile __bit                   G4DBF5              __at(0x4495);	// @ (0x892 * 8 + 5)
#define                                 G4DBF5_bit          _BIT_ACCESS(COG4DBF,5)
// COG4DBR<G4DBR0>
extern volatile __bit                   G4DBR0              __at(0x4488);	// @ (0x891 * 8 + 0)
#define                                 G4DBR0_bit          _BIT_ACCESS(COG4DBR,0)
// COG4DBR<G4DBR1>
extern volatile __bit                   G4DBR1              __at(0x4489);	// @ (0x891 * 8 + 1)
#define                                 G4DBR1_bit          _BIT_ACCESS(COG4DBR,1)
// COG4DBR<G4DBR2>
extern volatile __bit                   G4DBR2              __at(0x448A);	// @ (0x891 * 8 + 2)
#define                                 G4DBR2_bit          _BIT_ACCESS(COG4DBR,2)
// COG4DBR<G4DBR3>
extern volatile __bit                   G4DBR3              __at(0x448B);	// @ (0x891 * 8 + 3)
#define                                 G4DBR3_bit          _BIT_ACCESS(COG4DBR,3)
// COG4DBR<G4DBR4>
extern volatile __bit                   G4DBR4              __at(0x448C);	// @ (0x891 * 8 + 4)
#define                                 G4DBR4_bit          _BIT_ACCESS(COG4DBR,4)
// COG4DBR<G4DBR5>
extern volatile __bit                   G4DBR5              __at(0x448D);	// @ (0x891 * 8 + 5)
#define                                 G4DBR5_bit          _BIT_ACCESS(COG4DBR,5)
// COG4CON0<G4EN>
extern volatile __bit                   G4EN                __at(0x449F);	// @ (0x893 * 8 + 7)
#define                                 G4EN_bit            _BIT_ACCESS(COG4CON0,7)
// COG4CON1<G4FDBS>
extern volatile __bit                   G4FDBS              __at(0x44A6);	// @ (0x894 * 8 + 6)
#define                                 G4FDBS_bit          _BIT_ACCESS(COG4CON1,6)
// COG4FIS0<G4FIS0>
extern volatile __bit                   G4FIS0              __at(0x44C8);	// @ (0x899 * 8 + 0)
#define                                 G4FIS0_bit          _BIT_ACCESS(COG4FIS0,0)
// COG4FIS0<G4FIS1>
extern volatile __bit                   G4FIS1              __at(0x44C9);	// @ (0x899 * 8 + 1)
#define                                 G4FIS1_bit          _BIT_ACCESS(COG4FIS0,1)
// COG4FIS1<G4FIS10>
extern volatile __bit                   G4FIS10             __at(0x44D2);	// @ (0x89A * 8 + 2)
#define                                 G4FIS10_bit         _BIT_ACCESS(COG4FIS1,2)
// COG4FIS1<G4FIS11>
extern volatile __bit                   G4FIS11             __at(0x44D3);	// @ (0x89A * 8 + 3)
#define                                 G4FIS11_bit         _BIT_ACCESS(COG4FIS1,3)
// COG4FIS1<G4FIS12>
extern volatile __bit                   G4FIS12             __at(0x44D4);	// @ (0x89A * 8 + 4)
#define                                 G4FIS12_bit         _BIT_ACCESS(COG4FIS1,4)
// COG4FIS1<G4FIS13>
extern volatile __bit                   G4FIS13             __at(0x44D5);	// @ (0x89A * 8 + 5)
#define                                 G4FIS13_bit         _BIT_ACCESS(COG4FIS1,5)
// COG4FIS1<G4FIS14>
extern volatile __bit                   G4FIS14             __at(0x44D6);	// @ (0x89A * 8 + 6)
#define                                 G4FIS14_bit         _BIT_ACCESS(COG4FIS1,6)
// COG4FIS1<G4FIS15>
extern volatile __bit                   G4FIS15             __at(0x44D7);	// @ (0x89A * 8 + 7)
#define                                 G4FIS15_bit         _BIT_ACCESS(COG4FIS1,7)
// COG4FIS0<G4FIS2>
extern volatile __bit                   G4FIS2              __at(0x44CA);	// @ (0x899 * 8 + 2)
#define                                 G4FIS2_bit          _BIT_ACCESS(COG4FIS0,2)
// COG4FIS0<G4FIS3>
extern volatile __bit                   G4FIS3              __at(0x44CB);	// @ (0x899 * 8 + 3)
#define                                 G4FIS3_bit          _BIT_ACCESS(COG4FIS0,3)
// COG4FIS0<G4FIS4>
extern volatile __bit                   G4FIS4              __at(0x44CC);	// @ (0x899 * 8 + 4)
#define                                 G4FIS4_bit          _BIT_ACCESS(COG4FIS0,4)
// COG4FIS0<G4FIS5>
extern volatile __bit                   G4FIS5              __at(0x44CD);	// @ (0x899 * 8 + 5)
#define                                 G4FIS5_bit          _BIT_ACCESS(COG4FIS0,5)
// COG4FIS0<G4FIS6>
extern volatile __bit                   G4FIS6              __at(0x44CE);	// @ (0x899 * 8 + 6)
#define                                 G4FIS6_bit          _BIT_ACCESS(COG4FIS0,6)
// COG4FIS0<G4FIS7>
extern volatile __bit                   G4FIS7              __at(0x44CF);	// @ (0x899 * 8 + 7)
#define                                 G4FIS7_bit          _BIT_ACCESS(COG4FIS0,7)
// COG4FIS1<G4FIS8>
extern volatile __bit                   G4FIS8              __at(0x44D0);	// @ (0x89A * 8 + 0)
#define                                 G4FIS8_bit          _BIT_ACCESS(COG4FIS1,0)
// COG4FIS1<G4FIS9>
extern volatile __bit                   G4FIS9              __at(0x44D1);	// @ (0x89A * 8 + 1)
#define                                 G4FIS9_bit          _BIT_ACCESS(COG4FIS1,1)
// COG4FSIM0<G4FSIM0>
extern volatile __bit                   G4FSIM0             __at(0x44D8);	// @ (0x89B * 8 + 0)
#define                                 G4FSIM0_bit         _BIT_ACCESS(COG4FSIM0,0)
// COG4FSIM0<G4FSIM1>
extern volatile __bit                   G4FSIM1             __at(0x44D9);	// @ (0x89B * 8 + 1)
#define                                 G4FSIM1_bit         _BIT_ACCESS(COG4FSIM0,1)
// COG4FSIM1<G4FSIM10>
extern volatile __bit                   G4FSIM10            __at(0x44E2);	// @ (0x89C * 8 + 2)
#define                                 G4FSIM10_bit        _BIT_ACCESS(COG4FSIM1,2)
// COG4FSIM1<G4FSIM11>
extern volatile __bit                   G4FSIM11            __at(0x44E3);	// @ (0x89C * 8 + 3)
#define                                 G4FSIM11_bit        _BIT_ACCESS(COG4FSIM1,3)
// COG4FSIM1<G4FSIM12>
extern volatile __bit                   G4FSIM12            __at(0x44E4);	// @ (0x89C * 8 + 4)
#define                                 G4FSIM12_bit        _BIT_ACCESS(COG4FSIM1,4)
// COG4FSIM1<G4FSIM13>
extern volatile __bit                   G4FSIM13            __at(0x44E5);	// @ (0x89C * 8 + 5)
#define                                 G4FSIM13_bit        _BIT_ACCESS(COG4FSIM1,5)
// COG4FSIM1<G4FSIM14>
extern volatile __bit                   G4FSIM14            __at(0x44E6);	// @ (0x89C * 8 + 6)
#define                                 G4FSIM14_bit        _BIT_ACCESS(COG4FSIM1,6)
// COG4FSIM1<G4FSIM15>
extern volatile __bit                   G4FSIM15            __at(0x44E7);	// @ (0x89C * 8 + 7)
#define                                 G4FSIM15_bit        _BIT_ACCESS(COG4FSIM1,7)
// COG4FSIM0<G4FSIM2>
extern volatile __bit                   G4FSIM2             __at(0x44DA);	// @ (0x89B * 8 + 2)
#define                                 G4FSIM2_bit         _BIT_ACCESS(COG4FSIM0,2)
// COG4FSIM0<G4FSIM3>
extern volatile __bit                   G4FSIM3             __at(0x44DB);	// @ (0x89B * 8 + 3)
#define                                 G4FSIM3_bit         _BIT_ACCESS(COG4FSIM0,3)
// COG4FSIM0<G4FSIM4>
extern volatile __bit                   G4FSIM4             __at(0x44DC);	// @ (0x89B * 8 + 4)
#define                                 G4FSIM4_bit         _BIT_ACCESS(COG4FSIM0,4)
// COG4FSIM0<G4FSIM5>
extern volatile __bit                   G4FSIM5             __at(0x44DD);	// @ (0x89B * 8 + 5)
#define                                 G4FSIM5_bit         _BIT_ACCESS(COG4FSIM0,5)
// COG4FSIM0<G4FSIM6>
extern volatile __bit                   G4FSIM6             __at(0x44DE);	// @ (0x89B * 8 + 6)
#define                                 G4FSIM6_bit         _BIT_ACCESS(COG4FSIM0,6)
// COG4FSIM0<G4FSIM7>
extern volatile __bit                   G4FSIM7             __at(0x44DF);	// @ (0x89B * 8 + 7)
#define                                 G4FSIM7_bit         _BIT_ACCESS(COG4FSIM0,7)
// COG4FSIM1<G4FSIM8>
extern volatile __bit                   G4FSIM8             __at(0x44E0);	// @ (0x89C * 8 + 0)
#define                                 G4FSIM8_bit         _BIT_ACCESS(COG4FSIM1,0)
// COG4FSIM1<G4FSIM9>
extern volatile __bit                   G4FSIM9             __at(0x44E1);	// @ (0x89C * 8 + 1)
#define                                 G4FSIM9_bit         _BIT_ACCESS(COG4FSIM1,1)
// COG4CON0<G4LD>
extern volatile __bit                   G4LD                __at(0x449E);	// @ (0x893 * 8 + 6)
#define                                 G4LD_bit            _BIT_ACCESS(COG4CON0,6)
// COG4CON0<G4MD0>
extern volatile __bit                   G4MD0               __at(0x4498);	// @ (0x893 * 8 + 0)
#define                                 G4MD0_bit           _BIT_ACCESS(COG4CON0,0)
// COG4CON0<G4MD1>
extern volatile __bit                   G4MD1               __at(0x4499);	// @ (0x893 * 8 + 1)
#define                                 G4MD1_bit           _BIT_ACCESS(COG4CON0,1)
// COG4CON0<G4MD2>
extern volatile __bit                   G4MD2               __at(0x449A);	// @ (0x893 * 8 + 2)
#define                                 G4MD2_bit           _BIT_ACCESS(COG4CON0,2)
// COG4PHF<G4PHF0>
extern volatile __bit                   G4PHF0              __at(0x4470);	// @ (0x88E * 8 + 0)
#define                                 G4PHF0_bit          _BIT_ACCESS(COG4PHF,0)
// COG4PHF<G4PHF1>
extern volatile __bit                   G4PHF1              __at(0x4471);	// @ (0x88E * 8 + 1)
#define                                 G4PHF1_bit          _BIT_ACCESS(COG4PHF,1)
// COG4PHF<G4PHF2>
extern volatile __bit                   G4PHF2              __at(0x4472);	// @ (0x88E * 8 + 2)
#define                                 G4PHF2_bit          _BIT_ACCESS(COG4PHF,2)
// COG4PHF<G4PHF3>
extern volatile __bit                   G4PHF3              __at(0x4473);	// @ (0x88E * 8 + 3)
#define                                 G4PHF3_bit          _BIT_ACCESS(COG4PHF,3)
// COG4PHF<G4PHF4>
extern volatile __bit                   G4PHF4              __at(0x4474);	// @ (0x88E * 8 + 4)
#define                                 G4PHF4_bit          _BIT_ACCESS(COG4PHF,4)
// COG4PHF<G4PHF5>
extern volatile __bit                   G4PHF5              __at(0x4475);	// @ (0x88E * 8 + 5)
#define                                 G4PHF5_bit          _BIT_ACCESS(COG4PHF,5)
// COG4PHR<G4PHR0>
extern volatile __bit                   G4PHR0              __at(0x4468);	// @ (0x88D * 8 + 0)
#define                                 G4PHR0_bit          _BIT_ACCESS(COG4PHR,0)
// COG4PHR<G4PHR1>
extern volatile __bit                   G4PHR1              __at(0x4469);	// @ (0x88D * 8 + 1)
#define                                 G4PHR1_bit          _BIT_ACCESS(COG4PHR,1)
// COG4PHR<G4PHR2>
extern volatile __bit                   G4PHR2              __at(0x446A);	// @ (0x88D * 8 + 2)
#define                                 G4PHR2_bit          _BIT_ACCESS(COG4PHR,2)
// COG4PHR<G4PHR3>
extern volatile __bit                   G4PHR3              __at(0x446B);	// @ (0x88D * 8 + 3)
#define                                 G4PHR3_bit          _BIT_ACCESS(COG4PHR,3)
// COG4PHR<G4PHR4>
extern volatile __bit                   G4PHR4              __at(0x446C);	// @ (0x88D * 8 + 4)
#define                                 G4PHR4_bit          _BIT_ACCESS(COG4PHR,4)
// COG4PHR<G4PHR5>
extern volatile __bit                   G4PHR5              __at(0x446D);	// @ (0x88D * 8 + 5)
#define                                 G4PHR5_bit          _BIT_ACCESS(COG4PHR,5)
// COG4CON1<G4POLA>
extern volatile __bit                   G4POLA              __at(0x44A0);	// @ (0x894 * 8 + 0)
#define                                 G4POLA_bit          _BIT_ACCESS(COG4CON1,0)
// COG4CON1<G4POLB>
extern volatile __bit                   G4POLB              __at(0x44A1);	// @ (0x894 * 8 + 1)
#define                                 G4POLB_bit          _BIT_ACCESS(COG4CON1,1)
// COG4CON1<G4POLC>
extern volatile __bit                   G4POLC              __at(0x44A2);	// @ (0x894 * 8 + 2)
#define                                 G4POLC_bit          _BIT_ACCESS(COG4CON1,2)
// COG4CON1<G4POLD>
extern volatile __bit                   G4POLD              __at(0x44A3);	// @ (0x894 * 8 + 3)
#define                                 G4POLD_bit          _BIT_ACCESS(COG4CON1,3)
// COG4CON1<G4RDBS>
extern volatile __bit                   G4RDBS              __at(0x44A7);	// @ (0x894 * 8 + 7)
#define                                 G4RDBS_bit          _BIT_ACCESS(COG4CON1,7)
// COG4RIS0<G4RIS0>
extern volatile __bit                   G4RIS0              __at(0x44A8);	// @ (0x895 * 8 + 0)
#define                                 G4RIS0_bit          _BIT_ACCESS(COG4RIS0,0)
// COG4RIS0<G4RIS1>
extern volatile __bit                   G4RIS1              __at(0x44A9);	// @ (0x895 * 8 + 1)
#define                                 G4RIS1_bit          _BIT_ACCESS(COG4RIS0,1)
// COG4RIS1<G4RIS10>
extern volatile __bit                   G4RIS10             __at(0x44B2);	// @ (0x896 * 8 + 2)
#define                                 G4RIS10_bit         _BIT_ACCESS(COG4RIS1,2)
// COG4RIS1<G4RIS11>
extern volatile __bit                   G4RIS11             __at(0x44B3);	// @ (0x896 * 8 + 3)
#define                                 G4RIS11_bit         _BIT_ACCESS(COG4RIS1,3)
// COG4RIS1<G4RIS12>
extern volatile __bit                   G4RIS12             __at(0x44B4);	// @ (0x896 * 8 + 4)
#define                                 G4RIS12_bit         _BIT_ACCESS(COG4RIS1,4)
// COG4RIS1<G4RIS13>
extern volatile __bit                   G4RIS13             __at(0x44B5);	// @ (0x896 * 8 + 5)
#define                                 G4RIS13_bit         _BIT_ACCESS(COG4RIS1,5)
// COG4RIS1<G4RIS14>
extern volatile __bit                   G4RIS14             __at(0x44B6);	// @ (0x896 * 8 + 6)
#define                                 G4RIS14_bit         _BIT_ACCESS(COG4RIS1,6)
// COG4RIS1<G4RIS15>
extern volatile __bit                   G4RIS15             __at(0x44B7);	// @ (0x896 * 8 + 7)
#define                                 G4RIS15_bit         _BIT_ACCESS(COG4RIS1,7)
// COG4RIS0<G4RIS2>
extern volatile __bit                   G4RIS2              __at(0x44AA);	// @ (0x895 * 8 + 2)
#define                                 G4RIS2_bit          _BIT_ACCESS(COG4RIS0,2)
// COG4RIS0<G4RIS3>
extern volatile __bit                   G4RIS3              __at(0x44AB);	// @ (0x895 * 8 + 3)
#define                                 G4RIS3_bit          _BIT_ACCESS(COG4RIS0,3)
// COG4RIS0<G4RIS4>
extern volatile __bit                   G4RIS4              __at(0x44AC);	// @ (0x895 * 8 + 4)
#define                                 G4RIS4_bit          _BIT_ACCESS(COG4RIS0,4)
// COG4RIS0<G4RIS5>
extern volatile __bit                   G4RIS5              __at(0x44AD);	// @ (0x895 * 8 + 5)
#define                                 G4RIS5_bit          _BIT_ACCESS(COG4RIS0,5)
// COG4RIS0<G4RIS6>
extern volatile __bit                   G4RIS6              __at(0x44AE);	// @ (0x895 * 8 + 6)
#define                                 G4RIS6_bit          _BIT_ACCESS(COG4RIS0,6)
// COG4RIS0<G4RIS7>
extern volatile __bit                   G4RIS7              __at(0x44AF);	// @ (0x895 * 8 + 7)
#define                                 G4RIS7_bit          _BIT_ACCESS(COG4RIS0,7)
// COG4RIS1<G4RIS8>
extern volatile __bit                   G4RIS8              __at(0x44B0);	// @ (0x896 * 8 + 0)
#define                                 G4RIS8_bit          _BIT_ACCESS(COG4RIS1,0)
// COG4RIS1<G4RIS9>
extern volatile __bit                   G4RIS9              __at(0x44B1);	// @ (0x896 * 8 + 1)
#define                                 G4RIS9_bit          _BIT_ACCESS(COG4RIS1,1)
// COG4RSIM0<G4RSIM0>
extern volatile __bit                   G4RSIM0             __at(0x44B8);	// @ (0x897 * 8 + 0)
#define                                 G4RSIM0_bit         _BIT_ACCESS(COG4RSIM0,0)
// COG4RSIM0<G4RSIM1>
extern volatile __bit                   G4RSIM1             __at(0x44B9);	// @ (0x897 * 8 + 1)
#define                                 G4RSIM1_bit         _BIT_ACCESS(COG4RSIM0,1)
// COG4RSIM1<G4RSIM10>
extern volatile __bit                   G4RSIM10            __at(0x44C2);	// @ (0x898 * 8 + 2)
#define                                 G4RSIM10_bit        _BIT_ACCESS(COG4RSIM1,2)
// COG4RSIM1<G4RSIM11>
extern volatile __bit                   G4RSIM11            __at(0x44C3);	// @ (0x898 * 8 + 3)
#define                                 G4RSIM11_bit        _BIT_ACCESS(COG4RSIM1,3)
// COG4RSIM1<G4RSIM12>
extern volatile __bit                   G4RSIM12            __at(0x44C4);	// @ (0x898 * 8 + 4)
#define                                 G4RSIM12_bit        _BIT_ACCESS(COG4RSIM1,4)
// COG4RSIM1<G4RSIM13>
extern volatile __bit                   G4RSIM13            __at(0x44C5);	// @ (0x898 * 8 + 5)
#define                                 G4RSIM13_bit        _BIT_ACCESS(COG4RSIM1,5)
// COG4RSIM1<G4RSIM14>
extern volatile __bit                   G4RSIM14            __at(0x44C6);	// @ (0x898 * 8 + 6)
#define                                 G4RSIM14_bit        _BIT_ACCESS(COG4RSIM1,6)
// COG4RSIM1<G4RSIM15>
extern volatile __bit                   G4RSIM15            __at(0x44C7);	// @ (0x898 * 8 + 7)
#define                                 G4RSIM15_bit        _BIT_ACCESS(COG4RSIM1,7)
// COG4RSIM0<G4RSIM2>
extern volatile __bit                   G4RSIM2             __at(0x44BA);	// @ (0x897 * 8 + 2)
#define                                 G4RSIM2_bit         _BIT_ACCESS(COG4RSIM0,2)
// COG4RSIM0<G4RSIM3>
extern volatile __bit                   G4RSIM3             __at(0x44BB);	// @ (0x897 * 8 + 3)
#define                                 G4RSIM3_bit         _BIT_ACCESS(COG4RSIM0,3)
// COG4RSIM0<G4RSIM4>
extern volatile __bit                   G4RSIM4             __at(0x44BC);	// @ (0x897 * 8 + 4)
#define                                 G4RSIM4_bit         _BIT_ACCESS(COG4RSIM0,4)
// COG4RSIM0<G4RSIM5>
extern volatile __bit                   G4RSIM5             __at(0x44BD);	// @ (0x897 * 8 + 5)
#define                                 G4RSIM5_bit         _BIT_ACCESS(COG4RSIM0,5)
// COG4RSIM0<G4RSIM6>
extern volatile __bit                   G4RSIM6             __at(0x44BE);	// @ (0x897 * 8 + 6)
#define                                 G4RSIM6_bit         _BIT_ACCESS(COG4RSIM0,6)
// COG4RSIM0<G4RSIM7>
extern volatile __bit                   G4RSIM7             __at(0x44BF);	// @ (0x897 * 8 + 7)
#define                                 G4RSIM7_bit         _BIT_ACCESS(COG4RSIM0,7)
// COG4RSIM1<G4RSIM8>
extern volatile __bit                   G4RSIM8             __at(0x44C0);	// @ (0x898 * 8 + 0)
#define                                 G4RSIM8_bit         _BIT_ACCESS(COG4RSIM1,0)
// COG4RSIM1<G4RSIM9>
extern volatile __bit                   G4RSIM9             __at(0x44C1);	// @ (0x898 * 8 + 1)
#define                                 G4RSIM9_bit         _BIT_ACCESS(COG4RSIM1,1)
// COG4STR<G4SDATA>
extern volatile __bit                   G4SDATA             __at(0x44FC);	// @ (0x89F * 8 + 4)
#define                                 G4SDATA_bit         _BIT_ACCESS(COG4STR,4)
// COG4STR<G4SDATB>
extern volatile __bit                   G4SDATB             __at(0x44FD);	// @ (0x89F * 8 + 5)
#define                                 G4SDATB_bit         _BIT_ACCESS(COG4STR,5)
// COG4STR<G4SDATC>
extern volatile __bit                   G4SDATC             __at(0x44FE);	// @ (0x89F * 8 + 6)
#define                                 G4SDATC_bit         _BIT_ACCESS(COG4STR,6)
// COG4STR<G4SDATD>
extern volatile __bit                   G4SDATD             __at(0x44FF);	// @ (0x89F * 8 + 7)
#define                                 G4SDATD_bit         _BIT_ACCESS(COG4STR,7)
// COG4STR<G4STRA>
extern volatile __bit                   G4STRA              __at(0x44F8);	// @ (0x89F * 8 + 0)
#define                                 G4STRA_bit          _BIT_ACCESS(COG4STR,0)
// COG4STR<G4STRB>
extern volatile __bit                   G4STRB              __at(0x44F9);	// @ (0x89F * 8 + 1)
#define                                 G4STRB_bit          _BIT_ACCESS(COG4STR,1)
// COG4STR<G4STRC>
extern volatile __bit                   G4STRC              __at(0x44FA);	// @ (0x89F * 8 + 2)
#define                                 G4STRC_bit          _BIT_ACCESS(COG4STR,2)
// COG4STR<G4STRD>
extern volatile __bit                   G4STRD              __at(0x44FB);	// @ (0x89F * 8 + 3)
#define                                 G4STRD_bit          _BIT_ACCESS(COG4STR,3)
// SSP1CON2<GCEN>
extern volatile __bit                   GCEN                __at(0x10B7);	// @ (0x216 * 8 + 7)
#define                                 GCEN_bit            _BIT_ACCESS(SSP1CON2,7)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x5F);	// @ (0xB * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// OSCSTAT<HFIOFL>
extern volatile __bit                   HFIOFL              __at(0x4E3);	// @ (0x9C * 8 + 3)
#define                                 HFIOFL_bit          _BIT_ACCESS(OSCSTAT,3)
// OSCSTAT<HFIOFR>
extern volatile __bit                   HFIOFR              __at(0x4E4);	// @ (0x9C * 8 + 4)
#define                                 HFIOFR_bit          _BIT_ACCESS(OSCSTAT,4)
// OSCSTAT<HFIOFS>
extern volatile __bit                   HFIOFS              __at(0x4E0);	// @ (0x9C * 8 + 0)
#define                                 HFIOFS_bit          _BIT_ACCESS(OSCSTAT,0)
// HIDRVB<HIDB0>
extern volatile __bit                   HIDB0               __at(0x2068);	// @ (0x40D * 8 + 0)
#define                                 HIDB0_bit           _BIT_ACCESS(HIDRVB,0)
// HIDRVB<HIDB1>
extern volatile __bit                   HIDB1               __at(0x2069);	// @ (0x40D * 8 + 1)
#define                                 HIDB1_bit           _BIT_ACCESS(HIDRVB,1)
// INLVLA<INLVA0>
extern volatile __bit                   INLVA0              __at(0x1C60);	// @ (0x38C * 8 + 0)
#define                                 INLVA0_bit          _BIT_ACCESS(INLVLA,0)
// INLVLA<INLVA1>
extern volatile __bit                   INLVA1              __at(0x1C61);	// @ (0x38C * 8 + 1)
#define                                 INLVA1_bit          _BIT_ACCESS(INLVLA,1)
// INLVLA<INLVA2>
extern volatile __bit                   INLVA2              __at(0x1C62);	// @ (0x38C * 8 + 2)
#define                                 INLVA2_bit          _BIT_ACCESS(INLVLA,2)
// INLVLA<INLVA3>
extern volatile __bit                   INLVA3              __at(0x1C63);	// @ (0x38C * 8 + 3)
#define                                 INLVA3_bit          _BIT_ACCESS(INLVLA,3)
// INLVLA<INLVA4>
extern volatile __bit                   INLVA4              __at(0x1C64);	// @ (0x38C * 8 + 4)
#define                                 INLVA4_bit          _BIT_ACCESS(INLVLA,4)
// INLVLA<INLVA5>
extern volatile __bit                   INLVA5              __at(0x1C65);	// @ (0x38C * 8 + 5)
#define                                 INLVA5_bit          _BIT_ACCESS(INLVLA,5)
// INLVLA<INLVA6>
