MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1779/mcu.h
#define                                 PWM6PRH6_bit        _BIT_ACCESS(PWM6PRH,6)
// PWM6PRH<PWM6PRH7>
extern volatile __bit                   PWM6PRH7            __at(0x6D37);	// @ (0xDA6 * 8 + 7)
#define                                 PWM6PRH7_bit        _BIT_ACCESS(PWM6PRH,7)
// PWM6INTE<PWM6PRIE>
extern volatile __bit                   PWM6PRIE            __at(0x6D60);	// @ (0xDAC * 8 + 0)
#define                                 PWM6PRIE_bit        _BIT_ACCESS(PWM6INTE,0)
// PWM6INTF<PWM6PRIF>
extern volatile __bit                   PWM6PRIF            __at(0x6D68);	// @ (0xDAD * 8 + 0)
#define                                 PWM6PRIF_bit        _BIT_ACCESS(PWM6INTF,0)
// PWM6PRL<PWM6PRL0>
extern volatile __bit                   PWM6PRL0            __at(0x6D28);	// @ (0xDA5 * 8 + 0)
#define                                 PWM6PRL0_bit        _BIT_ACCESS(PWM6PRL,0)
// PWM6PRL<PWM6PRL1>
extern volatile __bit                   PWM6PRL1            __at(0x6D29);	// @ (0xDA5 * 8 + 1)
#define                                 PWM6PRL1_bit        _BIT_ACCESS(PWM6PRL,1)
// PWM6PRL<PWM6PRL2>
extern volatile __bit                   PWM6PRL2            __at(0x6D2A);	// @ (0xDA5 * 8 + 2)
#define                                 PWM6PRL2_bit        _BIT_ACCESS(PWM6PRL,2)
// PWM6PRL<PWM6PRL3>
extern volatile __bit                   PWM6PRL3            __at(0x6D2B);	// @ (0xDA5 * 8 + 3)
#define                                 PWM6PRL3_bit        _BIT_ACCESS(PWM6PRL,3)
// PWM6PRL<PWM6PRL4>
extern volatile __bit                   PWM6PRL4            __at(0x6D2C);	// @ (0xDA5 * 8 + 4)
#define                                 PWM6PRL4_bit        _BIT_ACCESS(PWM6PRL,4)
// PWM6PRL<PWM6PRL5>
extern volatile __bit                   PWM6PRL5            __at(0x6D2D);	// @ (0xDA5 * 8 + 5)
#define                                 PWM6PRL5_bit        _BIT_ACCESS(PWM6PRL,5)
// PWM6PRL<PWM6PRL6>
extern volatile __bit                   PWM6PRL6            __at(0x6D2E);	// @ (0xDA5 * 8 + 6)
#define                                 PWM6PRL6_bit        _BIT_ACCESS(PWM6PRL,6)
// PWM6PRL<PWM6PRL7>
extern volatile __bit                   PWM6PRL7            __at(0x6D2F);	// @ (0xDA5 * 8 + 7)
#define                                 PWM6PRL7_bit        _BIT_ACCESS(PWM6PRL,7)
// PWM6CLKCON<PWM6PS0>
extern volatile __bit                   PWM6PS0             __at(0x6D74);	// @ (0xDAE * 8 + 4)
#define                                 PWM6PS0_bit         _BIT_ACCESS(PWM6CLKCON,4)
// PWM6CLKCON<PWM6PS1>
extern volatile __bit                   PWM6PS1             __at(0x6D75);	// @ (0xDAE * 8 + 5)
#define                                 PWM6PS1_bit         _BIT_ACCESS(PWM6CLKCON,5)
// PWM6CLKCON<PWM6PS2>
extern volatile __bit                   PWM6PS2             __at(0x6D76);	// @ (0xDAE * 8 + 6)
#define                                 PWM6PS2_bit         _BIT_ACCESS(PWM6CLKCON,6)
// PWM6TMRH<PWM6TMRH0>
extern volatile __bit                   PWM6TMRH0           __at(0x6D50);	// @ (0xDAA * 8 + 0)
#define                                 PWM6TMRH0_bit       _BIT_ACCESS(PWM6TMRH,0)
// PWM6TMRH<PWM6TMRH1>
extern volatile __bit                   PWM6TMRH1           __at(0x6D51);	// @ (0xDAA * 8 + 1)
#define                                 PWM6TMRH1_bit       _BIT_ACCESS(PWM6TMRH,1)
// PWM6TMRH<PWM6TMRH2>
extern volatile __bit                   PWM6TMRH2           __at(0x6D52);	// @ (0xDAA * 8 + 2)
#define                                 PWM6TMRH2_bit       _BIT_ACCESS(PWM6TMRH,2)
// PWM6TMRH<PWM6TMRH3>
extern volatile __bit                   PWM6TMRH3           __at(0x6D53);	// @ (0xDAA * 8 + 3)
#define                                 PWM6TMRH3_bit       _BIT_ACCESS(PWM6TMRH,3)
// PWM6TMRH<PWM6TMRH4>
extern volatile __bit                   PWM6TMRH4           __at(0x6D54);	// @ (0xDAA * 8 + 4)
#define                                 PWM6TMRH4_bit       _BIT_ACCESS(PWM6TMRH,4)
// PWM6TMRH<PWM6TMRH5>
extern volatile __bit                   PWM6TMRH5           __at(0x6D55);	// @ (0xDAA * 8 + 5)
#define                                 PWM6TMRH5_bit       _BIT_ACCESS(PWM6TMRH,5)
// PWM6TMRH<PWM6TMRH6>
extern volatile __bit                   PWM6TMRH6           __at(0x6D56);	// @ (0xDAA * 8 + 6)
#define                                 PWM6TMRH6_bit       _BIT_ACCESS(PWM6TMRH,6)
// PWM6TMRH<PWM6TMRH7>
extern volatile __bit                   PWM6TMRH7           __at(0x6D57);	// @ (0xDAA * 8 + 7)
#define                                 PWM6TMRH7_bit       _BIT_ACCESS(PWM6TMRH,7)
// PWM6TMRL<PWM6TMRL0>
extern volatile __bit                   PWM6TMRL0           __at(0x6D48);	// @ (0xDA9 * 8 + 0)
#define                                 PWM6TMRL0_bit       _BIT_ACCESS(PWM6TMRL,0)
// PWM6TMRL<PWM6TMRL1>
extern volatile __bit                   PWM6TMRL1           __at(0x6D49);	// @ (0xDA9 * 8 + 1)
#define                                 PWM6TMRL1_bit       _BIT_ACCESS(PWM6TMRL,1)
// PWM6TMRL<PWM6TMRL2>
extern volatile __bit                   PWM6TMRL2           __at(0x6D4A);	// @ (0xDA9 * 8 + 2)
#define                                 PWM6TMRL2_bit       _BIT_ACCESS(PWM6TMRL,2)
// PWM6TMRL<PWM6TMRL3>
extern volatile __bit                   PWM6TMRL3           __at(0x6D4B);	// @ (0xDA9 * 8 + 3)
#define                                 PWM6TMRL3_bit       _BIT_ACCESS(PWM6TMRL,3)
// PWM6TMRL<PWM6TMRL4>
extern volatile __bit                   PWM6TMRL4           __at(0x6D4C);	// @ (0xDA9 * 8 + 4)
#define                                 PWM6TMRL4_bit       _BIT_ACCESS(PWM6TMRL,4)
// PWM6TMRL<PWM6TMRL5>
extern volatile __bit                   PWM6TMRL5           __at(0x6D4D);	// @ (0xDA9 * 8 + 5)
#define                                 PWM6TMRL5_bit       _BIT_ACCESS(PWM6TMRL,5)
// PWM6TMRL<PWM6TMRL6>
extern volatile __bit                   PWM6TMRL6           __at(0x6D4E);	// @ (0xDA9 * 8 + 6)
#define                                 PWM6TMRL6_bit       _BIT_ACCESS(PWM6TMRL,6)
// PWM6TMRL<PWM6TMRL7>
extern volatile __bit                   PWM6TMRL7           __at(0x6D4F);	// @ (0xDA9 * 8 + 7)
#define                                 PWM6TMRL7_bit       _BIT_ACCESS(PWM6TMRL,7)
// PWM9DCL<PWM9DC0>
extern volatile __bit                   PWM9DC0             __at(0x30D6);	// @ (0x61A * 8 + 6)
#define                                 PWM9DC0_bit         _BIT_ACCESS(PWM9DCL,6)
// PWM9DCL<PWM9DC1>
extern volatile __bit                   PWM9DC1             __at(0x30D7);	// @ (0x61A * 8 + 7)
#define                                 PWM9DC1_bit         _BIT_ACCESS(PWM9DCL,7)
// PWM9DCH<PWM9DC2>
extern volatile __bit                   PWM9DC2             __at(0x30D8);	// @ (0x61B * 8 + 0)
#define                                 PWM9DC2_bit         _BIT_ACCESS(PWM9DCH,0)
// PWM9DCH<PWM9DC3>
extern volatile __bit                   PWM9DC3             __at(0x30D9);	// @ (0x61B * 8 + 1)
#define                                 PWM9DC3_bit         _BIT_ACCESS(PWM9DCH,1)
// PWM9DCH<PWM9DC4>
extern volatile __bit                   PWM9DC4             __at(0x30DA);	// @ (0x61B * 8 + 2)
#define                                 PWM9DC4_bit         _BIT_ACCESS(PWM9DCH,2)
// PWM9DCH<PWM9DC5>
extern volatile __bit                   PWM9DC5             __at(0x30DB);	// @ (0x61B * 8 + 3)
#define                                 PWM9DC5_bit         _BIT_ACCESS(PWM9DCH,3)
// PWM9DCH<PWM9DC6>
extern volatile __bit                   PWM9DC6             __at(0x30DC);	// @ (0x61B * 8 + 4)
#define                                 PWM9DC6_bit         _BIT_ACCESS(PWM9DCH,4)
// PWM9DCH<PWM9DC7>
extern volatile __bit                   PWM9DC7             __at(0x30DD);	// @ (0x61B * 8 + 5)
#define                                 PWM9DC7_bit         _BIT_ACCESS(PWM9DCH,5)
// PWM9DCH<PWM9DC8>
extern volatile __bit                   PWM9DC8             __at(0x30DE);	// @ (0x61B * 8 + 6)
#define                                 PWM9DC8_bit         _BIT_ACCESS(PWM9DCH,6)
// PWM9DCH<PWM9DC9>
extern volatile __bit                   PWM9DC9             __at(0x30DF);	// @ (0x61B * 8 + 7)
#define                                 PWM9DC9_bit         _BIT_ACCESS(PWM9DCH,7)
// PWM9CON<PWM9EN>
extern volatile __bit                   PWM9EN              __at(0x30E7);	// @ (0x61C * 8 + 7)
#define                                 PWM9EN_bit          _BIT_ACCESS(PWM9CON,7)
// PWM9CON<PWM9OUT>
extern volatile __bit                   PWM9OUT             __at(0x30E5);	// @ (0x61C * 8 + 5)
#define                                 PWM9OUT_bit         _BIT_ACCESS(PWM9CON,5)
// PWM9CON<PWM9POL>
extern volatile __bit                   PWM9POL             __at(0x30E4);	// @ (0x61C * 8 + 4)
#define                                 PWM9POL_bit         _BIT_ACCESS(PWM9CON,4)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x60);	// @ (0xC * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x61);	// @ (0xC * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x62);	// @ (0xC * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x63);	// @ (0xC * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA4>
extern volatile __bit                   RA4                 __at(0x64);	// @ (0xC * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(PORTA,4)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x65);	// @ (0xC * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// PORTA<RA6>
extern volatile __bit                   RA6                 __at(0x66);	// @ (0xC * 8 + 6)
#define                                 RA6_bit             _BIT_ACCESS(PORTA,6)
// PORTA<RA7>
extern volatile __bit                   RA7                 __at(0x67);	// @ (0xC * 8 + 7)
#define                                 RA7_bit             _BIT_ACCESS(PORTA,7)
// PORTB<RB0>
extern volatile __bit                   RB0                 __at(0x68);	// @ (0xD * 8 + 0)
#define                                 RB0_bit             _BIT_ACCESS(PORTB,0)
// PORTB<RB1>
extern volatile __bit                   RB1                 __at(0x69);	// @ (0xD * 8 + 1)
#define                                 RB1_bit             _BIT_ACCESS(PORTB,1)
// PORTB<RB2>
extern volatile __bit                   RB2                 __at(0x6A);	// @ (0xD * 8 + 2)
#define                                 RB2_bit             _BIT_ACCESS(PORTB,2)
// PORTB<RB3>
extern volatile __bit                   RB3                 __at(0x6B);	// @ (0xD * 8 + 3)
#define                                 RB3_bit             _BIT_ACCESS(PORTB,3)
// PORTB<RB4>
extern volatile __bit                   RB4                 __at(0x6C);	// @ (0xD * 8 + 4)
#define                                 RB4_bit             _BIT_ACCESS(PORTB,4)
// PORTB<RB5>
extern volatile __bit                   RB5                 __at(0x6D);	// @ (0xD * 8 + 5)
#define                                 RB5_bit             _BIT_ACCESS(PORTB,5)
// PORTB<RB6>
extern volatile __bit                   RB6                 __at(0x6E);	// @ (0xD * 8 + 6)
#define                                 RB6_bit             _BIT_ACCESS(PORTB,6)
// PORTB<RB7>
extern volatile __bit                   RB7                 __at(0x6F);	// @ (0xD * 8 + 7)
#define                                 RB7_bit             _BIT_ACCESS(PORTB,7)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x70);	// @ (0xE * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x71);	// @ (0xE * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x72);	// @ (0xE * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// PORTC<RC3>
extern volatile __bit                   RC3                 __at(0x73);	// @ (0xE * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x74);	// @ (0xE * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x75);	// @ (0xE * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// PORTC<RC6>
extern volatile __bit                   RC6                 __at(0x76);	// @ (0xE * 8 + 6)
#define                                 RC6_bit             _BIT_ACCESS(PORTC,6)
// PORTC<RC7>
extern volatile __bit                   RC7                 __at(0x77);	// @ (0xE * 8 + 7)
#define                                 RC7_bit             _BIT_ACCESS(PORTC,7)
// SSP1CON2<RCEN>
extern volatile __bit                   RCEN                __at(0x10B3);	// @ (0x216 * 8 + 3)
#define                                 RCEN_bit            _BIT_ACCESS(SSP1CON2,3)
// BAUD1CON<RCIDL>
extern volatile __bit                   RCIDL               __at(0xCFE);	// @ (0x19F * 8 + 6)
#define                                 RCIDL_bit           _BIT_ACCESS(BAUD1CON,6)
// PIE1<RCIE>
extern volatile __bit                   RCIE                __at(0x48D);	// @ (0x91 * 8 + 5)
#define                                 RCIE_bit            _BIT_ACCESS(PIE1,5)
// PIR1<RCIF>
extern volatile __bit                   RCIF                __at(0x8D);	// @ (0x11 * 8 + 5)
#define                                 RCIF_bit            _BIT_ACCESS(PIR1,5)
// PMCON1<RD>
extern volatile __bit                   RD                  __at(0xCA8);	// @ (0x195 * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(PMCON1,0)
// PORTD<RD0>
extern volatile __bit                   RD0                 __at(0x78);	// @ (0xF * 8 + 0)
#define                                 RD0_bit             _BIT_ACCESS(PORTD,0)
// PORTD<RD1>
extern volatile __bit                   RD1                 __at(0x79);	// @ (0xF * 8 + 1)
#define                                 RD1_bit             _BIT_ACCESS(PORTD,1)
// PORTD<RD2>
extern volatile __bit                   RD2                 __at(0x7A);	// @ (0xF * 8 + 2)
#define                                 RD2_bit             _BIT_ACCESS(PORTD,2)
// PORTD<RD3>
extern volatile __bit                   RD3                 __at(0x7B);	// @ (0xF * 8 + 3)
#define                                 RD3_bit             _BIT_ACCESS(PORTD,3)
// PORTD<RD4>
extern volatile __bit                   RD4                 __at(0x7C);	// @ (0xF * 8 + 4)
#define                                 RD4_bit             _BIT_ACCESS(PORTD,4)
// PORTD<RD5>
extern volatile __bit                   RD5                 __at(0x7D);	// @ (0xF * 8 + 5)
#define                                 RD5_bit             _BIT_ACCESS(PORTD,5)
// PORTD<RD6>
extern volatile __bit                   RD6                 __at(0x7E);	// @ (0xF * 8 + 6)
#define                                 RD6_bit             _BIT_ACCESS(PORTD,6)
// PORTD<RD7>
extern volatile __bit                   RD7                 __at(0x7F);	// @ (0xF * 8 + 7)
#define                                 RD7_bit             _BIT_ACCESS(PORTD,7)
// PORTE<RE0>
extern volatile __bit                   RE0                 __at(0x80);	// @ (0x10 * 8 + 0)
#define                                 RE0_bit             _BIT_ACCESS(PORTE,0)
// PORTE<RE1>
extern volatile __bit                   RE1                 __at(0x81);	// @ (0x10 * 8 + 1)
#define                                 RE1_bit             _BIT_ACCESS(PORTE,1)
// PORTE<RE2>
extern volatile __bit                   RE2                 __at(0x82);	// @ (0x10 * 8 + 2)
#define                                 RE2_bit             _BIT_ACCESS(PORTE,2)
// PORTE<RE3>
extern volatile __bit                   RE3                 __at(0x83);	// @ (0x10 * 8 + 3)
#define                                 RE3_bit             _BIT_ACCESS(PORTE,3)
// PRG1CON0<RG1EN>
extern volatile __bit                   RG1EN               __at(0x3C8F);	// @ (0x791 * 8 + 7)
#define                                 RG1EN_bit           _BIT_ACCESS(PRG1CON0,7)
// PRG1CON0<RG1FEDG>
extern volatile __bit                   RG1FEDG             __at(0x3C8D);	// @ (0x791 * 8 + 5)
#define                                 RG1FEDG_bit         _BIT_ACCESS(PRG1CON0,5)
// PRG1CON1<RG1FPOL>
extern volatile __bit                   RG1FPOL             __at(0x3C91);	// @ (0x792 * 8 + 1)
#define                                 RG1FPOL_bit         _BIT_ACCESS(PRG1CON1,1)
// PRG1FTSS<RG1FTSS0>
extern volatile __bit                   RG1FTSS0            __at(0x3C78);	// @ (0x78F * 8 + 0)
#define                                 RG1FTSS0_bit        _BIT_ACCESS(PRG1FTSS,0)
// PRG1FTSS<RG1FTSS1>
extern volatile __bit                   RG1FTSS1            __at(0x3C79);	// @ (0x78F * 8 + 1)
#define                                 RG1FTSS1_bit        _BIT_ACCESS(PRG1FTSS,1)
// PRG1FTSS<RG1FTSS2>
extern volatile __bit                   RG1FTSS2            __at(0x3C7A);	// @ (0x78F * 8 + 2)
#define                                 RG1FTSS2_bit        _BIT_ACCESS(PRG1FTSS,2)
// PRG1FTSS<RG1FTSS3>
extern volatile __bit                   RG1FTSS3            __at(0x3C7B);	// @ (0x78F * 8 + 3)
#define                                 RG1FTSS3_bit        _BIT_ACCESS(PRG1FTSS,3)
// PRG1CON0<RG1GO>
extern volatile __bit                   RG1GO               __at(0x3C88);	// @ (0x791 * 8 + 0)
#define                                 RG1GO_bit           _BIT_ACCESS(PRG1CON0,0)
// PRG1INS<RG1INS0>
extern volatile __bit                   RG1INS0             __at(0x3C80);	// @ (0x790 * 8 + 0)
#define                                 RG1INS0_bit         _BIT_ACCESS(PRG1INS,0)
// PRG1INS<RG1INS1>
extern volatile __bit                   RG1INS1             __at(0x3C81);	// @ (0x790 * 8 + 1)
#define                                 RG1INS1_bit         _BIT_ACCESS(PRG1INS,1)
// PRG1INS<RG1INS2>
extern volatile __bit                   RG1INS2             __at(0x3C82);	// @ (0x790 * 8 + 2)
#define                                 RG1INS2_bit         _BIT_ACCESS(PRG1INS,2)
// PRG1INS<RG1INS3>
extern volatile __bit                   RG1INS3             __at(0x3C83);	// @ (0x790 * 8 + 3)
#define                                 RG1INS3_bit         _BIT_ACCESS(PRG1INS,3)
// PRG1CON2<RG1ISET0>
extern volatile __bit                   RG1ISET0            __at(0x3C98);	// @ (0x793 * 8 + 0)
#define                                 RG1ISET0_bit        _BIT_ACCESS(PRG1CON2,0)
// PRG1CON2<RG1ISET1>
extern volatile __bit                   RG1ISET1            __at(0x3C99);	// @ (0x793 * 8 + 1)
#define                                 RG1ISET1_bit        _BIT_ACCESS(PRG1CON2,1)
// PRG1CON2<RG1ISET2>
extern volatile __bit                   RG1ISET2            __at(0x3C9A);	// @ (0x793 * 8 + 2)
#define                                 RG1ISET2_bit        _BIT_ACCESS(PRG1CON2,2)
// PRG1CON2<RG1ISET3>
extern volatile __bit                   RG1ISET3            __at(0x3C9B);	// @ (0x793 * 8 + 3)
#define                                 RG1ISET3_bit        _BIT_ACCESS(PRG1CON2,3)
// PRG1CON2<RG1ISET4>
extern volatile __bit                   RG1ISET4            __at(0x3C9C);	// @ (0x793 * 8 + 4)
#define                                 RG1ISET4_bit        _BIT_ACCESS(PRG1CON2,4)
// PRG1CON0<RG1MODE0>
extern volatile __bit                   RG1MODE0            __at(0x3C8A);	// @ (0x791 * 8 + 2)
#define                                 RG1MODE0_bit        _BIT_ACCESS(PRG1CON0,2)
// PRG1CON0<RG1MODE1>
extern volatile __bit                   RG1MODE1            __at(0x3C8B);	// @ (0x791 * 8 + 3)
#define                                 RG1MODE1_bit        _BIT_ACCESS(PRG1CON0,3)
// PRG1CON0<RG1OS>
extern volatile __bit                   RG1OS               __at(0x3C89);	// @ (0x791 * 8 + 1)
#define                                 RG1OS_bit           _BIT_ACCESS(PRG1CON0,1)
// PRG1CON1<RG1RDY>
extern volatile __bit                   RG1RDY              __at(0x3C92);	// @ (0x792 * 8 + 2)
#define                                 RG1RDY_bit          _BIT_ACCESS(PRG1CON1,2)
// PRG1CON0<RG1REDG>
extern volatile __bit                   RG1REDG             __at(0x3C8C);	// @ (0x791 * 8 + 4)
#define                                 RG1REDG_bit         _BIT_ACCESS(PRG1CON0,4)
// PRG1CON1<RG1RPOL>
extern volatile __bit                   RG1RPOL             __at(0x3C90);	// @ (0x792 * 8 + 0)
#define                                 RG1RPOL_bit         _BIT_ACCESS(PRG1CON1,0)
// PRG1RTSS<RG1RTSS0>
extern volatile __bit                   RG1RTSS0            __at(0x3C70);	// @ (0x78E * 8 + 0)
#define                                 RG1RTSS0_bit        _BIT_ACCESS(PRG1RTSS,0)
// PRG1RTSS<RG1RTSS1>
extern volatile __bit                   RG1RTSS1            __at(0x3C71);	// @ (0x78E * 8 + 1)
#define                                 RG1RTSS1_bit        _BIT_ACCESS(PRG1RTSS,1)
// PRG1RTSS<RG1RTSS2>
extern volatile __bit                   RG1RTSS2            __at(0x3C72);	// @ (0x78E * 8 + 2)
#define                                 RG1RTSS2_bit        _BIT_ACCESS(PRG1RTSS,2)
// PRG1RTSS<RG1RTSS3>
extern volatile __bit                   RG1RTSS3            __at(0x3C73);	// @ (0x78E * 8 + 3)
#define                                 RG1RTSS3_bit        _BIT_ACCESS(PRG1RTSS,3)
// PRG2CON0<RG2EN>
extern volatile __bit                   RG2EN               __at(0x3CBF);	// @ (0x797 * 8 + 7)
#define                                 RG2EN_bit           _BIT_ACCESS(PRG2CON0,7)
// PRG2CON0<RG2FEDG>
extern volatile __bit                   RG2FEDG             __at(0x3CBD);	// @ (0x797 * 8 + 5)
#define                                 RG2FEDG_bit         _BIT_ACCESS(PRG2CON0,5)
// PRG2CON1<RG2FPOL>
extern volatile __bit                   RG2FPOL             __at(0x3CC1);	// @ (0x798 * 8 + 1)
#define                                 RG2FPOL_bit         _BIT_ACCESS(PRG2CON1,1)
// PRG2FTSS<RG2FTSS0>
extern volatile __bit                   RG2FTSS0            __at(0x3CA8);	// @ (0x795 * 8 + 0)
#define                                 RG2FTSS0_bit        _BIT_ACCESS(PRG2FTSS,0)
// PRG2FTSS<RG2FTSS1>
extern volatile __bit                   RG2FTSS1            __at(0x3CA9);	// @ (0x795 * 8 + 1)
#define                                 RG2FTSS1_bit        _BIT_ACCESS(PRG2FTSS,1)
// PRG2FTSS<RG2FTSS2>
extern volatile __bit                   RG2FTSS2            __at(0x3CAA);	// @ (0x795 * 8 + 2)
#define                                 RG2FTSS2_bit        _BIT_ACCESS(PRG2FTSS,2)
// PRG2FTSS<RG2FTSS3>
extern volatile __bit                   RG2FTSS3            __at(0x3CAB);	// @ (0x795 * 8 + 3)
#define                                 RG2FTSS3_bit        _BIT_ACCESS(PRG2FTSS,3)
// PRG2CON0<RG2GO>
extern volatile __bit                   RG2GO               __at(0x3CB8);	// @ (0x797 * 8 + 0)
#define                                 RG2GO_bit           _BIT_ACCESS(PRG2CON0,0)
// PRG2INS<RG2INS0>
extern volatile __bit                   RG2INS0             __at(0x3CB0);	// @ (0x796 * 8 + 0)
#define                                 RG2INS0_bit         _BIT_ACCESS(PRG2INS,0)
// PRG2INS<RG2INS1>
extern volatile __bit                   RG2INS1             __at(0x3CB1);	// @ (0x796 * 8 + 1)
#define                                 RG2INS1_bit         _BIT_ACCESS(PRG2INS,1)
// PRG2INS<RG2INS2>
extern volatile __bit                   RG2INS2             __at(0x3CB2);	// @ (0x796 * 8 + 2)
#define                                 RG2INS2_bit         _BIT_ACCESS(PRG2INS,2)
// PRG2INS<RG2INS3>
