MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1779/mcu.h
extern volatile __bit                   RG2INS3             __at(0x3CB3);	// @ (0x796 * 8 + 3)
#define                                 RG2INS3_bit         _BIT_ACCESS(PRG2INS,3)
// PRG2CON2<RG2ISET0>
extern volatile __bit                   RG2ISET0            __at(0x3CC8);	// @ (0x799 * 8 + 0)
#define                                 RG2ISET0_bit        _BIT_ACCESS(PRG2CON2,0)
// PRG2CON2<RG2ISET1>
extern volatile __bit                   RG2ISET1            __at(0x3CC9);	// @ (0x799 * 8 + 1)
#define                                 RG2ISET1_bit        _BIT_ACCESS(PRG2CON2,1)
// PRG2CON2<RG2ISET2>
extern volatile __bit                   RG2ISET2            __at(0x3CCA);	// @ (0x799 * 8 + 2)
#define                                 RG2ISET2_bit        _BIT_ACCESS(PRG2CON2,2)
// PRG2CON2<RG2ISET3>
extern volatile __bit                   RG2ISET3            __at(0x3CCB);	// @ (0x799 * 8 + 3)
#define                                 RG2ISET3_bit        _BIT_ACCESS(PRG2CON2,3)
// PRG2CON2<RG2ISET4>
extern volatile __bit                   RG2ISET4            __at(0x3CCC);	// @ (0x799 * 8 + 4)
#define                                 RG2ISET4_bit        _BIT_ACCESS(PRG2CON2,4)
// PRG2CON0<RG2MODE0>
extern volatile __bit                   RG2MODE0            __at(0x3CBA);	// @ (0x797 * 8 + 2)
#define                                 RG2MODE0_bit        _BIT_ACCESS(PRG2CON0,2)
// PRG2CON0<RG2MODE1>
extern volatile __bit                   RG2MODE1            __at(0x3CBB);	// @ (0x797 * 8 + 3)
#define                                 RG2MODE1_bit        _BIT_ACCESS(PRG2CON0,3)
// PRG2CON0<RG2OS>
extern volatile __bit                   RG2OS               __at(0x3CB9);	// @ (0x797 * 8 + 1)
#define                                 RG2OS_bit           _BIT_ACCESS(PRG2CON0,1)
// PRG2CON1<RG2RDY>
extern volatile __bit                   RG2RDY              __at(0x3CC2);	// @ (0x798 * 8 + 2)
#define                                 RG2RDY_bit          _BIT_ACCESS(PRG2CON1,2)
// PRG2CON0<RG2REDG>
extern volatile __bit                   RG2REDG             __at(0x3CBC);	// @ (0x797 * 8 + 4)
#define                                 RG2REDG_bit         _BIT_ACCESS(PRG2CON0,4)
// PRG2CON1<RG2RPOL>
extern volatile __bit                   RG2RPOL             __at(0x3CC0);	// @ (0x798 * 8 + 0)
#define                                 RG2RPOL_bit         _BIT_ACCESS(PRG2CON1,0)
// PRG2RTSS<RG2RTSS0>
extern volatile __bit                   RG2RTSS0            __at(0x3CA0);	// @ (0x794 * 8 + 0)
#define                                 RG2RTSS0_bit        _BIT_ACCESS(PRG2RTSS,0)
// PRG2RTSS<RG2RTSS1>
extern volatile __bit                   RG2RTSS1            __at(0x3CA1);	// @ (0x794 * 8 + 1)
#define                                 RG2RTSS1_bit        _BIT_ACCESS(PRG2RTSS,1)
// PRG2RTSS<RG2RTSS2>
extern volatile __bit                   RG2RTSS2            __at(0x3CA2);	// @ (0x794 * 8 + 2)
#define                                 RG2RTSS2_bit        _BIT_ACCESS(PRG2RTSS,2)
// PRG2RTSS<RG2RTSS3>
extern volatile __bit                   RG2RTSS3            __at(0x3CA3);	// @ (0x794 * 8 + 3)
#define                                 RG2RTSS3_bit        _BIT_ACCESS(PRG2RTSS,3)
// PRG3CON0<RG3EN>
extern volatile __bit                   RG3EN               __at(0x3CEF);	// @ (0x79D * 8 + 7)
#define                                 RG3EN_bit           _BIT_ACCESS(PRG3CON0,7)
// PRG3CON0<RG3FEDG>
extern volatile __bit                   RG3FEDG             __at(0x3CED);	// @ (0x79D * 8 + 5)
#define                                 RG3FEDG_bit         _BIT_ACCESS(PRG3CON0,5)
// PRG3CON1<RG3FPOL>
extern volatile __bit                   RG3FPOL             __at(0x3CF1);	// @ (0x79E * 8 + 1)
#define                                 RG3FPOL_bit         _BIT_ACCESS(PRG3CON1,1)
// PRG3FTSS<RG3FTSS0>
extern volatile __bit                   RG3FTSS0            __at(0x3CD8);	// @ (0x79B * 8 + 0)
#define                                 RG3FTSS0_bit        _BIT_ACCESS(PRG3FTSS,0)
// PRG3FTSS<RG3FTSS1>
extern volatile __bit                   RG3FTSS1            __at(0x3CD9);	// @ (0x79B * 8 + 1)
#define                                 RG3FTSS1_bit        _BIT_ACCESS(PRG3FTSS,1)
// PRG3FTSS<RG3FTSS2>
extern volatile __bit                   RG3FTSS2            __at(0x3CDA);	// @ (0x79B * 8 + 2)
#define                                 RG3FTSS2_bit        _BIT_ACCESS(PRG3FTSS,2)
// PRG3FTSS<RG3FTSS3>
extern volatile __bit                   RG3FTSS3            __at(0x3CDB);	// @ (0x79B * 8 + 3)
#define                                 RG3FTSS3_bit        _BIT_ACCESS(PRG3FTSS,3)
// PRG3CON0<RG3GO>
extern volatile __bit                   RG3GO               __at(0x3CE8);	// @ (0x79D * 8 + 0)
#define                                 RG3GO_bit           _BIT_ACCESS(PRG3CON0,0)
// PRG3INS<RG3INS0>
extern volatile __bit                   RG3INS0             __at(0x3CE0);	// @ (0x79C * 8 + 0)
#define                                 RG3INS0_bit         _BIT_ACCESS(PRG3INS,0)
// PRG3INS<RG3INS1>
extern volatile __bit                   RG3INS1             __at(0x3CE1);	// @ (0x79C * 8 + 1)
#define                                 RG3INS1_bit         _BIT_ACCESS(PRG3INS,1)
// PRG3INS<RG3INS2>
extern volatile __bit                   RG3INS2             __at(0x3CE2);	// @ (0x79C * 8 + 2)
#define                                 RG3INS2_bit         _BIT_ACCESS(PRG3INS,2)
// PRG3INS<RG3INS3>
extern volatile __bit                   RG3INS3             __at(0x3CE3);	// @ (0x79C * 8 + 3)
#define                                 RG3INS3_bit         _BIT_ACCESS(PRG3INS,3)
// PRG3CON2<RG3ISET0>
extern volatile __bit                   RG3ISET0            __at(0x3CF8);	// @ (0x79F * 8 + 0)
#define                                 RG3ISET0_bit        _BIT_ACCESS(PRG3CON2,0)
// PRG3CON2<RG3ISET1>
extern volatile __bit                   RG3ISET1            __at(0x3CF9);	// @ (0x79F * 8 + 1)
#define                                 RG3ISET1_bit        _BIT_ACCESS(PRG3CON2,1)
// PRG3CON2<RG3ISET2>
extern volatile __bit                   RG3ISET2            __at(0x3CFA);	// @ (0x79F * 8 + 2)
#define                                 RG3ISET2_bit        _BIT_ACCESS(PRG3CON2,2)
// PRG3CON2<RG3ISET3>
extern volatile __bit                   RG3ISET3            __at(0x3CFB);	// @ (0x79F * 8 + 3)
#define                                 RG3ISET3_bit        _BIT_ACCESS(PRG3CON2,3)
// PRG3CON2<RG3ISET4>
extern volatile __bit                   RG3ISET4            __at(0x3CFC);	// @ (0x79F * 8 + 4)
#define                                 RG3ISET4_bit        _BIT_ACCESS(PRG3CON2,4)
// PRG3CON0<RG3MODE0>
extern volatile __bit                   RG3MODE0            __at(0x3CEA);	// @ (0x79D * 8 + 2)
#define                                 RG3MODE0_bit        _BIT_ACCESS(PRG3CON0,2)
// PRG3CON0<RG3MODE1>
extern volatile __bit                   RG3MODE1            __at(0x3CEB);	// @ (0x79D * 8 + 3)
#define                                 RG3MODE1_bit        _BIT_ACCESS(PRG3CON0,3)
// PRG3CON0<RG3OS>
extern volatile __bit                   RG3OS               __at(0x3CE9);	// @ (0x79D * 8 + 1)
#define                                 RG3OS_bit           _BIT_ACCESS(PRG3CON0,1)
// PRG3CON1<RG3RDY>
extern volatile __bit                   RG3RDY              __at(0x3CF2);	// @ (0x79E * 8 + 2)
#define                                 RG3RDY_bit          _BIT_ACCESS(PRG3CON1,2)
// PRG3CON0<RG3REDG>
extern volatile __bit                   RG3REDG             __at(0x3CEC);	// @ (0x79D * 8 + 4)
#define                                 RG3REDG_bit         _BIT_ACCESS(PRG3CON0,4)
// PRG3CON1<RG3RPOL>
extern volatile __bit                   RG3RPOL             __at(0x3CF0);	// @ (0x79E * 8 + 0)
#define                                 RG3RPOL_bit         _BIT_ACCESS(PRG3CON1,0)
// PRG3RTSS<RG3RTSS0>
extern volatile __bit                   RG3RTSS0            __at(0x3CD0);	// @ (0x79A * 8 + 0)
#define                                 RG3RTSS0_bit        _BIT_ACCESS(PRG3RTSS,0)
// PRG3RTSS<RG3RTSS1>
extern volatile __bit                   RG3RTSS1            __at(0x3CD1);	// @ (0x79A * 8 + 1)
#define                                 RG3RTSS1_bit        _BIT_ACCESS(PRG3RTSS,1)
// PRG3RTSS<RG3RTSS2>
extern volatile __bit                   RG3RTSS2            __at(0x3CD2);	// @ (0x79A * 8 + 2)
#define                                 RG3RTSS2_bit        _BIT_ACCESS(PRG3RTSS,2)
// PRG3RTSS<RG3RTSS3>
extern volatile __bit                   RG3RTSS3            __at(0x3CD3);	// @ (0x79A * 8 + 3)
#define                                 RG3RTSS3_bit        _BIT_ACCESS(PRG3RTSS,3)
// PRG4CON0<RG4EN>
extern volatile __bit                   RG4EN               __at(0x308F);	// @ (0x611 * 8 + 7)
#define                                 RG4EN_bit           _BIT_ACCESS(PRG4CON0,7)
// PRG4CON0<RG4FEDG>
extern volatile __bit                   RG4FEDG             __at(0x308D);	// @ (0x611 * 8 + 5)
#define                                 RG4FEDG_bit         _BIT_ACCESS(PRG4CON0,5)
// PRG4CON1<RG4FPOL>
extern volatile __bit                   RG4FPOL             __at(0x3091);	// @ (0x612 * 8 + 1)
#define                                 RG4FPOL_bit         _BIT_ACCESS(PRG4CON1,1)
// PRG4FTSS<RG4FTSS0>
extern volatile __bit                   RG4FTSS0            __at(0x3078);	// @ (0x60F * 8 + 0)
#define                                 RG4FTSS0_bit        _BIT_ACCESS(PRG4FTSS,0)
// PRG4FTSS<RG4FTSS1>
extern volatile __bit                   RG4FTSS1            __at(0x3079);	// @ (0x60F * 8 + 1)
#define                                 RG4FTSS1_bit        _BIT_ACCESS(PRG4FTSS,1)
// PRG4FTSS<RG4FTSS2>
extern volatile __bit                   RG4FTSS2            __at(0x307A);	// @ (0x60F * 8 + 2)
#define                                 RG4FTSS2_bit        _BIT_ACCESS(PRG4FTSS,2)
// PRG4FTSS<RG4FTSS3>
extern volatile __bit                   RG4FTSS3            __at(0x307B);	// @ (0x60F * 8 + 3)
#define                                 RG4FTSS3_bit        _BIT_ACCESS(PRG4FTSS,3)
// PRG4CON0<RG4GO>
extern volatile __bit                   RG4GO               __at(0x3088);	// @ (0x611 * 8 + 0)
#define                                 RG4GO_bit           _BIT_ACCESS(PRG4CON0,0)
// PRG4INS<RG4INS0>
extern volatile __bit                   RG4INS0             __at(0x3080);	// @ (0x610 * 8 + 0)
#define                                 RG4INS0_bit         _BIT_ACCESS(PRG4INS,0)
// PRG4INS<RG4INS1>
extern volatile __bit                   RG4INS1             __at(0x3081);	// @ (0x610 * 8 + 1)
#define                                 RG4INS1_bit         _BIT_ACCESS(PRG4INS,1)
// PRG4INS<RG4INS2>
extern volatile __bit                   RG4INS2             __at(0x3082);	// @ (0x610 * 8 + 2)
#define                                 RG4INS2_bit         _BIT_ACCESS(PRG4INS,2)
// PRG4INS<RG4INS3>
extern volatile __bit                   RG4INS3             __at(0x3083);	// @ (0x610 * 8 + 3)
#define                                 RG4INS3_bit         _BIT_ACCESS(PRG4INS,3)
// PRG4CON2<RG4ISET0>
extern volatile __bit                   RG4ISET0            __at(0x3098);	// @ (0x613 * 8 + 0)
#define                                 RG4ISET0_bit        _BIT_ACCESS(PRG4CON2,0)
// PRG4CON2<RG4ISET1>
extern volatile __bit                   RG4ISET1            __at(0x3099);	// @ (0x613 * 8 + 1)
#define                                 RG4ISET1_bit        _BIT_ACCESS(PRG4CON2,1)
// PRG4CON2<RG4ISET2>
extern volatile __bit                   RG4ISET2            __at(0x309A);	// @ (0x613 * 8 + 2)
#define                                 RG4ISET2_bit        _BIT_ACCESS(PRG4CON2,2)
// PRG4CON2<RG4ISET3>
extern volatile __bit                   RG4ISET3            __at(0x309B);	// @ (0x613 * 8 + 3)
#define                                 RG4ISET3_bit        _BIT_ACCESS(PRG4CON2,3)
// PRG4CON2<RG4ISET4>
extern volatile __bit                   RG4ISET4            __at(0x309C);	// @ (0x613 * 8 + 4)
#define                                 RG4ISET4_bit        _BIT_ACCESS(PRG4CON2,4)
// PRG4CON0<RG4MODE0>
extern volatile __bit                   RG4MODE0            __at(0x308A);	// @ (0x611 * 8 + 2)
#define                                 RG4MODE0_bit        _BIT_ACCESS(PRG4CON0,2)
// PRG4CON0<RG4MODE1>
extern volatile __bit                   RG4MODE1            __at(0x308B);	// @ (0x611 * 8 + 3)
#define                                 RG4MODE1_bit        _BIT_ACCESS(PRG4CON0,3)
// PRG4CON0<RG4OS>
extern volatile __bit                   RG4OS               __at(0x3089);	// @ (0x611 * 8 + 1)
#define                                 RG4OS_bit           _BIT_ACCESS(PRG4CON0,1)
// PRG4CON1<RG4RDY>
extern volatile __bit                   RG4RDY              __at(0x3092);	// @ (0x612 * 8 + 2)
#define                                 RG4RDY_bit          _BIT_ACCESS(PRG4CON1,2)
// PRG4CON0<RG4REDG>
extern volatile __bit                   RG4REDG             __at(0x308C);	// @ (0x611 * 8 + 4)
#define                                 RG4REDG_bit         _BIT_ACCESS(PRG4CON0,4)
// PRG4CON1<RG4RPOL>
extern volatile __bit                   RG4RPOL             __at(0x3090);	// @ (0x612 * 8 + 0)
#define                                 RG4RPOL_bit         _BIT_ACCESS(PRG4CON1,0)
// PRG4RTSS<RG4RTSS0>
extern volatile __bit                   RG4RTSS0            __at(0x3070);	// @ (0x60E * 8 + 0)
#define                                 RG4RTSS0_bit        _BIT_ACCESS(PRG4RTSS,0)
// PRG4RTSS<RG4RTSS1>
extern volatile __bit                   RG4RTSS1            __at(0x3071);	// @ (0x60E * 8 + 1)
#define                                 RG4RTSS1_bit        _BIT_ACCESS(PRG4RTSS,1)
// PRG4RTSS<RG4RTSS2>
extern volatile __bit                   RG4RTSS2            __at(0x3072);	// @ (0x60E * 8 + 2)
#define                                 RG4RTSS2_bit        _BIT_ACCESS(PRG4RTSS,2)
// PRG4RTSS<RG4RTSS3>
extern volatile __bit                   RG4RTSS3            __at(0x3073);	// @ (0x60E * 8 + 3)
#define                                 RG4RTSS3_bit        _BIT_ACCESS(PRG4RTSS,3)
// SSP1CON2<RSEN>
extern volatile __bit                   RSEN                __at(0x10B1);	// @ (0x216 * 8 + 1)
#define                                 RSEN_bit            _BIT_ACCESS(SSP1CON2,1)
// RC1STA<RX9>
extern volatile __bit                   RX9                 __at(0xCEE);	// @ (0x19D * 8 + 6)
#define                                 RX9_bit             _BIT_ACCESS(RC1STA,6)
// RC1STA<RX9D>
extern volatile __bit                   RX9D                __at(0xCE8);	// @ (0x19D * 8 + 0)
#define                                 RX9D_bit            _BIT_ACCESS(RC1STA,0)
// SSP1STAT<R_nW>
extern volatile __bit                   R_nW                __at(0x10A2);	// @ (0x214 * 8 + 2)
#define                                 R_nW_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP1CON3<SBCDE>
extern volatile __bit                   SBCDE               __at(0x10BA);	// @ (0x217 * 8 + 2)
#define                                 SBCDE_bit           _BIT_ACCESS(SSP1CON3,2)
// BORCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x4EF);	// @ (0x9D * 8 + 7)
#define                                 SBOREN_bit          _BIT_ACCESS(BORCON,7)
// SSP1CON3<SCIE>
extern volatile __bit                   SCIE                __at(0x10BD);	// @ (0x217 * 8 + 5)
#define                                 SCIE_bit            _BIT_ACCESS(SSP1CON3,5)
// BAUD1CON<SCKP>
extern volatile __bit                   SCKP                __at(0xCFC);	// @ (0x19F * 8 + 4)
#define                                 SCKP_bit            _BIT_ACCESS(BAUD1CON,4)
// OSCCON<SCS0>
extern volatile __bit                   SCS0                __at(0x4D8);	// @ (0x9B * 8 + 0)
#define                                 SCS0_bit            _BIT_ACCESS(OSCCON,0)
// OSCCON<SCS1>
extern volatile __bit                   SCS1                __at(0x4D9);	// @ (0x9B * 8 + 1)
#define                                 SCS1_bit            _BIT_ACCESS(OSCCON,1)
// SSP1CON3<SDAHT>
extern volatile __bit                   SDAHT               __at(0x10BB);	// @ (0x217 * 8 + 3)
#define                                 SDAHT_bit           _BIT_ACCESS(SSP1CON3,3)
// SSP1CON2<SEN>
extern volatile __bit                   SEN                 __at(0x10B0);	// @ (0x216 * 8 + 0)
#define                                 SEN_bit             _BIT_ACCESS(SSP1CON2,0)
// TX1STA<SENDB>
extern volatile __bit                   SENDB               __at(0xCF3);	// @ (0x19E * 8 + 3)
#define                                 SENDB_bit           _BIT_ACCESS(TX1STA,3)
// SLRCONA<SLRA0>
extern volatile __bit                   SLRA0               __at(0x1860);	// @ (0x30C * 8 + 0)
#define                                 SLRA0_bit           _BIT_ACCESS(SLRCONA,0)
// SLRCONA<SLRA1>
extern volatile __bit                   SLRA1               __at(0x1861);	// @ (0x30C * 8 + 1)
#define                                 SLRA1_bit           _BIT_ACCESS(SLRCONA,1)
// SLRCONA<SLRA2>
extern volatile __bit                   SLRA2               __at(0x1862);	// @ (0x30C * 8 + 2)
#define                                 SLRA2_bit           _BIT_ACCESS(SLRCONA,2)
// SLRCONA<SLRA3>
extern volatile __bit                   SLRA3               __at(0x1863);	// @ (0x30C * 8 + 3)
#define                                 SLRA3_bit           _BIT_ACCESS(SLRCONA,3)
// SLRCONA<SLRA4>
extern volatile __bit                   SLRA4               __at(0x1864);	// @ (0x30C * 8 + 4)
#define                                 SLRA4_bit           _BIT_ACCESS(SLRCONA,4)
// SLRCONA<SLRA5>
extern volatile __bit                   SLRA5               __at(0x1865);	// @ (0x30C * 8 + 5)
#define                                 SLRA5_bit           _BIT_ACCESS(SLRCONA,5)
// SLRCONA<SLRA6>
extern volatile __bit                   SLRA6               __at(0x1866);	// @ (0x30C * 8 + 6)
#define                                 SLRA6_bit           _BIT_ACCESS(SLRCONA,6)
// SLRCONA<SLRA7>
extern volatile __bit                   SLRA7               __at(0x1867);	// @ (0x30C * 8 + 7)
#define                                 SLRA7_bit           _BIT_ACCESS(SLRCONA,7)
// SLRCONB<SLRB0>
extern volatile __bit                   SLRB0               __at(0x1868);	// @ (0x30D * 8 + 0)
#define                                 SLRB0_bit           _BIT_ACCESS(SLRCONB,0)
// SLRCONB<SLRB1>
extern volatile __bit                   SLRB1               __at(0x1869);	// @ (0x30D * 8 + 1)
#define                                 SLRB1_bit           _BIT_ACCESS(SLRCONB,1)
// SLRCONB<SLRB2>
extern volatile __bit                   SLRB2               __at(0x186A);	// @ (0x30D * 8 + 2)
#define                                 SLRB2_bit           _BIT_ACCESS(SLRCONB,2)
// SLRCONB<SLRB3>
extern volatile __bit                   SLRB3               __at(0x186B);	// @ (0x30D * 8 + 3)
#define                                 SLRB3_bit           _BIT_ACCESS(SLRCONB,3)
// SLRCONB<SLRB4>
extern volatile __bit                   SLRB4               __at(0x186C);	// @ (0x30D * 8 + 4)
#define                                 SLRB4_bit           _BIT_ACCESS(SLRCONB,4)
// SLRCONB<SLRB5>
extern volatile __bit                   SLRB5               __at(0x186D);	// @ (0x30D * 8 + 5)
#define                                 SLRB5_bit           _BIT_ACCESS(SLRCONB,5)
// SLRCONB<SLRB6>
extern volatile __bit                   SLRB6               __at(0x186E);	// @ (0x30D * 8 + 6)
#define                                 SLRB6_bit           _BIT_ACCESS(SLRCONB,6)
// SLRCONB<SLRB7>
extern volatile __bit                   SLRB7               __at(0x186F);	// @ (0x30D * 8 + 7)
#define                                 SLRB7_bit           _BIT_ACCESS(SLRCONB,7)
// SLRCONC<SLRC0>
extern volatile __bit                   SLRC0               __at(0x1870);	// @ (0x30E * 8 + 0)
#define                                 SLRC0_bit           _BIT_ACCESS(SLRCONC,0)
// SLRCONC<SLRC1>
extern volatile __bit                   SLRC1               __at(0x1871);	// @ (0x30E * 8 + 1)
#define                                 SLRC1_bit           _BIT_ACCESS(SLRCONC,1)
// SLRCONC<SLRC2>
extern volatile __bit                   SLRC2               __at(0x1872);	// @ (0x30E * 8 + 2)
#define                                 SLRC2_bit           _BIT_ACCESS(SLRCONC,2)
// SLRCONC<SLRC3>
extern volatile __bit                   SLRC3               __at(0x1873);	// @ (0x30E * 8 + 3)
#define                                 SLRC3_bit           _BIT_ACCESS(SLRCONC,3)
// SLRCONC<SLRC4>
extern volatile __bit                   SLRC4               __at(0x1874);	// @ (0x30E * 8 + 4)
#define                                 SLRC4_bit           _BIT_ACCESS(SLRCONC,4)
// SLRCONC<SLRC5>
extern volatile __bit                   SLRC5               __at(0x1875);	// @ (0x30E * 8 + 5)
#define                                 SLRC5_bit           _BIT_ACCESS(SLRCONC,5)
// SLRCONC<SLRC6>
extern volatile __bit                   SLRC6               __at(0x1876);	// @ (0x30E * 8 + 6)
#define                                 SLRC6_bit           _BIT_ACCESS(SLRCONC,6)
// SLRCONC<SLRC7>
extern volatile __bit                   SLRC7               __at(0x1877);	// @ (0x30E * 8 + 7)
#define                                 SLRC7_bit           _BIT_ACCESS(SLRCONC,7)
// SLRCOND<SLRD0>
extern volatile __bit                   SLRD0               __at(0x1878);	// @ (0x30F * 8 + 0)
#define                                 SLRD0_bit           _BIT_ACCESS(SLRCOND,0)
// SLRCOND<SLRD1>
extern volatile __bit                   SLRD1               __at(0x1879);	// @ (0x30F * 8 + 1)
#define                                 SLRD1_bit           _BIT_ACCESS(SLRCOND,1)
// SLRCOND<SLRD2>
extern volatile __bit                   SLRD2               __at(0x187A);	// @ (0x30F * 8 + 2)
#define                                 SLRD2_bit           _BIT_ACCESS(SLRCOND,2)
// SLRCOND<SLRD3>
extern volatile __bit                   SLRD3               __at(0x187B);	// @ (0x30F * 8 + 3)
#define                                 SLRD3_bit           _BIT_ACCESS(SLRCOND,3)
// SLRCOND<SLRD4>
extern volatile __bit                   SLRD4               __at(0x187C);	// @ (0x30F * 8 + 4)
#define                                 SLRD4_bit           _BIT_ACCESS(SLRCOND,4)
// SLRCOND<SLRD5>
extern volatile __bit                   SLRD5               __at(0x187D);	// @ (0x30F * 8 + 5)
#define                                 SLRD5_bit           _BIT_ACCESS(SLRCOND,5)
// SLRCOND<SLRD6>
extern volatile __bit                   SLRD6               __at(0x187E);	// @ (0x30F * 8 + 6)
#define                                 SLRD6_bit           _BIT_ACCESS(SLRCOND,6)
// SLRCOND<SLRD7>
extern volatile __bit                   SLRD7               __at(0x187F);	// @ (0x30F * 8 + 7)
#define                                 SLRD7_bit           _BIT_ACCESS(SLRCOND,7)
// SLRCONE<SLRE0>
extern volatile __bit                   SLRE0               __at(0x1880);	// @ (0x310 * 8 + 0)
#define                                 SLRE0_bit           _BIT_ACCESS(SLRCONE,0)
// SLRCONE<SLRE1>
extern volatile __bit                   SLRE1               __at(0x1881);	// @ (0x310 * 8 + 1)
#define                                 SLRE1_bit           _BIT_ACCESS(SLRCONE,1)
// SLRCONE<SLRE2>
extern volatile __bit                   SLRE2               __at(0x1882);	// @ (0x310 * 8 + 2)
#define                                 SLRE2_bit           _BIT_ACCESS(SLRCONE,2)
// SSP1STAT<SMP>
extern volatile __bit                   SMP                 __at(0x10A7);	// @ (0x214 * 8 + 7)
#define                                 SMP_bit             _BIT_ACCESS(SSP1STAT,7)
// OSCSTAT<SOSCR>
extern volatile __bit                   SOSCR               __at(0x4E7);	// @ (0x9C * 8 + 7)
#define                                 SOSCR_bit           _BIT_ACCESS(OSCSTAT,7)
// RC1STA<SPEN>
extern volatile __bit                   SPEN                __at(0xCEF);	// @ (0x19D * 8 + 7)
#define                                 SPEN_bit            _BIT_ACCESS(RC1STA,7)
// OSCCON<SPLLEN>
